[[[], false, "HeheYoItsYaBoi", null, [], null, "text", "t2_3lum81by", false, false, [], false, false, 1606914004, "self.stocks", "https://www.reddit.com/r/stocks/comments/k58rpj/cnn_article_big_techs_stock_market_reign_may/", {}, "k58rpj", true, false, false, false, true, true, false, "", "news", [], "866eb162-65e6-11e5-a903-1252b640afe9", "News", "dark", "text", false, false, true, 4, 0, false, "all_ads", "/r/stocks/comments/k58rpj/cnn_article_big_techs_stock_market_reign_may/", false, 6, 1606914014, 1, "New York (CNN Business) Who says investing is hard?\n\nAll you needed to do for the past few years to enjoy solid gains in the stock market was buy an S&amp;P 500 or Nasdaq 100 index fund. That provided exposure to market darlings like the FAANG quintet of Facebook (FB), Amazon (AMZN), Apple (AAPL), Netflix (NFLX) and Google owner Alphabet (GOOGL) as well as Microsoft (MSFT).\nThe Big Tech stocks have boomed thanks to strong gains in revenue, market share and earnings over the past few years — which has raised antitrust concerns and created intense regulatory scrutiny.\n\nBut that dominance might be about to change.\n\nAfter years of growth stocks outperforming the market, some strategists and fund managers think it could be time for value sectors like banks, health care, energy, retail and others that have been laggards to emerge as new market leaders.\n\n\"We're coming out of a multi-year period of extraordinary outperformance from big cap techs. Value stocks have been so inexpensive,\" said Eric Kuby, chief investment officer with North Star Investment Management.\n\n\"A major rotation is going to take place. When valuations are so out of whack, there has to be a reversion,\" Kuby added.\n\nKuby likes smaller consumer companies like Acco Brands (ACCO), which owns Mead notebooks and Swingline staplers, as well as financial firms like the suburban Chicago-based bank Wintrust (WTFC).\n\nBanks, retailers and energy stocks all look attractive, said David Harden, president of Summit Global Investments. He thinks these three more value-oriented sectors will benefit from a stabilization in the economy in 2021 — especially if there are multiple Covid-19 vaccines available.\n\n\"There is no question value stocks will outperform. It's time to look for high quality and low volatility with larger companies,\" Harden told CNN Business. Some of Harden's top picks for 2021 include JPMorgan Chase (JPM), Walmart (WMT) and Exxon Mobil (XOM).\n\nStill, some experts say that value stocks and growth industries like tech and biotech can both do well for the foreseeable future. There is no particular reason why the FAANGs have to fall in order for other sectors to do well.\n\n\"Value versus growth is the perennial debate,\" said Dec Mullarkey, managing director of investment strategy at SLC Management. \"The recovery will be broader based because the market rally has been so tech-centric. But I don't see growth falling out of favor even if value stocks come back.\"\n\n**Growth at the right price**\n\nThat's why it might make more sense for investors to look for companies that have the characteristics of both value and growth — stocks that trade at reasonable prices but also have the potential to generate solid gains in earnings and revenue.\n\n\"We continue to think the rotation to value should be focused on creating a more balanced value/growth portfolio, and not abandoning growth/tech en masse,\" said Tom Essaye, editor of The Sevens Report investing newsletter, in a report Tuesday. \"Tech also can do well.\"\n\nEssaye added that there is \"simple logic\" for this prediction. \"Massive stimulus\" could be coming from the incoming Biden administration as well as a continuation of 0% rates from the Federal Reserve.\n\n\"The value versus growth question simplifies the market a bit. You want to find durable growth,\" said Doug Rao, a portfolio manager with Janus Henderson, in an interview with CNN Business.\nWith that in mind, Rao's firm owns stakes in industry leaders like travel company Booking (BKNG), Disney (DIS), LVMH (LVMHF) and Mastercard (MA).\n\n\"The transformation to a digital economy has been the biggest change for companies in every industry,\" Rao said. \"You want to look more for companies that are on the right side of that transformation.\"", true, false, false, "stocks", "t5_2qjfk", 941791, "public", "self", "[CNN Article] Big Tech's stock market reign may finally be about to end", 0, [], 1.0, "https://www.reddit.com/r/stocks/comments/k58rpj/cnn_article_big_techs_stock_market_reign_may/", "all_ads", 6, 1606910404.0, {"all_awardings": [], "allow_live_comments": false, "author": "HeheYoItsYaBoi", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_3lum81by", "author_patreon_flair": false, "author_premium": false, "awarders": [], "can_mod_post": false, "contest_mode": false, "created_utc": 1606914004, "domain": "self.stocks", "full_link": "https://www.reddit.com/r/stocks/comments/k58rpj/cnn_article_big_techs_stock_market_reign_may/", "gildings": {}, "id": "k58rpj", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_css_class": "news", "link_flair_richtext": [], "link_flair_template_id": "866eb162-65e6-11e5-a903-1252b640afe9", "link_flair_text": "News", "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 4, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/stocks/comments/k58rpj/cnn_article_big_techs_stock_market_reign_may/", "pinned": false, "pwls": 6, "retrieved_on": 1606914014, "score": 1, "selftext": "New York (CNN Business) Who says investing is hard?\n\nAll you needed to do for the past few years to enjoy solid gains in the stock market was buy an S&amp;P 500 or Nasdaq 100 index fund. That provided exposure to market darlings like the FAANG quintet of Facebook (FB), Amazon (AMZN), Apple (AAPL), Netflix (NFLX) and Google owner Alphabet (GOOGL) as well as Microsoft (MSFT).\nThe Big Tech stocks have boomed thanks to strong gains in revenue, market share and earnings over the past few years — which has raised antitrust concerns and created intense regulatory scrutiny.\n\nBut that dominance might be about to change.\n\nAfter years of growth stocks outperforming the market, some strategists and fund managers think it could be time for value sectors like banks, health care, energy, retail and others that have been laggards to emerge as new market leaders.\n\n\"We're coming out of a multi-year period of extraordinary outperformance from big cap techs. Value stocks have been so inexpensive,\" said Eric Kuby, chief investment officer with North Star Investment Management.\n\n\"A major rotation is going to take place. When valuations are so out of whack, there has to be a reversion,\" Kuby added.\n\nKuby likes smaller consumer companies like Acco Brands (ACCO), which owns Mead notebooks and Swingline staplers, as well as financial firms like the suburban Chicago-based bank Wintrust (WTFC).\n\nBanks, retailers and energy stocks all look attractive, said David Harden, president of Summit Global Investments. He thinks these three more value-oriented sectors will benefit from a stabilization in the economy in 2021 — especially if there are multiple Covid-19 vaccines available.\n\n\"There is no question value stocks will outperform. It's time to look for high quality and low volatility with larger companies,\" Harden told CNN Business. Some of Harden's top picks for 2021 include JPMorgan Chase (JPM), Walmart (WMT) and Exxon Mobil (XOM).\n\nStill, some experts say that value stocks and growth industries like tech and biotech can both do well for the foreseeable future. There is no particular reason why the FAANGs have to fall in order for other sectors to do well.\n\n\"Value versus growth is the perennial debate,\" said Dec Mullarkey, managing director of investment strategy at SLC Management. \"The recovery will be broader based because the market rally has been so tech-centric. But I don't see growth falling out of favor even if value stocks come back.\"\n\n**Growth at the right price**\n\nThat's why it might make more sense for investors to look for companies that have the characteristics of both value and growth — stocks that trade at reasonable prices but also have the potential to generate solid gains in earnings and revenue.\n\n\"We continue to think the rotation to value should be focused on creating a more balanced value/growth portfolio, and not abandoning growth/tech en masse,\" said Tom Essaye, editor of The Sevens Report investing newsletter, in a report Tuesday. \"Tech also can do well.\"\n\nEssaye added that there is \"simple logic\" for this prediction. \"Massive stimulus\" could be coming from the incoming Biden administration as well as a continuation of 0% rates from the Federal Reserve.\n\n\"The value versus growth question simplifies the market a bit. You want to find durable growth,\" said Doug Rao, a portfolio manager with Janus Henderson, in an interview with CNN Business.\nWith that in mind, Rao's firm owns stakes in industry leaders like travel company Booking (BKNG), Disney (DIS), LVMH (LVMHF) and Mastercard (MA).\n\n\"The transformation to a digital economy has been the biggest change for companies in every industry,\" Rao said. \"You want to look more for companies that are on the right side of that transformation.\"", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "stocks", "subreddit_id": "t5_2qjfk", "subreddit_subscribers": 941791, "subreddit_type": "public", "thumbnail": "self", "title": "[CNN Article] Big Tech's stock market reign may finally be about to end", "total_awards_received": 0, "treatment_tags": [], "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/stocks/comments/k58rpj/cnn_article_big_techs_stock_market_reign_may/", "whitelist_status": "all_ads", "wls": 6, "created": 1606910404.0}], [[], false, "Napolitano_", null, [], null, "text", "t2_8qiouebw", false, false, [], false, false, 1606494217, "self.stocks", "https://www.reddit.com/r/stocks/comments/k247b8/is_airbnb_a_stock_you_should_invest_in/", {}, "k247b8", true, false, false, false, true, true, false, "", [], "dark", "text", false, false, true, 9, 0, false, "all_ads", "/r/stocks/comments/k247b8/is_airbnb_a_stock_you_should_invest_in/", false, 6, 1606494228, 1, "Bullish\nIn this article I will explain why this is a good investment through my own eyes. All the information I express is what I was able to gather from Airbnb’s submission to the SEC. The truth is I was waiting for this IPO for a long time, and it is surely the most important IPO of 2020. The IPO is going to take place in December without a clear date being published and will be listed as (NASDAQ:ABNB). I will be covering the following matters:\n• Company’s Overview\n• The impact of the coronavirus – Financials\n• Competitors – WHAT DISTINGUISH Airbnb from them\n• Risk factors to consider\n• Safeguards to consider\nCompany’s overview\nAirbnb is a vacation rental online business, that allows people worldwide to find places to stay either for travelling purposes, or business purposes. It is used for short-term stays meaning a temporary accommodation. It was founded in 2008 and has its headquarters in San Francisco, California, United States. It has more than 7 million homes listed, and it operates in 100,000 cities. Does Airbnb own the properties listed? No, it doesn’t own any of them, in fact people like you and me that have a residential home can list it on Airbnb after successfully complying with its rules. This helps the homeowners to achieve higher occupancy rates since it gives them “automatic advertising” when they appear on the searches without them having to spend money on advertising. Of course, Airbnb doesn’t do that for free! It charges them a 14 - 16% whereas in some other cases 20% to those who offer experiences and this fee is deducted from the hosts payout. This fee can vary from country to country. \nImpressive how such a “simple” idea – two friends renting their house to help them pay their rent, twelve years later turned into a business worth $18 billion. Before the coronavirus pandemic Airbnb was worth $38 billion.\nCoronavirus pandemic impact on Airbnb - Financials\nI believe that from now on the Covid-19 impact on any business is very important to be mention for a thoroughly comparison of what it used to be and what may be again. According to Airbnb’s reports, in 2019 there was an increase of 32% $4.8 billion in its revenue and a 29% increase in the bookings to $29.4 billion. However, 2020 didn’t seem to be a good year considering the virus, revenues faced a decline of 32% to $2.5 billion and its bookings fell by 39% to $18 billion.\nNeedless to say, that the net losses from 2018 to 2019 have seen a huge rise from $17 million in 2018 to $674 million by the end of 2019. Pandemic widened these losses even more for 2020 accumulating at $697 million losses until September 2020. The total deficit was $2.1 billion as of September 30,2020.\nThese numbers are surely causing you to reconsider your investment in Airbnb so to spread your hopes up again Reuters estimates a valuation raise to $30 billion. Not to forget that Airbnb was valued $31 million in 2017 which is nothing to what it is valued now after the pandemic. In general, This IPO hopes to reverse this decline.\nCompetitors\nSince Airbnb falls under the booking market, I need to highlight the many rivals it has since this is a small barrier business to entry.\n1.Unlike Airbnb, Expedia group (EXPE) and Booking Holdings (BKNG) have both reported a steady earning report that shows operating profits increasing year by year.\n2.HomeAway (AWAY) does not charge a fee for each booking like Airbnb does, and its only asking for an annually $350 to advertise the property. Meaning leaving the hosts with much more profits than Airbnb.\n3. Trip Advisor (TRIP) which is a rival, reported a much smaller revenue compared to Airbnb accumulating $156 million in 2019.\n\nWhat distinguish it from its competitors?\nThe company’s advantage over its competitors is surely visible for the following reasons:\n1. Airbnb is 3 times bigger than Trip Advisor\nTrip Advisor might be a competitor, but Airbnb has an advantage over it if you compare the sizes which means Airbnb does not have to worry about it, at least for now.\n2. Airbnb has a rapid growth\nComparing the percentage changes, Airbnb has proved to be growing almost 10 times faster than Booking Holdings and 5 times fast than Expedia Group.\n3. Airbnb is very liquid\nThe term liquidity means that a company holds available funds in the bank. According to Bloomberg it holds $2 billion cash in the bank which means it can help it overcome the losses and the negative events that bother their way.\n\nRisk factors to consider:\nBefore the vaccine I would have definitely say third wave of Coronavirus, but after the vaccine news I am personally very positive that all this will be a history soon, but this is a different article.\n1. The regulations for short-term rentals are becoming stricter.\nAirbnb grew because of the non-existing regulations of short-term rentals, but after this rapidly growing business things became more apparent. There have been some incidences from hosts discriminating guests, blaming guests for damages, misleading them from the pictures, even some parties going on causing police engagement. But like Uber, Airbnb it’s just a technology platform connecting hosts with guests. Bottom line, it can be very difficult to come up with regulations in all cities and regions which give Airbnb space to breath.\n2. The competition becomes bigger.\nOther online booking services like, Booking Holdings (BNKG) that provides the same service. In addition, Expedia (EXPE) bought Home Away (AWAY) few years ago and raised competition. Likewise, a French hospitality Accor bought short-term rental One Fine Stay and Marriot International (MAR) partnered with home rental platform Hostmaker to provide short-term rentals. As it seems Airbnb changed the game for hotels and pushed them to pursue other strategies which points how strong of a player is.\n3. Airbnb does not have a clear path of profitability.\nIn fact, Airbnb has not ever generated profit, and this is something big to consider. All this together seem to shadow Airbnb’s future. But, with the IPO going on, and the available cash in the bank there is definitely light at the end of the tunnel.\nSafeguards to consider:\n1. The hotel sector has proved to be far more “destroyed” from Covid-19 than Airbnb which keeps it in a strong IPO position. Did you know that as of December 31, 2019 72% of 327 million Airbnb nights were booked by individual hosts? In other words, 92 million nights were listed under professional hosts by Airbnb. Moreover, Marriot International had 1.38 million rooms meaning almost 67 nights of full occupancy. Would these guests stayed there and keep Marriott’s properties full if it wasn’t for Airbnb? I don’t think so.\n2. Recently, Bill Gates expressed his opinion on how the business travel will drop 50%. This can be very bad for hotels, but what about Airbnb? Because of the way everyone travels today, using online bookings and seeking to pay less for the maximum luxury, it makes it harder for hotels to beat the industry and especially Airbnb.\nMy Opinion\nInvestors need to consider all possible factors to form their decision. There is not a final price for the stock going IPO. At the end of the day is all a belief and since people will “value” it on the market I believe they will give it quite a high value at least in the long term. It is on my personal portfolio list, since the world is on track for a coronavirus free world.\nDisclaimer: It is only an opinion and should not be taken as a financial advice.", true, false, false, "stocks", "t5_2qjfk", 931433, "public", "self", "Is Airbnb a stock you should invest in?", 0, [], 1.0, "https://www.reddit.com/r/stocks/comments/k247b8/is_airbnb_a_stock_you_should_invest_in/", "all_ads", 6, 1606490617.0, {"all_awardings": [], "allow_live_comments": false, "author": "Napolitano_", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_8qiouebw", "author_patreon_flair": false, "author_premium": false, "awarders": [], "can_mod_post": false, "contest_mode": false, "created_utc": 1606494217, "domain": "self.stocks", "full_link": "https://www.reddit.com/r/stocks/comments/k247b8/is_airbnb_a_stock_you_should_invest_in/", "gildings": {}, "id": "k247b8", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 9, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/stocks/comments/k247b8/is_airbnb_a_stock_you_should_invest_in/", "pinned": false, "pwls": 6, "retrieved_on": 1606494228, "score": 1, "selftext": "Bullish\nIn this article I will explain why this is a good investment through my own eyes. All the information I express is what I was able to gather from Airbnb’s submission to the SEC. The truth is I was waiting for this IPO for a long time, and it is surely the most important IPO of 2020. The IPO is going to take place in December without a clear date being published and will be listed as (NASDAQ:ABNB). I will be covering the following matters:\n• Company’s Overview\n• The impact of the coronavirus – Financials\n• Competitors – WHAT DISTINGUISH Airbnb from them\n• Risk factors to consider\n• Safeguards to consider\nCompany’s overview\nAirbnb is a vacation rental online business, that allows people worldwide to find places to stay either for travelling purposes, or business purposes. It is used for short-term stays meaning a temporary accommodation. It was founded in 2008 and has its headquarters in San Francisco, California, United States. It has more than 7 million homes listed, and it operates in 100,000 cities. Does Airbnb own the properties listed? No, it doesn’t own any of them, in fact people like you and me that have a residential home can list it on Airbnb after successfully complying with its rules. This helps the homeowners to achieve higher occupancy rates since it gives them “automatic advertising” when they appear on the searches without them having to spend money on advertising. Of course, Airbnb doesn’t do that for free! It charges them a 14 - 16% whereas in some other cases 20% to those who offer experiences and this fee is deducted from the hosts payout. This fee can vary from country to country. \nImpressive how such a “simple” idea – two friends renting their house to help them pay their rent, twelve years later turned into a business worth $18 billion. Before the coronavirus pandemic Airbnb was worth $38 billion.\nCoronavirus pandemic impact on Airbnb - Financials\nI believe that from now on the Covid-19 impact on any business is very important to be mention for a thoroughly comparison of what it used to be and what may be again. According to Airbnb’s reports, in 2019 there was an increase of 32% $4.8 billion in its revenue and a 29% increase in the bookings to $29.4 billion. However, 2020 didn’t seem to be a good year considering the virus, revenues faced a decline of 32% to $2.5 billion and its bookings fell by 39% to $18 billion.\nNeedless to say, that the net losses from 2018 to 2019 have seen a huge rise from $17 million in 2018 to $674 million by the end of 2019. Pandemic widened these losses even more for 2020 accumulating at $697 million losses until September 2020. The total deficit was $2.1 billion as of September 30,2020.\nThese numbers are surely causing you to reconsider your investment in Airbnb so to spread your hopes up again Reuters estimates a valuation raise to $30 billion. Not to forget that Airbnb was valued $31 million in 2017 which is nothing to what it is valued now after the pandemic. In general, This IPO hopes to reverse this decline.\nCompetitors\nSince Airbnb falls under the booking market, I need to highlight the many rivals it has since this is a small barrier business to entry.\n1.Unlike Airbnb, Expedia group (EXPE) and Booking Holdings (BKNG) have both reported a steady earning report that shows operating profits increasing year by year.\n2.HomeAway (AWAY) does not charge a fee for each booking like Airbnb does, and its only asking for an annually $350 to advertise the property. Meaning leaving the hosts with much more profits than Airbnb.\n3. Trip Advisor (TRIP) which is a rival, reported a much smaller revenue compared to Airbnb accumulating $156 million in 2019.\n\nWhat distinguish it from its competitors?\nThe company’s advantage over its competitors is surely visible for the following reasons:\n1. Airbnb is 3 times bigger than Trip Advisor\nTrip Advisor might be a competitor, but Airbnb has an advantage over it if you compare the sizes which means Airbnb does not have to worry about it, at least for now.\n2. Airbnb has a rapid growth\nComparing the percentage changes, Airbnb has proved to be growing almost 10 times faster than Booking Holdings and 5 times fast than Expedia Group.\n3. Airbnb is very liquid\nThe term liquidity means that a company holds available funds in the bank. According to Bloomberg it holds $2 billion cash in the bank which means it can help it overcome the losses and the negative events that bother their way.\n\nRisk factors to consider:\nBefore the vaccine I would have definitely say third wave of Coronavirus, but after the vaccine news I am personally very positive that all this will be a history soon, but this is a different article.\n1. The regulations for short-term rentals are becoming stricter.\nAirbnb grew because of the non-existing regulations of short-term rentals, but after this rapidly growing business things became more apparent. There have been some incidences from hosts discriminating guests, blaming guests for damages, misleading them from the pictures, even some parties going on causing police engagement. But like Uber, Airbnb it’s just a technology platform connecting hosts with guests. Bottom line, it can be very difficult to come up with regulations in all cities and regions which give Airbnb space to breath.\n2. The competition becomes bigger.\nOther online booking services like, Booking Holdings (BNKG) that provides the same service. In addition, Expedia (EXPE) bought Home Away (AWAY) few years ago and raised competition. Likewise, a French hospitality Accor bought short-term rental One Fine Stay and Marriot International (MAR) partnered with home rental platform Hostmaker to provide short-term rentals. As it seems Airbnb changed the game for hotels and pushed them to pursue other strategies which points how strong of a player is.\n3. Airbnb does not have a clear path of profitability.\nIn fact, Airbnb has not ever generated profit, and this is something big to consider. All this together seem to shadow Airbnb’s future. But, with the IPO going on, and the available cash in the bank there is definitely light at the end of the tunnel.\nSafeguards to consider:\n1. The hotel sector has proved to be far more “destroyed” from Covid-19 than Airbnb which keeps it in a strong IPO position. Did you know that as of December 31, 2019 72% of 327 million Airbnb nights were booked by individual hosts? In other words, 92 million nights were listed under professional hosts by Airbnb. Moreover, Marriot International had 1.38 million rooms meaning almost 67 nights of full occupancy. Would these guests stayed there and keep Marriott’s properties full if it wasn’t for Airbnb? I don’t think so.\n2. Recently, Bill Gates expressed his opinion on how the business travel will drop 50%. This can be very bad for hotels, but what about Airbnb? Because of the way everyone travels today, using online bookings and seeking to pay less for the maximum luxury, it makes it harder for hotels to beat the industry and especially Airbnb.\nMy Opinion\nInvestors need to consider all possible factors to form their decision. There is not a final price for the stock going IPO. At the end of the day is all a belief and since people will “value” it on the market I believe they will give it quite a high value at least in the long term. It is on my personal portfolio list, since the world is on track for a coronavirus free world.\nDisclaimer: It is only an opinion and should not be taken as a financial advice.", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "stocks", "subreddit_id": "t5_2qjfk", "subreddit_subscribers": 931433, "subreddit_type": "public", "thumbnail": "self", "title": "Is Airbnb a stock you should invest in?", "total_awards_received": 0, "treatment_tags": [], "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/stocks/comments/k247b8/is_airbnb_a_stock_you_should_invest_in/", "whitelist_status": "all_ads", "wls": 6, "created": 1606490617.0}], [[], false, "Brothanogood", null, [], null, "text", "t2_d29iz", false, false, [], false, false, 1605575000, "self.stocks", "https://www.reddit.com/r/stocks/comments/jvje9f/airbnb_files_to_go_public_turned_a_profit_last/", {}, "jvje9f", true, false, false, false, true, true, false, "", "news", [], "866eb162-65e6-11e5-a903-1252b640afe9", "News", "dark", "text", false, false, false, 55, 0, false, "all_ads", "/r/stocks/comments/jvje9f/airbnb_files_to_go_public_turned_a_profit_last/", false, "self", {"enabled": false, "images": [{"id": "VVp32jKYMNGmbX7UsghQxJcDypMmRv71Xmj08mY9HuQ", "resolutions": [{"height": 141, "url": "https://external-preview.redd.it/ei2yNs323Y8-2nno85TP4lIAfRV-159DcYcgXlXbQKI.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=5221fdd38f612625c14c137a3bd0441ca0233474", "width": 108}, {"height": 282, "url": "https://external-preview.redd.it/ei2yNs323Y8-2nno85TP4lIAfRV-159DcYcgXlXbQKI.jpg?width=216&amp;crop=smart&amp;auto=webp&amp;s=08b8f59947b450701eefffb6d3c61f970e1e9b8c", "width": 216}, {"height": 417, "url": "https://external-preview.redd.it/ei2yNs323Y8-2nno85TP4lIAfRV-159DcYcgXlXbQKI.jpg?width=320&amp;crop=smart&amp;auto=webp&amp;s=5db658c3427e153e9645b404f8e4db1c91d3658d", "width": 320}, {"height": 835, "url": "https://external-preview.redd.it/ei2yNs323Y8-2nno85TP4lIAfRV-159DcYcgXlXbQKI.jpg?width=640&amp;crop=smart&amp;auto=webp&amp;s=be97a7301afb1e3ff0a9bcb7a68f061ce3235c43", "width": 640}], "source": {"height": 1071, "url": "https://external-preview.redd.it/ei2yNs323Y8-2nno85TP4lIAfRV-159DcYcgXlXbQKI.jpg?auto=webp&amp;s=feafc7694c065c572b443301934f2a26d8a33934", "width": 820}, "variants": {}}]}, 6, 1605615810, 29, "* **Airbnb has released its prospectus to debut on public markets.**\n* **The company made $219 million in net income on revenues of $1.34 billion last quarter. That was down nearly 19% from $1.65 billion in revenue a year prior.**\n* **The company said it plans to trade under the symbol “ABNB” on the Nasdaq.**\n\nAirbnb on Monday [released its prospectus](https://www.sec.gov/Archives/edgar/data/1559720/000119312520294801/d81668ds1.htm) to debut on public markets. The company allows users to book short-term rentals and experiences while traveling.\n\nThe company made $219 million in net income on revenues of $1.34 billion last quarter. That was down nearly 19% from $1.65 billion in revenue a year prior. Despite primarily turning net losses, the company has had other occasional quarters of profitability, including the second and third quarters of 2018 and the third quarter of 2019.\n\nThe company said it plans to trade under the symbol “ABNB” on the Nasdaq.\n\nIn its prospectus, the company put an emphasis on building a community around its hosts and guests, positioning that community as a differentiating factor from its competitors. The company said it would set up 9.2 million shares of non-voting stock aside in an endowment fund for hosts.\n\n“Our guests are not transactions -- they are engaged, contributing members of our community,” the company said in its prospectus summary. “Once they become a part of Airbnb, guests actively participate in our community, return regularly to our platform to book again, and recommend Airbnb to others who then join themselves. This demand encourages new hosts to join, which in turn attracts even more guests. It is a virtuous cycle -- guests attract hosts, and hosts attract guests.”\n\nIn 2019, the company reported a net loss of $674 million on revenues of $4.81 billion. Thus far in 2020, the company has turned a net loss of nearly $697 million on revenues of $2.52 billion. The decline is likely from the impact of the coronavirus, which put the brakes on leisure and business travel earlier this year.\n\n“The Covid-19 pandemic and the impact of actions to mitigate the Covid-19 pandemic have materially adversely impacted and will continue to materially adversely impact our business, results of operations, and financial condition,” the company listed as its first risk factor.\n\nThe company lists [Booking Holdings](https://www.cnbc.com/quotes/?symbol=BKNG), [Expedia Group](https://www.cnbc.com/quotes/?symbol=EXPE), [Google](https://www.cnbc.com/quotes/?symbol=GOOGL), [TripAdvisor](https://www.cnbc.com/quotes/?symbol=TRIP), [Trivago](https://www.cnbc.com/quotes/?symbol=TVAG-FF), Craigslist and hotel chains [Marriott](https://www.cnbc.com/quotes/?symbol=MAR), [Hilton](https://www.cnbc.com/quotes/?symbol=HLT) and others among its competitors. The company will have three classes of stock. Class A stock holders will get one vote per share while class B holders, which include the founders and early investors, will get 20 votes per share. Class H holds no votes and is primarily for long-time hosts.\n\n## A quick bounceback from the pandemic\n\nAirbnb has endured a tough 2020. As the coronavirus decimated travel around the world, the company [raised $2 billion in new debt funding](https://www.cnbc.com/2020/04/14/airbnb-raises-another-1-billion-in-debt.html) at a valuation of $18 billion and announced major cost-cutting initiatives, including plans to [lay off 25% of its staff](https://www.cnbc.com/2020/05/05/airbnb-to-lay-off-nearly-1900-people-25percent-of-company.html), or nearly 1,900 employees. The company also slashed marketing costs and raised billions of dollars in debt.\n\nThe coronavirus pandemic brought the travel industry to a halt, resulting in an estimated $443 billion of lost revenue since the beginning of March, according to [a Nov. 5 report](https://www.ustravel.org/sites/default/files/media_root/document/Coronavirus_WeeklyImpacts_11.5.20.pdf?utm_source=MagnetMail&amp;amp;utm_medium=email&amp;amp;utm_content=11%2E5%2E20%20%2D%20COVID%20Research%20Weekly&amp;amp;utm_campaign=ust) from the U.S. Travel Association.\n\nAirbnb rebounded, however, after [a surge of rentals in rural areas](https://www.cnbc.com/2020/08/06/rural-airbnb-bookings-are-surging-as-vacationers-look-to-escape-the-coronavirus.html) as residents with means fled pandemic-stricken cities. The rebound began within two months of the pandemic, the company said in its prospectus.\n\n“In early 2020, as Covid-19 disrupted travel across the world, Airbnb’s business declined significantly,” the company wrote. “But within two months, our business model started to rebound even with limited international travel, demonstrating its resilience. People wanted to get out of their homes and yearned to travel, but they did not want to go far or to be in crowded hotel lobbies. Domestic travel quickly rebounded on Airbnb around the world as millions of guests took trips closer to home. Stays of longer than a few days started increasing as work-from-home became work-from-any-home on Airbnb. We believe that the lines between travel and living are blurring, and the global pandemic has accelerated the ability to live anywhere. Our platform has proven adaptable to serve these new ways of traveling.”\n\nAirbnb said its number of listings has declined and may continue to decline in part due to the pandemic. In particular, some people rely on Airbnb to help pay living expenses or mortgages, and those people may get knocked off the platform.\n\n“It is not yet clear what financial impact the severe travel reduction occurring during the Covid-19 pandemic will have on these individuals or whether they will be able to keep their homes or operate their businesses as travel resumes,” the company wrote in its risk factors. “Our business, results of operations, and financial condition could be materially adversely affected if our hosts are unable to return to normal operations in the near to immediate term.”\n\nUnusually, the company has a Stakeholder Committee on its board of directors whose mission is to consider interests of “key stakeholders,” including guests, hosts, communities and employees. The notion of “[stakeholder capitalism](https://www.cnbc.com/2020/08/25/salesforces-marc-benioff-claims-a-victory-for-stakeholder-capitalism.html)” envisions a departure from traditional business practices which put shareholder interests first, and instead sees business as serving many groups.\n\nAirbnb endured numerous issues with its hosts this year since enforcing an extenuating circumstances policy in March that overrode hosts’ cancellation policies and claimed to offer full refunds to guests impacted by the coronavirus pandemic. \n\nLater, Airbnb announced it would establish a $250 million coronavirus relief fund for hosts, returning 25% of what they would have normally received under their cancellation policies, but [many hosts who spoke with CNBC complained](https://www.cnbc.com/2020/04/22/airbnb-hosts-getting-almost-nothing-from-250-million-relief-fund.html) that they were not receiving the correct amounts or any payments at all. \n\nIn November, the company was [hit with a proposed class-action lawsuit](https://www.cnbc.com/2020/11/06/airbnb-hit-with-proposed-class-action-lawsuit-from-host-missing-payments.html) by one of its hosts, alleging that the tech company violated its contract with hosts when it enforced the extenuating circumstances policy. \n\n[Source](https://www.cnbc.com/2020/11/16/airbnb-s-1-ipo-filing-drops.html)", true, false, false, "stocks", "t5_2qjfk", 911884, "public", "self", "Airbnb files to go public, turned a profit last quarter", 0, [], 0.91, "https://www.reddit.com/r/stocks/comments/jvje9f/airbnb_files_to_go_public_turned_a_profit_last/", "all_ads", 6, 1605571400.0, {"all_awardings": [], "allow_live_comments": false, "author": "Brothanogood", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_d29iz", "author_patreon_flair": false, "author_premium": false, "awarders": [], "can_mod_post": false, "contest_mode": false, "created_utc": 1605575000, "domain": "self.stocks", "full_link": "https://www.reddit.com/r/stocks/comments/jvje9f/airbnb_files_to_go_public_turned_a_profit_last/", "gildings": {}, "id": "jvje9f", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_css_class": "news", "link_flair_richtext": [], "link_flair_template_id": "866eb162-65e6-11e5-a903-1252b640afe9", "link_flair_text": "News", "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": false, "num_comments": 55, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/stocks/comments/jvje9f/airbnb_files_to_go_public_turned_a_profit_last/", "pinned": false, "post_hint": "self", "preview": {"enabled": false, "images": [{"id": "VVp32jKYMNGmbX7UsghQxJcDypMmRv71Xmj08mY9HuQ", "resolutions": [{"height": 141, "url": "https://external-preview.redd.it/ei2yNs323Y8-2nno85TP4lIAfRV-159DcYcgXlXbQKI.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=5221fdd38f612625c14c137a3bd0441ca0233474", "width": 108}, {"height": 282, "url": "https://external-preview.redd.it/ei2yNs323Y8-2nno85TP4lIAfRV-159DcYcgXlXbQKI.jpg?width=216&amp;crop=smart&amp;auto=webp&amp;s=08b8f59947b450701eefffb6d3c61f970e1e9b8c", "width": 216}, {"height": 417, "url": "https://external-preview.redd.it/ei2yNs323Y8-2nno85TP4lIAfRV-159DcYcgXlXbQKI.jpg?width=320&amp;crop=smart&amp;auto=webp&amp;s=5db658c3427e153e9645b404f8e4db1c91d3658d", "width": 320}, {"height": 835, "url": "https://external-preview.redd.it/ei2yNs323Y8-2nno85TP4lIAfRV-159DcYcgXlXbQKI.jpg?width=640&amp;crop=smart&amp;auto=webp&amp;s=be97a7301afb1e3ff0a9bcb7a68f061ce3235c43", "width": 640}], "source": {"height": 1071, "url": "https://external-preview.redd.it/ei2yNs323Y8-2nno85TP4lIAfRV-159DcYcgXlXbQKI.jpg?auto=webp&amp;s=feafc7694c065c572b443301934f2a26d8a33934", "width": 820}, "variants": {}}]}, "pwls": 6, "retrieved_on": 1605615810, "score": 29, "selftext": "* **Airbnb has released its prospectus to debut on public markets.**\n* **The company made $219 million in net income on revenues of $1.34 billion last quarter. That was down nearly 19% from $1.65 billion in revenue a year prior.**\n* **The company said it plans to trade under the symbol “ABNB” on the Nasdaq.**\n\nAirbnb on Monday [released its prospectus](https://www.sec.gov/Archives/edgar/data/1559720/000119312520294801/d81668ds1.htm) to debut on public markets. The company allows users to book short-term rentals and experiences while traveling.\n\nThe company made $219 million in net income on revenues of $1.34 billion last quarter. That was down nearly 19% from $1.65 billion in revenue a year prior. Despite primarily turning net losses, the company has had other occasional quarters of profitability, including the second and third quarters of 2018 and the third quarter of 2019.\n\nThe company said it plans to trade under the symbol “ABNB” on the Nasdaq.\n\nIn its prospectus, the company put an emphasis on building a community around its hosts and guests, positioning that community as a differentiating factor from its competitors. The company said it would set up 9.2 million shares of non-voting stock aside in an endowment fund for hosts.\n\n“Our guests are not transactions -- they are engaged, contributing members of our community,” the company said in its prospectus summary. “Once they become a part of Airbnb, guests actively participate in our community, return regularly to our platform to book again, and recommend Airbnb to others who then join themselves. This demand encourages new hosts to join, which in turn attracts even more guests. It is a virtuous cycle -- guests attract hosts, and hosts attract guests.”\n\nIn 2019, the company reported a net loss of $674 million on revenues of $4.81 billion. Thus far in 2020, the company has turned a net loss of nearly $697 million on revenues of $2.52 billion. The decline is likely from the impact of the coronavirus, which put the brakes on leisure and business travel earlier this year.\n\n“The Covid-19 pandemic and the impact of actions to mitigate the Covid-19 pandemic have materially adversely impacted and will continue to materially adversely impact our business, results of operations, and financial condition,” the company listed as its first risk factor.\n\nThe company lists [Booking Holdings](https://www.cnbc.com/quotes/?symbol=BKNG), [Expedia Group](https://www.cnbc.com/quotes/?symbol=EXPE), [Google](https://www.cnbc.com/quotes/?symbol=GOOGL), [TripAdvisor](https://www.cnbc.com/quotes/?symbol=TRIP), [Trivago](https://www.cnbc.com/quotes/?symbol=TVAG-FF), Craigslist and hotel chains [Marriott](https://www.cnbc.com/quotes/?symbol=MAR), [Hilton](https://www.cnbc.com/quotes/?symbol=HLT) and others among its competitors. The company will have three classes of stock. Class A stock holders will get one vote per share while class B holders, which include the founders and early investors, will get 20 votes per share. Class H holds no votes and is primarily for long-time hosts.\n\n## A quick bounceback from the pandemic\n\nAirbnb has endured a tough 2020. As the coronavirus decimated travel around the world, the company [raised $2 billion in new debt funding](https://www.cnbc.com/2020/04/14/airbnb-raises-another-1-billion-in-debt.html) at a valuation of $18 billion and announced major cost-cutting initiatives, including plans to [lay off 25% of its staff](https://www.cnbc.com/2020/05/05/airbnb-to-lay-off-nearly-1900-people-25percent-of-company.html), or nearly 1,900 employees. The company also slashed marketing costs and raised billions of dollars in debt.\n\nThe coronavirus pandemic brought the travel industry to a halt, resulting in an estimated $443 billion of lost revenue since the beginning of March, according to [a Nov. 5 report](https://www.ustravel.org/sites/default/files/media_root/document/Coronavirus_WeeklyImpacts_11.5.20.pdf?utm_source=MagnetMail&amp;amp;utm_medium=email&amp;amp;utm_content=11%2E5%2E20%20%2D%20COVID%20Research%20Weekly&amp;amp;utm_campaign=ust) from the U.S. Travel Association.\n\nAirbnb rebounded, however, after [a surge of rentals in rural areas](https://www.cnbc.com/2020/08/06/rural-airbnb-bookings-are-surging-as-vacationers-look-to-escape-the-coronavirus.html) as residents with means fled pandemic-stricken cities. The rebound began within two months of the pandemic, the company said in its prospectus.\n\n“In early 2020, as Covid-19 disrupted travel across the world, Airbnb’s business declined significantly,” the company wrote. “But within two months, our business model started to rebound even with limited international travel, demonstrating its resilience. People wanted to get out of their homes and yearned to travel, but they did not want to go far or to be in crowded hotel lobbies. Domestic travel quickly rebounded on Airbnb around the world as millions of guests took trips closer to home. Stays of longer than a few days started increasing as work-from-home became work-from-any-home on Airbnb. We believe that the lines between travel and living are blurring, and the global pandemic has accelerated the ability to live anywhere. Our platform has proven adaptable to serve these new ways of traveling.”\n\nAirbnb said its number of listings has declined and may continue to decline in part due to the pandemic. In particular, some people rely on Airbnb to help pay living expenses or mortgages, and those people may get knocked off the platform.\n\n“It is not yet clear what financial impact the severe travel reduction occurring during the Covid-19 pandemic will have on these individuals or whether they will be able to keep their homes or operate their businesses as travel resumes,” the company wrote in its risk factors. “Our business, results of operations, and financial condition could be materially adversely affected if our hosts are unable to return to normal operations in the near to immediate term.”\n\nUnusually, the company has a Stakeholder Committee on its board of directors whose mission is to consider interests of “key stakeholders,” including guests, hosts, communities and employees. The notion of “[stakeholder capitalism](https://www.cnbc.com/2020/08/25/salesforces-marc-benioff-claims-a-victory-for-stakeholder-capitalism.html)” envisions a departure from traditional business practices which put shareholder interests first, and instead sees business as serving many groups.\n\nAirbnb endured numerous issues with its hosts this year since enforcing an extenuating circumstances policy in March that overrode hosts’ cancellation policies and claimed to offer full refunds to guests impacted by the coronavirus pandemic. \n\nLater, Airbnb announced it would establish a $250 million coronavirus relief fund for hosts, returning 25% of what they would have normally received under their cancellation policies, but [many hosts who spoke with CNBC complained](https://www.cnbc.com/2020/04/22/airbnb-hosts-getting-almost-nothing-from-250-million-relief-fund.html) that they were not receiving the correct amounts or any payments at all. \n\nIn November, the company was [hit with a proposed class-action lawsuit](https://www.cnbc.com/2020/11/06/airbnb-hit-with-proposed-class-action-lawsuit-from-host-missing-payments.html) by one of its hosts, alleging that the tech company violated its contract with hosts when it enforced the extenuating circumstances policy. \n\n[Source](https://www.cnbc.com/2020/11/16/airbnb-s-1-ipo-filing-drops.html)", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "stocks", "subreddit_id": "t5_2qjfk", "subreddit_subscribers": 911884, "subreddit_type": "public", "thumbnail": "self", "title": "Airbnb files to go public, turned a profit last quarter", "total_awards_received": 0, "treatment_tags": [], "upvote_ratio": 0.91, "url": "https://www.reddit.com/r/stocks/comments/jvje9f/airbnb_files_to_go_public_turned_a_profit_last/", "whitelist_status": "all_ads", "wls": 6, "created": 1605571400.0}], [[], false, "psychotrader00", null, [], null, "text", "t2_7gtjd4c0", false, false, [], false, false, 1604524063, "self.stocks", "https://www.reddit.com/r/stocks/comments/jo50vh/here_is_a_market_recap_for_today_wednesday/", {}, "jo50vh", true, false, false, false, true, true, false, "", [], "dark", "text", false, false, true, 10, 0, false, "all_ads", "/r/stocks/comments/jo50vh/here_is_a_market_recap_for_today_wednesday/", false, 6, 1604524075, 1, "**PsychoMarket Recap - Wednesday, November 4, 2020**\n\nStocks rose today, continuing the week’s rally, as investors took in developments from the 2020 presidential election, which has so far produced no clear winner. The presidential race is extremely close, with a number of consequential battle states, like Pennsylvania and Nevada unlikely to produce results until at least tomorrow. The flurry of news made for a volatile overnight session, that at one point saw the Nasdaq futures spike from being slightly down to over 4% up. \n\nThe Nasdaq (QQQ) finished the day 3.85% up, the S&amp;P 500 (SPY) finished 2.18% up and the Dow Jones (DIA) finished the day 1.35% up.\n\nAs of this afternoon, according to the Associated Press, Joe Biden has 248 electoral votes to Pres. Trump’s 214. Candidates need 270 votes to win. However, because of the surge in mail-in ballots this election due to the pandemic, counting the votes is expected to take longer than normal. Despite the race being to close to call, last night, President Trump falsely declared victory while simultaneously questioning the veracity of the election process, due to the ongoing count of mail-in ballots. Trump indicated that he was willing to challenge attempts by states to keep counting ballots after election night, despite it being well known that the surge in mail-in ballots would cause complications and slow counting. “We’ll be going to the U.S. Supreme Court. We want all voting to stop,” Trump said to a crowd of supporters at the White House. “We don’t want them to find any ballots ... and add them to the list. We’re were getting ready to win this election. Frankly, we did win this election.” Biden’s campaign has suggested it would be willing to fight Trump in court.\n\nJoe Biden also too expressed confidence that the vote would go his way. “We feel good about where we are. We really do. I’m here to tell you tonight we believe we’re on track to win this election.”\n\nIn the Senate elections, the so-called “blue wave” many pundits predicted did not happen. As of this morning, Democrats only managed a net gain of one seat, whereas they needed at least three to establish a majority. Democrats missed opportunities to flip seats where they could. South Carolina and Montana were rated toss-ups, and Texas was only rated slightly Republican. If Democrats broke through in one or more of those races, it would have likely portended a good night for them. Instead, Republicans appear to have won all of them handily:\n\n**Highlights**\n\n* California voters carried Uber and Lyft to victory, overwhelmingly approving Proposition 22, a ballot measure that allows gig economy companies to continue treating drivers as independent contractors. Uber, Lyft, and the delivery service DoorDash designed the measure to exempt the companies from a state labor law that would have forced them to employ drivers and pay for health care, unemployment insurance, and other benefits. As a concession to labor advocates, the initiative offers a wage floor and limited benefits to drivers.\n* Health-care stocks led in the 30-stock Dow, with UnitedHealth Group rallying 9% and Amgen up more than 6%. Industrials including Caterpillar and Dow Inc. The index was up more than 550 points, or 2%.\n* The communication and information technology sectors of the S&amp;P 500 performed very well today also.\n* The Nasdaq extended its gain to more than 4%, as each of Amazon, Facebook, Alphabet, Apple, Netflix, and Microsoft surged\n* Trading volumes in currency markets were unusually low for an election night, Mr. Tew said, in part because investors and traders were reluctant to put on new positions given the uncertainty.\n* Bank shares dropped Wednesday, a sharp departure from the broader market as investors bet that another round of stimulus relief will be hard to come by. The KBW Nasdaq Bank Index was down 3.3% around midday. The broader S&amp;P 500 rose 3.1% in volatile trading.\n* Biogen Inc shares rose for the day because FDA briefing documents showed the company had provided enough data to support the approval of its Alzheimer's drug. Which is a pretty big deal, shares were halted at one point finishing up the day about 45%.\n* AGCO (AGCO) had target raised by:\n   * Morgan Stanley $84 to $95 EQUAL WEIGHT\n   * BMO Capital Markets $90 to $110 OUTPERFORM\n   * Royal Bank of Canada $88 to $104 OUTPERFORM\n* Alibaba (BABA) had a price target raise by Raymond James from $320 to $335 at STRONG BUY.\n* Booking (BKNG) had a price target raise by Credit Suisse GRoup from $2,150 to $2,200 at OUTPERFORM. Notable because stock is at $1,670.\n* Catalent (CTLT) had several price target raise by:\n   * Morgan Stanley from $98 to $115 OVERWEIGHT\n   * Royal Bank of Canada from $98 to $105 OUTPERFORM\n   * Jefferies Financial Group $107 to $115 BUY\n   * UBS $105 to $115 at BUY\n* Humana (HUM) had a price target raise by:\n   * Oppenheimer from $440 to $460 OUTPERFORM\n   * Stephens from $450 to $490 OVERWEIGHT\n* Amazon (AMZN) had an upgrade by China Renaissance Securities from HOLD to BUY and a price target raise from $3,360 to $4,000\n* Baidu (BIDU) had a nice upgrade from Barclays from EQUAL WEIGHT to OVERWEIGHT, and a price target raise from $140 to $170\n* Advanced Micro Devices (AMD) had a nice UPGRADE from Goldman Sachs (GS) from NEUTRAL to BUY and price target raised from $84 to $96. Nice call, will be keeping an eye on this one.\n* Sysco (SYY) with target raise by Credit Suisse from $76 to $80 at OUTPERFORM. Stock currently around $60\n* Alleghany (Y) with price target increase by Deutsche Bank (DB) from $785 to $800. Notable because the stock is around $580 right now.\n\n\"The pessimist sees difficulty in every opportunity. The optimist sees the opportunity in every difficulty\" - Winston Churchill", true, false, false, "stocks", "t5_2qjfk", 897168, "public", "self", "Here is a Market Recap for today Wednesday, November 4, 2020", 0, [], 1.0, "https://www.reddit.com/r/stocks/comments/jo50vh/here_is_a_market_recap_for_today_wednesday/", "all_ads", 6, 1604520463.0, {"all_awardings": [], "allow_live_comments": false, "author": "psychotrader00", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_7gtjd4c0", "author_patreon_flair": false, "author_premium": false, "awarders": [], "can_mod_post": false, "contest_mode": false, "created_utc": 1604524063, "domain": "self.stocks", "full_link": "https://www.reddit.com/r/stocks/comments/jo50vh/here_is_a_market_recap_for_today_wednesday/", "gildings": {}, "id": "jo50vh", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 10, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/stocks/comments/jo50vh/here_is_a_market_recap_for_today_wednesday/", "pinned": false, "pwls": 6, "retrieved_on": 1604524075, "score": 1, "selftext": "**PsychoMarket Recap - Wednesday, November 4, 2020**\n\nStocks rose today, continuing the week’s rally, as investors took in developments from the 2020 presidential election, which has so far produced no clear winner. The presidential race is extremely close, with a number of consequential battle states, like Pennsylvania and Nevada unlikely to produce results until at least tomorrow. The flurry of news made for a volatile overnight session, that at one point saw the Nasdaq futures spike from being slightly down to over 4% up. \n\nThe Nasdaq (QQQ) finished the day 3.85% up, the S&amp;P 500 (SPY) finished 2.18% up and the Dow Jones (DIA) finished the day 1.35% up.\n\nAs of this afternoon, according to the Associated Press, Joe Biden has 248 electoral votes to Pres. Trump’s 214. Candidates need 270 votes to win. However, because of the surge in mail-in ballots this election due to the pandemic, counting the votes is expected to take longer than normal. Despite the race being to close to call, last night, President Trump falsely declared victory while simultaneously questioning the veracity of the election process, due to the ongoing count of mail-in ballots. Trump indicated that he was willing to challenge attempts by states to keep counting ballots after election night, despite it being well known that the surge in mail-in ballots would cause complications and slow counting. “We’ll be going to the U.S. Supreme Court. We want all voting to stop,” Trump said to a crowd of supporters at the White House. “We don’t want them to find any ballots ... and add them to the list. We’re were getting ready to win this election. Frankly, we did win this election.” Biden’s campaign has suggested it would be willing to fight Trump in court.\n\nJoe Biden also too expressed confidence that the vote would go his way. “We feel good about where we are. We really do. I’m here to tell you tonight we believe we’re on track to win this election.”\n\nIn the Senate elections, the so-called “blue wave” many pundits predicted did not happen. As of this morning, Democrats only managed a net gain of one seat, whereas they needed at least three to establish a majority. Democrats missed opportunities to flip seats where they could. South Carolina and Montana were rated toss-ups, and Texas was only rated slightly Republican. If Democrats broke through in one or more of those races, it would have likely portended a good night for them. Instead, Republicans appear to have won all of them handily:\n\n**Highlights**\n\n* California voters carried Uber and Lyft to victory, overwhelmingly approving Proposition 22, a ballot measure that allows gig economy companies to continue treating drivers as independent contractors. Uber, Lyft, and the delivery service DoorDash designed the measure to exempt the companies from a state labor law that would have forced them to employ drivers and pay for health care, unemployment insurance, and other benefits. As a concession to labor advocates, the initiative offers a wage floor and limited benefits to drivers.\n* Health-care stocks led in the 30-stock Dow, with UnitedHealth Group rallying 9% and Amgen up more than 6%. Industrials including Caterpillar and Dow Inc. The index was up more than 550 points, or 2%.\n* The communication and information technology sectors of the S&amp;P 500 performed very well today also.\n* The Nasdaq extended its gain to more than 4%, as each of Amazon, Facebook, Alphabet, Apple, Netflix, and Microsoft surged\n* Trading volumes in currency markets were unusually low for an election night, Mr. Tew said, in part because investors and traders were reluctant to put on new positions given the uncertainty.\n* Bank shares dropped Wednesday, a sharp departure from the broader market as investors bet that another round of stimulus relief will be hard to come by. The KBW Nasdaq Bank Index was down 3.3% around midday. The broader S&amp;P 500 rose 3.1% in volatile trading.\n* Biogen Inc shares rose for the day because FDA briefing documents showed the company had provided enough data to support the approval of its Alzheimer's drug. Which is a pretty big deal, shares were halted at one point finishing up the day about 45%.\n* AGCO (AGCO) had target raised by:\n   * Morgan Stanley $84 to $95 EQUAL WEIGHT\n   * BMO Capital Markets $90 to $110 OUTPERFORM\n   * Royal Bank of Canada $88 to $104 OUTPERFORM\n* Alibaba (BABA) had a price target raise by Raymond James from $320 to $335 at STRONG BUY.\n* Booking (BKNG) had a price target raise by Credit Suisse GRoup from $2,150 to $2,200 at OUTPERFORM. Notable because stock is at $1,670.\n* Catalent (CTLT) had several price target raise by:\n   * Morgan Stanley from $98 to $115 OVERWEIGHT\n   * Royal Bank of Canada from $98 to $105 OUTPERFORM\n   * Jefferies Financial Group $107 to $115 BUY\n   * UBS $105 to $115 at BUY\n* Humana (HUM) had a price target raise by:\n   * Oppenheimer from $440 to $460 OUTPERFORM\n   * Stephens from $450 to $490 OVERWEIGHT\n* Amazon (AMZN) had an upgrade by China Renaissance Securities from HOLD to BUY and a price target raise from $3,360 to $4,000\n* Baidu (BIDU) had a nice upgrade from Barclays from EQUAL WEIGHT to OVERWEIGHT, and a price target raise from $140 to $170\n* Advanced Micro Devices (AMD) had a nice UPGRADE from Goldman Sachs (GS) from NEUTRAL to BUY and price target raised from $84 to $96. Nice call, will be keeping an eye on this one.\n* Sysco (SYY) with target raise by Credit Suisse from $76 to $80 at OUTPERFORM. Stock currently around $60\n* Alleghany (Y) with price target increase by Deutsche Bank (DB) from $785 to $800. Notable because the stock is around $580 right now.\n\n\"The pessimist sees difficulty in every opportunity. The optimist sees the opportunity in every difficulty\" - Winston Churchill", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "stocks", "subreddit_id": "t5_2qjfk", "subreddit_subscribers": 897168, "subreddit_type": "public", "thumbnail": "self", "title": "Here is a Market Recap for today Wednesday, November 4, 2020", "total_awards_received": 0, "treatment_tags": [], "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/stocks/comments/jo50vh/here_is_a_market_recap_for_today_wednesday/", "whitelist_status": "all_ads", "wls": 6, "created": 1604520463.0}], [[], false, "InterestingNews1", null, [], null, "text", "t2_uipg9", false, false, [], false, false, 1603539490, "self.stocks", "https://www.reddit.com/r/stocks/comments/jh7hb9/some_interesting_news_in_the_stock_market_this/", {}, "jh7hb9", true, false, false, false, true, true, false, "", [], "dark", "text", false, false, true, 1, 0, false, "all_ads", "/r/stocks/comments/jh7hb9/some_interesting_news_in_the_stock_market_this/", false, 6, 1603539501, 1, "On **Monday** Shelby Tucker from RBC Capital maintained a buy rating on FirstEnergy $FE with a TP of $37 and follows a similar move by Morgan Stanley on October 5th with a TP of $39.\n\nThat allows 20% upside and looks reasonable given the stock was valued at $42 in July and $52 in February.\n\nThose valuations were before the Ohio Consumer Council asked the state's Public Utilities Commission to conduct an independent investigation of FirstEnergy, which federal authorities have tied to a $60M bribery scheme involving Ohio's former House Speaker. In its defense $FE has asserted that it acted ethically in its actions.\n\nHowever even assuming the worst the $6bn drop in market cap seems to exceed any likely downside.\n\n* $FE has not received any benefit from the alleged bribery (the relevant HB6 legislation does not come into effect until next year),\n* the overall impact of HB6 is not material for $FE (the stock did not move significantly when it was signed\n* the $6bn drop in market cap far exceeds the total $60M bribery\n* The $6bn drop in market cap far exceeds comparable cases (Exelon paid a $200M fine for bribery in Illinois in July)\n\nAll in all the valuation looks attractive with a trailing PE of 12 and forward dividend yield of 4.9%\n\n&amp;#x200B;\n\nOn **Tuesday** Booking.com $BKNG set out nine travel related predictions based on research from more than 20,000 travellers across 28 countries with insights from proprietary search and endorsement data. Perhaps not surprisingly it was bullish about the outlook for travel with a significant majority of people said to be excited by the prospect of travelling again while over 30% said they wanted to travel more to make up for lost time.\n\nThat's exactly what Booking.com’s investors want to hear. The pandemic has clearly had a huge impact on the company. However, recently Booking has witnessed a recovery in its business. Newly booked room nights have steadily improved, from 15% of their normal level in April to 65% of their normal level in July.\n\nThe company has reinforced their liquidity with $10.5 billion of cash compared to $11.5 billion of debt and cash flow is almost neutral (usually +$5 billion). Consequently the company appears surefooted.\n\nThe valuation meanwhile is still down 20% from 2018 highs and trading on just 18x last years earnings. That looks cheap with strong balance sheet and the expected rebound in demand.\n\n&amp;#x200B;\n\nSemiconductor test equipment maker Teradyne $TER saw its shares surge 4.7% on **Wednesday** after the company delivered better-than-expected third-quarter results and guidance;\n\n* earnings rose 53% while sales climbed 41%\n* Q4 guidance is for an adjusted EPS $0.98 on sales of $710 million. Compared to consensus $0.50 on sales of $543.1 million\n\nTeradyne sells advanced testing equipment for chips (72%), wireless devices (5%) and electronic systems (14%). It also makes industrial automation equipment (9%), including collaborative and mobile robots.\n\nThe medium term outlook for testing is strong with the widespread roll out of 5G and suppressed demand expected to be released from Auto and Industry. Chief Executive Mark Jagiela said \"Entering Q4, market conditions in our test businesses are stronger than expected and we've positioned our production capacity to respond to potential short lead time demands as we move through the quarter.\"\n\nThe trailing PE of 23.55 looks attractive given the expected medium term outperformance.\n\n&amp;#x200B;\n\nOn **Thursday** Align jumped 35% after reporting knock out earnings as the CEO credited the “Zoom effect” for making people more aware of their crooked smiles. Revenue was up 21% and adjusted EPS came in at $2.25 compared to consensus of $0.64.\n\nIf true, that driver should apply to other dentistry companies such as SmileDirectClub which is expected to report earnings the week commencing November 10th. Both companies are growing quickly and share a huge total addressable market yet SDC is a valued at just 5x revenues compared to Align’s valuation that is closer to 15x.\n\n&amp;#x200B;\n\nOn **Friday** shares of biotech start-up Compass Pathways $CMPS shot up 17% before settling back to close up 12% on the day after the chairman, co-founder, and chief executive officer (CEO) George Goldsmith appeared on CNBC to tell his company's story, causing the jump.  Specifically he discussed the company's approach to transforming mental healthcare, using psilocybin, the active ingredient in psychedelic, or \"magic\" mushrooms.\n\nThe company is currently in Phase 2b of its clinical trials, where the efficacy of the treatment is tested. Goldsmith also noted that the treatment has received breakthrough therapy designation from the U.S. Food &amp; Drug Administration (FDA), allowing it to expedite the development and review of the therapy. \n\nIn addition to the U.S., the UK-based company is doing clinical trials in eight other countries. The company expects to complete and report on its Phase 2b trials at the end of 2021, Goldsmith said in the interview. \n\nCompass initially plans to use its psilocybin therapy for patients with treatment-resistant depression, anxiety, addiction and other mental illnesses. The treatment combines the use of the psychoactive substance with trained therapist psychological support.\n\nWith 3.4 million sufferers, we get a $4 billion total addressable market if we assume 15% penetration and $8,000 cost.  Compass’ $1.3 billion market cap looks cheap in comparison.\n\n&amp;#x200B;\n\nFinally, my favorite story this week.  On Tuesday, Morgan Stanley analyst Benjamin Swinburne maintained a Hold rating on Liberty Broadband $LBRDK and set a price target of $174.00. That’s below the analyst consensus of a Moderate Buy with an average price target of $183.33 but enough above the current $140 to make it interesting.\n\nLiberty Broadband was created in September 2014 when Liberty Media spun off its cable businesses into a new unit. It was a typically complex arrangement by to avoid tax liabilities but the important part is that LBRDK ended up holding a 25% stake in Charter Communications $CHTR. Then, in May 2016, Charter acquired both Time Warner Cable and Bright House Networks, quadrupling the number of customers and becoming the second-largest cable company in the US after Comcast.\n\nCharter is now trading at around $592, so Liberty’s original investment is worth $35 billion. That is interesting because LBRDK’s other assets and liabilities are fairly trivial and the $35 billion asset offers a striking premium to the current market cap of $25 billion.\n\nImportantly there are a couple of catalysts here that should drive these two values together. The Liberty group is taking steps to simplify its structure with the merger of GCI Liberty and Liberty Broadband. That will reduce some overhead costs and allow cross shareholdings to be collapsed in a tax efficient manner. Secondly, LBRDK announced an expansion of its buyback program from $200 million to $1.2billion, citing the widening discount to NAV.\n\nThese measures may not be enough by themselves to drive these two values together but show that management is now addressing the issue. In the meantime shareholders get to hold a stake in Charter at a discount. Not bad given the $CHTR stock has performed well  (up 20% over 12 months) and could well have further to run. Cable is still one of the dominant / most efficient broadband technologies today and CHTR's management team is regarded as one of the most experienced teams in the cable industry. Additionally, the impact of COVID has been immaterial and the stock is up 10% since February.\n\n&amp;#x200B;\n\n“Follow” me to get updates and links during the week.\n\n&amp;#x200B;\n\nThis is not a recommendation to buy or sell. Stocks are not suitable for everyone. Some stocks mentioned are risky and highly speculative. Please do your own research.", true, false, false, "stocks", "t5_2qjfk", 887821, "public", "self", "Some interesting news in the stock market this week", 0, [], 1.0, "https://www.reddit.com/r/stocks/comments/jh7hb9/some_interesting_news_in_the_stock_market_this/", "all_ads", 6, 1603535890.0, {"all_awardings": [], "allow_live_comments": false, "author": "InterestingNews1", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_uipg9", "author_patreon_flair": false, "author_premium": false, "awarders": [], "can_mod_post": false, "contest_mode": false, "created_utc": 1603539490, "domain": "self.stocks", "full_link": "https://www.reddit.com/r/stocks/comments/jh7hb9/some_interesting_news_in_the_stock_market_this/", "gildings": {}, "id": "jh7hb9", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 1, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/stocks/comments/jh7hb9/some_interesting_news_in_the_stock_market_this/", "pinned": false, "pwls": 6, "retrieved_on": 1603539501, "score": 1, "selftext": "On **Monday** Shelby Tucker from RBC Capital maintained a buy rating on FirstEnergy $FE with a TP of $37 and follows a similar move by Morgan Stanley on October 5th with a TP of $39.\n\nThat allows 20% upside and looks reasonable given the stock was valued at $42 in July and $52 in February.\n\nThose valuations were before the Ohio Consumer Council asked the state's Public Utilities Commission to conduct an independent investigation of FirstEnergy, which federal authorities have tied to a $60M bribery scheme involving Ohio's former House Speaker. In its defense $FE has asserted that it acted ethically in its actions.\n\nHowever even assuming the worst the $6bn drop in market cap seems to exceed any likely downside.\n\n* $FE has not received any benefit from the alleged bribery (the relevant HB6 legislation does not come into effect until next year),\n* the overall impact of HB6 is not material for $FE (the stock did not move significantly when it was signed\n* the $6bn drop in market cap far exceeds the total $60M bribery\n* The $6bn drop in market cap far exceeds comparable cases (Exelon paid a $200M fine for bribery in Illinois in July)\n\nAll in all the valuation looks attractive with a trailing PE of 12 and forward dividend yield of 4.9%\n\n&amp;#x200B;\n\nOn **Tuesday** Booking.com $BKNG set out nine travel related predictions based on research from more than 20,000 travellers across 28 countries with insights from proprietary search and endorsement data. Perhaps not surprisingly it was bullish about the outlook for travel with a significant majority of people said to be excited by the prospect of travelling again while over 30% said they wanted to travel more to make up for lost time.\n\nThat's exactly what Booking.com’s investors want to hear. The pandemic has clearly had a huge impact on the company. However, recently Booking has witnessed a recovery in its business. Newly booked room nights have steadily improved, from 15% of their normal level in April to 65% of their normal level in July.\n\nThe company has reinforced their liquidity with $10.5 billion of cash compared to $11.5 billion of debt and cash flow is almost neutral (usually +$5 billion). Consequently the company appears surefooted.\n\nThe valuation meanwhile is still down 20% from 2018 highs and trading on just 18x last years earnings. That looks cheap with strong balance sheet and the expected rebound in demand.\n\n&amp;#x200B;\n\nSemiconductor test equipment maker Teradyne $TER saw its shares surge 4.7% on **Wednesday** after the company delivered better-than-expected third-quarter results and guidance;\n\n* earnings rose 53% while sales climbed 41%\n* Q4 guidance is for an adjusted EPS $0.98 on sales of $710 million. Compared to consensus $0.50 on sales of $543.1 million\n\nTeradyne sells advanced testing equipment for chips (72%), wireless devices (5%) and electronic systems (14%). It also makes industrial automation equipment (9%), including collaborative and mobile robots.\n\nThe medium term outlook for testing is strong with the widespread roll out of 5G and suppressed demand expected to be released from Auto and Industry. Chief Executive Mark Jagiela said \"Entering Q4, market conditions in our test businesses are stronger than expected and we've positioned our production capacity to respond to potential short lead time demands as we move through the quarter.\"\n\nThe trailing PE of 23.55 looks attractive given the expected medium term outperformance.\n\n&amp;#x200B;\n\nOn **Thursday** Align jumped 35% after reporting knock out earnings as the CEO credited the “Zoom effect” for making people more aware of their crooked smiles. Revenue was up 21% and adjusted EPS came in at $2.25 compared to consensus of $0.64.\n\nIf true, that driver should apply to other dentistry companies such as SmileDirectClub which is expected to report earnings the week commencing November 10th. Both companies are growing quickly and share a huge total addressable market yet SDC is a valued at just 5x revenues compared to Align’s valuation that is closer to 15x.\n\n&amp;#x200B;\n\nOn **Friday** shares of biotech start-up Compass Pathways $CMPS shot up 17% before settling back to close up 12% on the day after the chairman, co-founder, and chief executive officer (CEO) George Goldsmith appeared on CNBC to tell his company's story, causing the jump.  Specifically he discussed the company's approach to transforming mental healthcare, using psilocybin, the active ingredient in psychedelic, or \"magic\" mushrooms.\n\nThe company is currently in Phase 2b of its clinical trials, where the efficacy of the treatment is tested. Goldsmith also noted that the treatment has received breakthrough therapy designation from the U.S. Food &amp; Drug Administration (FDA), allowing it to expedite the development and review of the therapy. \n\nIn addition to the U.S., the UK-based company is doing clinical trials in eight other countries. The company expects to complete and report on its Phase 2b trials at the end of 2021, Goldsmith said in the interview. \n\nCompass initially plans to use its psilocybin therapy for patients with treatment-resistant depression, anxiety, addiction and other mental illnesses. The treatment combines the use of the psychoactive substance with trained therapist psychological support.\n\nWith 3.4 million sufferers, we get a $4 billion total addressable market if we assume 15% penetration and $8,000 cost.  Compass’ $1.3 billion market cap looks cheap in comparison.\n\n&amp;#x200B;\n\nFinally, my favorite story this week.  On Tuesday, Morgan Stanley analyst Benjamin Swinburne maintained a Hold rating on Liberty Broadband $LBRDK and set a price target of $174.00. That’s below the analyst consensus of a Moderate Buy with an average price target of $183.33 but enough above the current $140 to make it interesting.\n\nLiberty Broadband was created in September 2014 when Liberty Media spun off its cable businesses into a new unit. It was a typically complex arrangement by to avoid tax liabilities but the important part is that LBRDK ended up holding a 25% stake in Charter Communications $CHTR. Then, in May 2016, Charter acquired both Time Warner Cable and Bright House Networks, quadrupling the number of customers and becoming the second-largest cable company in the US after Comcast.\n\nCharter is now trading at around $592, so Liberty’s original investment is worth $35 billion. That is interesting because LBRDK’s other assets and liabilities are fairly trivial and the $35 billion asset offers a striking premium to the current market cap of $25 billion.\n\nImportantly there are a couple of catalysts here that should drive these two values together. The Liberty group is taking steps to simplify its structure with the merger of GCI Liberty and Liberty Broadband. That will reduce some overhead costs and allow cross shareholdings to be collapsed in a tax efficient manner. Secondly, LBRDK announced an expansion of its buyback program from $200 million to $1.2billion, citing the widening discount to NAV.\n\nThese measures may not be enough by themselves to drive these two values together but show that management is now addressing the issue. In the meantime shareholders get to hold a stake in Charter at a discount. Not bad given the $CHTR stock has performed well  (up 20% over 12 months) and could well have further to run. Cable is still one of the dominant / most efficient broadband technologies today and CHTR's management team is regarded as one of the most experienced teams in the cable industry. Additionally, the impact of COVID has been immaterial and the stock is up 10% since February.\n\n&amp;#x200B;\n\n“Follow” me to get updates and links during the week.\n\n&amp;#x200B;\n\nThis is not a recommendation to buy or sell. Stocks are not suitable for everyone. Some stocks mentioned are risky and highly speculative. Please do your own research.", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "stocks", "subreddit_id": "t5_2qjfk", "subreddit_subscribers": 887821, "subreddit_type": "public", "thumbnail": "self", "title": "Some interesting news in the stock market this week", "total_awards_received": 0, "treatment_tags": [], "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/stocks/comments/jh7hb9/some_interesting_news_in_the_stock_market_this/", "whitelist_status": "all_ads", "wls": 6, "created": 1603535890.0}], [[], false, "psychotrader00", null, [], null, "text", "t2_7gtjd4c0", false, true, [], false, false, 1602706258, "self.stocks", "https://www.reddit.com/r/stocks/comments/jb8hid/here_is_a_market_recap_for_today_wed_oct_14_2020/", {}, "jb8hid", true, false, false, false, true, true, false, "", [], "dark", "text", false, false, true, 91, 0, false, "all_ads", "/r/stocks/comments/jb8hid/here_is_a_market_recap_for_today_wed_oct_14_2020/", false, 6, 1602706269, 1, "**PsychoMarket Recap - Wednesday, October 14, 2020**\n\nStocks accelerated yesterday’s losses as market participants digested a new round of corporate earnings report and the prospects of additional stimulus before the November presidential election.\n\nThe Nasdaq finished 0.84% down. The S&amp;P (SPY) fell 0.63%, and the Dow Jones finished the day 0.53% down.\n\nToday, Treasury Secretary Mnuchin admitted that coming to a deal regarding stimulus and advancing the measure through Congress would be “difficult” before the November election. The remarks come shortly after Mnuchin and House Speaker Pelosi met on the phone to negotiate further, a deal Pelosi’s spokesperson called “productive”. The two are set to discuss again tomorrow, but after multiple weeks of discussion and the November election coming ever-nearer, chances for additional stimulus look dim. \n\nThe impasse between US lawmakers over stimulus is alarming, given the frequent calls of Pres. Trump, Jerome Powell and other FOMC members, and economist for more virus-relief. Yesterday, Senate Leader Mitch McConnel said he would introduce a smaller, more targeted proposal to the Senate when the chamber reconvenes next Monday. He said “When the full Senate returns on October 19th, our first order of business will be voting again on targeted relief for American workers, including new funding for the PPP.” The estimated $500 billion deal is way below the $1.8 trillion package proposed by the White House earlier in the week, a sign that negotiations may be souring. However, Pelosi has made it clear she would not support smaller, targeted bills, calling them inadequate. Pres. Trump appears to agree with her, tweeting “Go big or go home!!!” for more stimulus. \n\nIn other news, two companies in the forefront of vaccine development for the coronavirus announced their respective trials were put on trial over safety concerns. Eli Lilly (LLY) said Tuesday afternoon that enrollment for its COVID-19 treatment would be temporarily halted, less than a day after Johnson &amp; Johnson (JNJ) said clinical trials for its COVID-19 vaccine candidate were paused due to an unexplained illness in a participant. Shares of Eli Lilly and Johnson &amp; Johnson were little changed overnight after dropping during Tuesday’s session.\n\nIn terms of earnings season, all eyes are on big banks as they have already started to report. An article published by Marketbeat summarized sentiment by stating that “JPMorgan Chase, Citigroup, Wells Fargo and Bank of America saw their profits partly recover in the third quarter from the depths of the coronavirus-caused recession earlier this year. The turnaround stems mostly from improvements in the U.S. economy that allowed these big banks to set aside less money to cover potentially bad loans — $5 billion in the third quarter versus $33 billion in the second quarter.”\n\n**Highlights**\n\n* Goldman Sachs (GS) reported third-quarter results that greatly exceeded expectations. The stock was marginally green at the time of writing, pulled down by the broader market.\n   * EPS of  $9.68 vs $5.37 estimate \n   * Revenue of $10.70 billion vs $9.40 billion\n* Bank of America (BAC) barely outperformed earnings estimates. The stock took a hit and was 4.25% down at the time of writing. \n   * EPS of $0.51 vs $0.43\n   * Revenue of $20.30 billion vs $20.88 billion estimate\n* Wells Fargo (WFC) slightly beat earnings. The stock also took a big hit today, 5.27% down at the time of writing. \n   * EPS of $18.86 billion vs $17.87 billion.\n* Amazon (AMZN) has struck a deal with the NFL to stream a playoff game this season, people familiar with the matter said. \n* Since Sept. 23, the Russell 2000 has risen nearly 13%, outperforming the S&amp;P 500 by 4 percentage points. The small-cap benchmark is now approaching its year to date high of 1705.2, set in January, and is only 100-odd points below the record it reached in 2018.\n* Intel Corporation (INTC) had price target raised by UBS from $64 to $67\n* Livongo (LVGO) had its price target raised by JPMorgan (JPM) from $88 to $150\n* NIO was upgraded by JPMorgan Chase from NEUTRAL to OVERWEIGHT with $40 price target. The stock was one fire today!!!!\n* United Parcel Service (UPS ) had target raised by Citigroup from $150 to $190 at BUY\n* The Trade Desk (TTD) had a target raised by Needham from $580 to $750 at BUY. This is a huuuge increase, very bullish!\n* Peloton (PTON) had its price target raised by Barclays from $111 to $142 at OVERWEIGHT. This is a monster stock!\n* Johnson &amp; Johnson (JNJ) had targets raised by Credit Suisse and Cantor Fitzgerald from $163 to $168 at OUTPERFORM, and $168 to $180 at OVERWEIGHT, respectively. Good earnings, but some issues with the covid trials. \n* Goldman Sachs (GS) raised price target for:\n   * Ford (F) from $7 to $8 at NEUTRAL\n   * General Motors (GM) from $36 to $41 at BUY\n* Crocs (CROX) had a price target raised by Piper Sandler and B. Riley from $48 to $53 at OVERWEIGHT and $50 to $54 at BUY. This is on the back of a collaboration with Justin Bieber\n* Blackrock (BLK) had its price target raised by Deutsche Bank and Citigroup from $661 to $685 at BUY, and $690 to $800 at BUY.\n* Booking.com (BKNG) had its target raised by Barclays from $1,900 to $2,000 at OVERWEIGHT.\n* Bed Bath and Beyond (BBBY) had a target raised by Raymond James from $22 to $26 at STRONG BUY.\n* Delta Airlines (DAL) reported a $5.3 Billion loss for Q3 as operations are ravaged by the pandemic.\n* Apple (AAPL) had its price target raised by Morgan Stanley and Credit Suisse Group from $130 to $136 at OVERWEIGHT, and $95 to $106 at NEUTRAL, respectively.\n* FDA cited Lilly's Branchburg, New Jersey facility on two counts of inadequate \"control of computer systems,\" Lilly confirmed in an email. Those two findings included deleted data on the company's manufacturing processes and failed quality control over audit paper trails, sources told Reuters.\n* Notable Performers today: NIO 21.6% up, XPEV 14.2% up, BBBY 8.4% up, JKS 8.3% up, GRUB 8.1% up, HYLN 8.1% up, LI 7.8% up, BIDU 7.47% up.\n\n\"Live a great life where you are, and in the daily work you have to do, and greater works will surely find you out. Big things will come to you, asking to be done\" -Wallace D. Wattles", true, false, false, "stocks", "t5_2qjfk", 878915, "public", "self", "Here is a Market Recap for today Wed, Oct 14, 2020. Please enjoy!", 0, [], 1.0, "https://www.reddit.com/r/stocks/comments/jb8hid/here_is_a_market_recap_for_today_wed_oct_14_2020/", "all_ads", 6, 1602702658.0, {"all_awardings": [], "allow_live_comments": false, "author": "psychotrader00", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_7gtjd4c0", "author_patreon_flair": false, "author_premium": true, "awarders": [], "can_mod_post": false, "contest_mode": false, "created_utc": 1602706258, "domain": "self.stocks", "full_link": "https://www.reddit.com/r/stocks/comments/jb8hid/here_is_a_market_recap_for_today_wed_oct_14_2020/", "gildings": {}, "id": "jb8hid", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 91, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/stocks/comments/jb8hid/here_is_a_market_recap_for_today_wed_oct_14_2020/", "pinned": false, "pwls": 6, "retrieved_on": 1602706269, "score": 1, "selftext": "**PsychoMarket Recap - Wednesday, October 14, 2020**\n\nStocks accelerated yesterday’s losses as market participants digested a new round of corporate earnings report and the prospects of additional stimulus before the November presidential election.\n\nThe Nasdaq finished 0.84% down. The S&amp;P (SPY) fell 0.63%, and the Dow Jones finished the day 0.53% down.\n\nToday, Treasury Secretary Mnuchin admitted that coming to a deal regarding stimulus and advancing the measure through Congress would be “difficult” before the November election. The remarks come shortly after Mnuchin and House Speaker Pelosi met on the phone to negotiate further, a deal Pelosi’s spokesperson called “productive”. The two are set to discuss again tomorrow, but after multiple weeks of discussion and the November election coming ever-nearer, chances for additional stimulus look dim. \n\nThe impasse between US lawmakers over stimulus is alarming, given the frequent calls of Pres. Trump, Jerome Powell and other FOMC members, and economist for more virus-relief. Yesterday, Senate Leader Mitch McConnel said he would introduce a smaller, more targeted proposal to the Senate when the chamber reconvenes next Monday. He said “When the full Senate returns on October 19th, our first order of business will be voting again on targeted relief for American workers, including new funding for the PPP.” The estimated $500 billion deal is way below the $1.8 trillion package proposed by the White House earlier in the week, a sign that negotiations may be souring. However, Pelosi has made it clear she would not support smaller, targeted bills, calling them inadequate. Pres. Trump appears to agree with her, tweeting “Go big or go home!!!” for more stimulus. \n\nIn other news, two companies in the forefront of vaccine development for the coronavirus announced their respective trials were put on trial over safety concerns. Eli Lilly (LLY) said Tuesday afternoon that enrollment for its COVID-19 treatment would be temporarily halted, less than a day after Johnson &amp; Johnson (JNJ) said clinical trials for its COVID-19 vaccine candidate were paused due to an unexplained illness in a participant. Shares of Eli Lilly and Johnson &amp; Johnson were little changed overnight after dropping during Tuesday’s session.\n\nIn terms of earnings season, all eyes are on big banks as they have already started to report. An article published by Marketbeat summarized sentiment by stating that “JPMorgan Chase, Citigroup, Wells Fargo and Bank of America saw their profits partly recover in the third quarter from the depths of the coronavirus-caused recession earlier this year. The turnaround stems mostly from improvements in the U.S. economy that allowed these big banks to set aside less money to cover potentially bad loans — $5 billion in the third quarter versus $33 billion in the second quarter.”\n\n**Highlights**\n\n* Goldman Sachs (GS) reported third-quarter results that greatly exceeded expectations. The stock was marginally green at the time of writing, pulled down by the broader market.\n   * EPS of  $9.68 vs $5.37 estimate \n   * Revenue of $10.70 billion vs $9.40 billion\n* Bank of America (BAC) barely outperformed earnings estimates. The stock took a hit and was 4.25% down at the time of writing. \n   * EPS of $0.51 vs $0.43\n   * Revenue of $20.30 billion vs $20.88 billion estimate\n* Wells Fargo (WFC) slightly beat earnings. The stock also took a big hit today, 5.27% down at the time of writing. \n   * EPS of $18.86 billion vs $17.87 billion.\n* Amazon (AMZN) has struck a deal with the NFL to stream a playoff game this season, people familiar with the matter said. \n* Since Sept. 23, the Russell 2000 has risen nearly 13%, outperforming the S&amp;P 500 by 4 percentage points. The small-cap benchmark is now approaching its year to date high of 1705.2, set in January, and is only 100-odd points below the record it reached in 2018.\n* Intel Corporation (INTC) had price target raised by UBS from $64 to $67\n* Livongo (LVGO) had its price target raised by JPMorgan (JPM) from $88 to $150\n* NIO was upgraded by JPMorgan Chase from NEUTRAL to OVERWEIGHT with $40 price target. The stock was one fire today!!!!\n* United Parcel Service (UPS ) had target raised by Citigroup from $150 to $190 at BUY\n* The Trade Desk (TTD) had a target raised by Needham from $580 to $750 at BUY. This is a huuuge increase, very bullish!\n* Peloton (PTON) had its price target raised by Barclays from $111 to $142 at OVERWEIGHT. This is a monster stock!\n* Johnson &amp; Johnson (JNJ) had targets raised by Credit Suisse and Cantor Fitzgerald from $163 to $168 at OUTPERFORM, and $168 to $180 at OVERWEIGHT, respectively. Good earnings, but some issues with the covid trials. \n* Goldman Sachs (GS) raised price target for:\n   * Ford (F) from $7 to $8 at NEUTRAL\n   * General Motors (GM) from $36 to $41 at BUY\n* Crocs (CROX) had a price target raised by Piper Sandler and B. Riley from $48 to $53 at OVERWEIGHT and $50 to $54 at BUY. This is on the back of a collaboration with Justin Bieber\n* Blackrock (BLK) had its price target raised by Deutsche Bank and Citigroup from $661 to $685 at BUY, and $690 to $800 at BUY.\n* Booking.com (BKNG) had its target raised by Barclays from $1,900 to $2,000 at OVERWEIGHT.\n* Bed Bath and Beyond (BBBY) had a target raised by Raymond James from $22 to $26 at STRONG BUY.\n* Delta Airlines (DAL) reported a $5.3 Billion loss for Q3 as operations are ravaged by the pandemic.\n* Apple (AAPL) had its price target raised by Morgan Stanley and Credit Suisse Group from $130 to $136 at OVERWEIGHT, and $95 to $106 at NEUTRAL, respectively.\n* FDA cited Lilly's Branchburg, New Jersey facility on two counts of inadequate \"control of computer systems,\" Lilly confirmed in an email. Those two findings included deleted data on the company's manufacturing processes and failed quality control over audit paper trails, sources told Reuters.\n* Notable Performers today: NIO 21.6% up, XPEV 14.2% up, BBBY 8.4% up, JKS 8.3% up, GRUB 8.1% up, HYLN 8.1% up, LI 7.8% up, BIDU 7.47% up.\n\n\"Live a great life where you are, and in the daily work you have to do, and greater works will surely find you out. Big things will come to you, asking to be done\" -Wallace D. Wattles", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "stocks", "subreddit_id": "t5_2qjfk", "subreddit_subscribers": 878915, "subreddit_type": "public", "thumbnail": "self", "title": "Here is a Market Recap for today Wed, Oct 14, 2020. Please enjoy!", "total_awards_received": 0, "treatment_tags": [], "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/stocks/comments/jb8hid/here_is_a_market_recap_for_today_wed_oct_14_2020/", "whitelist_status": "all_ads", "wls": 6, "created": 1602702658.0}], [[], false, "mrcet007", null, [], null, "text", "t2_fmu49", false, false, [], false, false, 1597384598, "self.stocks", "https://www.reddit.com/r/stocks/comments/i9gjal/which_are_the_top_companies_with_low_capex_cost/", {}, "i9gjal", true, false, false, false, true, true, false, "", "discussion", [], "8acd2324-65e6-11e5-a263-122ab0778f8b", "Discussion", "dark", "text", false, false, true, 2, 0, false, "all_ads", "/r/stocks/comments/i9gjal/which_are_the_top_companies_with_low_capex_cost/", false, 6, 1597384609, 1, "Which are the companies which meets the below criterias\n\n1. Low capex on fixed assets i.e. no airlines, cruises industrials etc. Is there a proxy metric for this I can use in screeners?\n2. Profitable or high growth  with path to profitablty before COVID\n3. Low debt\n4. Have sufficient cash to survive COVID asummimg current  COVID situation remains for another year or two\n4. Stock price got beaten down due to COVID. I.e. -10% YTD least\n5. Can hibernate the business (ability to reduce cost heavily) during COVID and can scale up post covid\n\nI can think of few LYV, VVI, BKNG, DKNG what am I missing? \nAre there other online, tech companies?", true, false, false, "stocks", "t5_2qjfk", 791571, "public", "self", "Which are the top companies with low capex cost but got beaten down due to COVID alone?", 0, [], 1.0, "https://www.reddit.com/r/stocks/comments/i9gjal/which_are_the_top_companies_with_low_capex_cost/", "all_ads", 6, 1597380998.0, {"all_awardings": [], "allow_live_comments": false, "author": "mrcet007", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_fmu49", "author_patreon_flair": false, "author_premium": false, "awarders": [], "can_mod_post": false, "contest_mode": false, "created_utc": 1597384598, "domain": "self.stocks", "full_link": "https://www.reddit.com/r/stocks/comments/i9gjal/which_are_the_top_companies_with_low_capex_cost/", "gildings": {}, "id": "i9gjal", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_css_class": "discussion", "link_flair_richtext": [], "link_flair_template_id": "8acd2324-65e6-11e5-a263-122ab0778f8b", "link_flair_text": "Discussion", "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 2, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/stocks/comments/i9gjal/which_are_the_top_companies_with_low_capex_cost/", "pinned": false, "pwls": 6, "retrieved_on": 1597384609, "score": 1, "selftext": "Which are the companies which meets the below criterias\n\n1. Low capex on fixed assets i.e. no airlines, cruises industrials etc. Is there a proxy metric for this I can use in screeners?\n2. Profitable or high growth  with path to profitablty before COVID\n3. Low debt\n4. Have sufficient cash to survive COVID asummimg current  COVID situation remains for another year or two\n4. Stock price got beaten down due to COVID. I.e. -10% YTD least\n5. Can hibernate the business (ability to reduce cost heavily) during COVID and can scale up post covid\n\nI can think of few LYV, VVI, BKNG, DKNG what am I missing? \nAre there other online, tech companies?", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "stocks", "subreddit_id": "t5_2qjfk", "subreddit_subscribers": 791571, "subreddit_type": "public", "thumbnail": "self", "title": "Which are the top companies with low capex cost but got beaten down due to COVID alone?", "total_awards_received": 0, "treatment_tags": [], "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/stocks/comments/i9gjal/which_are_the_top_companies_with_low_capex_cost/", "whitelist_status": "all_ads", "wls": 6, "created": 1597380998.0}], [[], false, "Commandobolt", null, [], null, "text", "t2_2nc3jl1", false, false, [], false, false, 1595703878, "self.stocks", "https://www.reddit.com/r/stocks/comments/hxs7ea/starting_my_portfolio_good_or_bad/", {}, "hxs7ea", true, false, false, false, true, true, false, "", "advicerequest", [], "75a227ec-65e6-11e5-96ee-12d48f46797b", "Advice Request", "dark", "text", false, false, true, 12, 0, false, "all_ads", "/r/stocks/comments/hxs7ea/starting_my_portfolio_good_or_bad/", false, 6, 1595703889, 1, "So I just began investing in stocks, and i am pulling out around 3-5k to invest. I have already put 2k into WFC however a lot of you said it wasn’t a really good option so Im going to sell that and try to diversify my portfolio. I am first going to go for good Growth stocks which i can hold onto long term and get a solid return. Haven’t investing anything yet however I am mainly going for AMD, QCOMM, SPY, MA, BKNG, MSFT, APPL, AMZN, UPS.\n\nI am also considering going for high volatile stocks to get a quick return. For thus I am thinking of going for AUY, TSLA, PFE, and ARKK. Any tips would be appreciated.\n\nBtw im pretty young(under 20) so im just trying test things around.", true, false, false, "stocks", "t5_2qjfk", 762661, "public", "self", "Starting My portfolio. Good or Bad?", 0, [], 1.0, "https://www.reddit.com/r/stocks/comments/hxs7ea/starting_my_portfolio_good_or_bad/", "all_ads", 6, 1595700278.0, {"all_awardings": [], "allow_live_comments": false, "author": "Commandobolt", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_2nc3jl1", "author_patreon_flair": false, "author_premium": false, "awarders": [], "can_mod_post": false, "contest_mode": false, "created_utc": 1595703878, "domain": "self.stocks", "full_link": "https://www.reddit.com/r/stocks/comments/hxs7ea/starting_my_portfolio_good_or_bad/", "gildings": {}, "id": "hxs7ea", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_css_class": "advicerequest", "link_flair_richtext": [], "link_flair_template_id": "75a227ec-65e6-11e5-96ee-12d48f46797b", "link_flair_text": "Advice Request", "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 12, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/stocks/comments/hxs7ea/starting_my_portfolio_good_or_bad/", "pinned": false, "pwls": 6, "retrieved_on": 1595703889, "score": 1, "selftext": "So I just began investing in stocks, and i am pulling out around 3-5k to invest. I have already put 2k into WFC however a lot of you said it wasn’t a really good option so Im going to sell that and try to diversify my portfolio. I am first going to go for good Growth stocks which i can hold onto long term and get a solid return. Haven’t investing anything yet however I am mainly going for AMD, QCOMM, SPY, MA, BKNG, MSFT, APPL, AMZN, UPS.\n\nI am also considering going for high volatile stocks to get a quick return. For thus I am thinking of going for AUY, TSLA, PFE, and ARKK. Any tips would be appreciated.\n\nBtw im pretty young(under 20) so im just trying test things around.", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "stocks", "subreddit_id": "t5_2qjfk", "subreddit_subscribers": 762661, "subreddit_type": "public", "thumbnail": "self", "title": "Starting My portfolio. Good or Bad?", "total_awards_received": 0, "treatment_tags": [], "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/stocks/comments/hxs7ea/starting_my_portfolio_good_or_bad/", "whitelist_status": "all_ads", "wls": 6, "created": 1595700278.0}], [[], true, "stonksguru", null, [], null, "text", "t2_6cx0n3yc", false, false, [], false, false, 1591673106, "self.stocks", "https://www.reddit.com/r/stocks/comments/gzexx7/looking_for_more_stocks_for_my_portfolio/", {}, "gzexx7", true, false, false, false, true, true, false, "", "advicerequest", [], "75a227ec-65e6-11e5-96ee-12d48f46797b", "Advice Request", "dark", "text", false, false, true, 22, 0, false, "all_ads", "/r/stocks/comments/gzexx7/looking_for_more_stocks_for_my_portfolio/", false, 6, 1591818764, 1, "So, I started investing in January and I’m currently pretty happy with my choices, i own: \n\nAAPL; EXPE; LYFT; LUV; UAL; CCL; RCL; NCLH; CLVS; LTM. \n\nHowever I still have 3,5k ready to invest and I’m considering, would like you guys opinions on where to drop some. I have a few options on the table already: \n\nALXN; AAL; ASNA; BA; BKNG; CPE; DAL; MPC; MAR; MGM; MSFT; MUR; TRIP; UBER; WLL", true, false, false, "stocks", "t5_2qjfk", 692225, "public", "self", "Looking for more stocks for my portfolio", 0, [], 0.67, "https://www.reddit.com/r/stocks/comments/gzexx7/looking_for_more_stocks_for_my_portfolio/", "all_ads", 6, 1591669506.0, {"all_awardings": [], "allow_live_comments": true, "author": "stonksguru", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_6cx0n3yc", "author_patreon_flair": false, "author_premium": false, "awarders": [], "can_mod_post": false, "contest_mode": false, "created_utc": 1591673106, "domain": "self.stocks", "full_link": "https://www.reddit.com/r/stocks/comments/gzexx7/looking_for_more_stocks_for_my_portfolio/", "gildings": {}, "id": "gzexx7", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_css_class": "advicerequest", "link_flair_richtext": [], "link_flair_template_id": "75a227ec-65e6-11e5-96ee-12d48f46797b", "link_flair_text": "Advice Request", "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 22, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/stocks/comments/gzexx7/looking_for_more_stocks_for_my_portfolio/", "pinned": false, "pwls": 6, "retrieved_on": 1591818764, "score": 1, "selftext": "So, I started investing in January and I’m currently pretty happy with my choices, i own: \n\nAAPL; EXPE; LYFT; LUV; UAL; CCL; RCL; NCLH; CLVS; LTM. \n\nHowever I still have 3,5k ready to invest and I’m considering, would like you guys opinions on where to drop some. I have a few options on the table already: \n\nALXN; AAL; ASNA; BA; BKNG; CPE; DAL; MPC; MAR; MGM; MSFT; MUR; TRIP; UBER; WLL", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "stocks", "subreddit_id": "t5_2qjfk", "subreddit_subscribers": 692225, "subreddit_type": "public", "thumbnail": "self", "title": "Looking for more stocks for my portfolio", "total_awards_received": 0, "treatment_tags": [], "upvote_ratio": 0.67, "url": "https://www.reddit.com/r/stocks/comments/gzexx7/looking_for_more_stocks_for_my_portfolio/", "whitelist_status": "all_ads", "wls": 6, "created": 1591669506.0}], [[], false, "FoghornLegporn", null, [], null, "text", "t2_40aro5i", false, false, [], false, false, 1591397484, "self.stocks", "https://www.reddit.com/r/stocks/comments/gxez2d/what_would_you_add_to_this_portfolio/", {}, "gxez2d", true, false, false, false, true, true, false, "", "advicerequest", [], "75a227ec-65e6-11e5-96ee-12d48f46797b", "Advice Request", "dark", "text", false, false, true, 10, 0, false, "all_ads", "/r/stocks/comments/gxez2d/what_would_you_add_to_this_portfolio/", false, "self", {"enabled": false, "images": [{"id": "nAfTHEMfdfE73Jo9KmbC_9obIpIBDfDeXsGjJgprYp0", "resolutions": [{"height": 196, "url": "https://external-preview.redd.it/S5i7GPOsejfoyhNMy5jYOdo_ZlMGG8A6LHXCsrggw8o.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=94e90bbd8f40567f12987b5012d55e938d728d13", "width": 108}], "source": {"height": 370, "url": "https://external-preview.redd.it/S5i7GPOsejfoyhNMy5jYOdo_ZlMGG8A6LHXCsrggw8o.jpg?auto=webp&amp;s=7dc44b6e83fa3dd75d50fe5c853051ef2a525471", "width": 203}, "variants": {}}]}, 6, 1591397492, 1, "Thinking of selling 30 $AMZN and picking up something with a little room for faster growth. Currently holding:\n\n   \n[**AMZN**](https://client.schwab.com/SymbolRouting.aspx?symbol=AMZN) AMAZON.COM INC  80\n\n[**AAPL**](https://client.schwab.com/SymbolRouting.aspx?symbol=AAPL) APPLE INC  200.5379\n\n[**V**](https://client.schwab.com/SymbolRouting.aspx?symbol=V) VISA INC CLASS A  250.3806\n\n[**SQ**](https://client.schwab.com/SymbolRouting.aspx?symbol=SQ) SQUARE INC CLASS A  200\n\n[**BKNG**](https://client.schwab.com/SymbolRouting.aspx?symbol=BKNG) BOOKING HOLDINGS INC  15\n\n[**JPM**](https://client.schwab.com/SymbolRouting.aspx?symbol=JPM) J P MORGAN CHASE &amp; CO  250.9674\n\n[**MSFT**](https://client.schwab.com/SymbolRouting.aspx?symbol=MSFT) MICROSOFT CORP  300\n\n[**AMD**](https://client.schwab.com/SymbolRouting.aspx?symbol=AMD) ADVANCED MICRO DEVIC   250\n\n[**HD**](https://client.schwab.com/SymbolRouting.aspx?symbol=HD) HOME DEPOT INC   25", true, false, false, "stocks", "t5_2qjfk", 679509, "public", "self", "What would you add to this portfolio?", 0, [], 1.0, "https://www.reddit.com/r/stocks/comments/gxez2d/what_would_you_add_to_this_portfolio/", "all_ads", 6, 1591393884.0, {"all_awardings": [], "allow_live_comments": false, "author": "FoghornLegporn", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_40aro5i", "author_patreon_flair": false, "author_premium": false, "awarders": [], "can_mod_post": false, "contest_mode": false, "created_utc": 1591397484, "domain": "self.stocks", "full_link": "https://www.reddit.com/r/stocks/comments/gxez2d/what_would_you_add_to_this_portfolio/", "gildings": {}, "id": "gxez2d", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_css_class": "advicerequest", "link_flair_richtext": [], "link_flair_template_id": "75a227ec-65e6-11e5-96ee-12d48f46797b", "link_flair_text": "Advice Request", "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 10, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/stocks/comments/gxez2d/what_would_you_add_to_this_portfolio/", "pinned": false, "post_hint": "self", "preview": {"enabled": false, "images": [{"id": "nAfTHEMfdfE73Jo9KmbC_9obIpIBDfDeXsGjJgprYp0", "resolutions": [{"height": 196, "url": "https://external-preview.redd.it/S5i7GPOsejfoyhNMy5jYOdo_ZlMGG8A6LHXCsrggw8o.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=94e90bbd8f40567f12987b5012d55e938d728d13", "width": 108}], "source": {"height": 370, "url": "https://external-preview.redd.it/S5i7GPOsejfoyhNMy5jYOdo_ZlMGG8A6LHXCsrggw8o.jpg?auto=webp&amp;s=7dc44b6e83fa3dd75d50fe5c853051ef2a525471", "width": 203}, "variants": {}}]}, "pwls": 6, "retrieved_on": 1591397492, "score": 1, "selftext": "Thinking of selling 30 $AMZN and picking up something with a little room for faster growth. Currently holding:\n\n   \n[**AMZN**](https://client.schwab.com/SymbolRouting.aspx?symbol=AMZN) AMAZON.COM INC  80\n\n[**AAPL**](https://client.schwab.com/SymbolRouting.aspx?symbol=AAPL) APPLE INC  200.5379\n\n[**V**](https://client.schwab.com/SymbolRouting.aspx?symbol=V) VISA INC CLASS A  250.3806\n\n[**SQ**](https://client.schwab.com/SymbolRouting.aspx?symbol=SQ) SQUARE INC CLASS A  200\n\n[**BKNG**](https://client.schwab.com/SymbolRouting.aspx?symbol=BKNG) BOOKING HOLDINGS INC  15\n\n[**JPM**](https://client.schwab.com/SymbolRouting.aspx?symbol=JPM) J P MORGAN CHASE &amp; CO  250.9674\n\n[**MSFT**](https://client.schwab.com/SymbolRouting.aspx?symbol=MSFT) MICROSOFT CORP  300\n\n[**AMD**](https://client.schwab.com/SymbolRouting.aspx?symbol=AMD) ADVANCED MICRO DEVIC   250\n\n[**HD**](https://client.schwab.com/SymbolRouting.aspx?symbol=HD) HOME DEPOT INC   25", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "stocks", "subreddit_id": "t5_2qjfk", "subreddit_subscribers": 679509, "subreddit_type": "public", "thumbnail": "self", "title": "What would you add to this portfolio?", "total_awards_received": 0, "treatment_tags": [], "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/stocks/comments/gxez2d/what_would_you_add_to_this_portfolio/", "whitelist_status": "all_ads", "wls": 6, "created": 1591393884.0}], [[], false, "pmfitz6007", null, [], null, "text", "t2_6e4ydjmd", false, false, [], false, false, 1588863638, "self.stocks", "https://www.reddit.com/r/stocks/comments/gf84hs/bkng_earnings_call/", {}, "gf84hs", true, false, false, false, true, true, false, "", "advice", [], "823be0a6-65e6-11e5-9784-125ee764bc01", "Advice", "dark", "text", false, false, true, 5, 0, false, "all_ads", "/r/stocks/comments/gf84hs/bkng_earnings_call/", false, 6, 1588866651, 1, "Is anyone else thinking about 4/8 PUT on BKNG? I'm a little scared because I've had a bad week but I'm wondering if anyone else is expecting something similar because eve if they beat earnings that woul still be a lost over all. What do you all think?", true, false, false, "stocks", "t5_2qjfk", 637222, "public", "self", "BKNG Earnings call", 0, [], 0.67, "https://www.reddit.com/r/stocks/comments/gf84hs/bkng_earnings_call/", "all_ads", 6, 1588860038.0, {"all_awardings": [], "allow_live_comments": false, "author": "pmfitz6007", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_6e4ydjmd", "author_patreon_flair": false, "author_premium": false, "awarders": [], "can_mod_post": false, "contest_mode": false, "created_utc": 1588863638, "domain": "self.stocks", "full_link": "https://www.reddit.com/r/stocks/comments/gf84hs/bkng_earnings_call/", "gildings": {}, "id": "gf84hs", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_css_class": "advice", "link_flair_richtext": [], "link_flair_template_id": "823be0a6-65e6-11e5-9784-125ee764bc01", "link_flair_text": "Advice", "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 5, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/stocks/comments/gf84hs/bkng_earnings_call/", "pinned": false, "pwls": 6, "retrieved_on": 1588866651, "score": 1, "selftext": "Is anyone else thinking about 4/8 PUT on BKNG? I'm a little scared because I've had a bad week but I'm wondering if anyone else is expecting something similar because eve if they beat earnings that woul still be a lost over all. What do you all think?", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "stocks", "subreddit_id": "t5_2qjfk", "subreddit_subscribers": 637222, "subreddit_type": "public", "thumbnail": "self", "title": "BKNG Earnings call", "total_awards_received": 0, "treatment_tags": [], "upvote_ratio": 0.67, "url": "https://www.reddit.com/r/stocks/comments/gf84hs/bkng_earnings_call/", "whitelist_status": "all_ads", "wls": 6, "created": 1588860038.0}], [[], false, "mrcet007", null, [], null, "text", "t2_fmu49", false, false, [], false, false, 1588520713, "self.stocks", "https://www.reddit.com/r/stocks/comments/gcsq3h/which_is_a_better_buy_bkng_or_expe/", {}, "gcsq3h", true, false, false, false, true, true, false, "", [], "dark", "text", false, false, true, 1, 0, false, "all_ads", "/r/stocks/comments/gcsq3h/which_is_a_better_buy_bkng_or_expe/", false, 6, 1588520718, 1, "Both are undervalued and seem to hold a kind of duopoly in the online travel booking industry?\n\n1. Which one would you buy and why?\n2. Which has more upside post corona?\n3. Which has a lesser risk of bankruptcy?\n4. Are there any other solid online travel company or travel tech company which I am missing?", true, false, false, "stocks", "t5_2qjfk", 630840, "public", "self", "Which is a better buy BKNG or EXPE?", 0, [], 1.0, "https://www.reddit.com/r/stocks/comments/gcsq3h/which_is_a_better_buy_bkng_or_expe/", "all_ads", 6, 1588517113.0, {"all_awardings": [], "allow_live_comments": false, "author": "mrcet007", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_fmu49", "author_patreon_flair": false, "author_premium": false, "awarders": [], "can_mod_post": false, "contest_mode": false, "created_utc": 1588520713, "domain": "self.stocks", "full_link": "https://www.reddit.com/r/stocks/comments/gcsq3h/which_is_a_better_buy_bkng_or_expe/", "gildings": {}, "id": "gcsq3h", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 1, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/stocks/comments/gcsq3h/which_is_a_better_buy_bkng_or_expe/", "pinned": false, "pwls": 6, "retrieved_on": 1588520718, "score": 1, "selftext": "Both are undervalued and seem to hold a kind of duopoly in the online travel booking industry?\n\n1. Which one would you buy and why?\n2. Which has more upside post corona?\n3. Which has a lesser risk of bankruptcy?\n4. Are there any other solid online travel company or travel tech company which I am missing?", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "stocks", "subreddit_id": "t5_2qjfk", "subreddit_subscribers": 630840, "subreddit_type": "public", "thumbnail": "self", "title": "Which is a better buy BKNG or EXPE?", "total_awards_received": 0, "treatment_tags": [], "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/stocks/comments/gcsq3h/which_is_a_better_buy_bkng_or_expe/", "whitelist_status": "all_ads", "wls": 6, "created": 1588517113.0}], [[], false, "Twin_11", null, [], null, "text", "t2_67zgzzv7", false, false, [], false, false, 1587563141, "self.stocks", "https://www.reddit.com/r/stocks/comments/g61di7/six_tvix_bkng_dal/", {}, "g61di7", true, false, false, false, true, true, false, "", "advice", [], "823be0a6-65e6-11e5-9784-125ee764bc01", "Advice", "dark", "text", false, false, true, 20, 0, false, "all_ads", "/r/stocks/comments/g61di7/six_tvix_bkng_dal/", false, 6, 1587563142, 1, "Need advice, I’m 19 years old and just got into stocks. Started off buying several shares in Tesla when it was at 500. Have around 1.5k to play with but I’m wondering will six flags be a smart move or just I invest into others such as TVIX, BKNG and Dal?", true, false, false, "stocks", "t5_2qjfk", 611852, "public", "self", "SIX, TVIX, BKNG, DAL", 0, [], "https://www.reddit.com/r/stocks/comments/g61di7/six_tvix_bkng_dal/", "all_ads", 6, 1587559541.0, {"all_awardings": [], "allow_live_comments": false, "author": "Twin_11", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_67zgzzv7", "author_patreon_flair": false, "author_premium": false, "awarders": [], "can_mod_post": false, "contest_mode": false, "created_utc": 1587563141, "domain": "self.stocks", "full_link": "https://www.reddit.com/r/stocks/comments/g61di7/six_tvix_bkng_dal/", "gildings": {}, "id": "g61di7", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_css_class": "advice", "link_flair_richtext": [], "link_flair_template_id": "823be0a6-65e6-11e5-9784-125ee764bc01", "link_flair_text": "Advice", "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 20, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/stocks/comments/g61di7/six_tvix_bkng_dal/", "pinned": false, "pwls": 6, "retrieved_on": 1587563142, "score": 1, "selftext": "Need advice, I’m 19 years old and just got into stocks. Started off buying several shares in Tesla when it was at 500. Have around 1.5k to play with but I’m wondering will six flags be a smart move or just I invest into others such as TVIX, BKNG and Dal?", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "stocks", "subreddit_id": "t5_2qjfk", "subreddit_subscribers": 611852, "subreddit_type": "public", "thumbnail": "self", "title": "SIX, TVIX, BKNG, DAL", "total_awards_received": 0, "treatment_tags": [], "url": "https://www.reddit.com/r/stocks/comments/g61di7/six_tvix_bkng_dal/", "whitelist_status": "all_ads", "wls": 6, "created": 1587559541.0}], [[], false, "mr_slice07", null, [], null, "text", "t2_15s7ao", false, false, [], false, false, 1586580709, "self.stocks", "https://www.reddit.com/r/stocks/comments/fywqtz/bkng_advice/", {}, "fywqtz", true, false, false, false, true, true, false, "", "tickerquestion", [], "65741e70-65e6-11e5-8105-129e4297eb59", "Ticker Question", "dark", "text", false, false, true, 1, 0, false, "all_ads", "/r/stocks/comments/fywqtz/bkng_advice/", false, 6, 1586580711, 1, "When would be a good time to jump in on Booking Holdings I see their fair value at around 1950 and they were trading above that before the crash. Anyone have some insight or advice?", true, false, false, "stocks", "t5_2qjfk", 591406, "public", "self", "BKNG Advice", 0, [], "https://www.reddit.com/r/stocks/comments/fywqtz/bkng_advice/", "all_ads", 6, 1586577109.0, {"all_awardings": [], "allow_live_comments": false, "author": "mr_slice07", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_15s7ao", "author_patreon_flair": false, "author_premium": false, "awarders": [], "can_mod_post": false, "contest_mode": false, "created_utc": 1586580709, "domain": "self.stocks", "full_link": "https://www.reddit.com/r/stocks/comments/fywqtz/bkng_advice/", "gildings": {}, "id": "fywqtz", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_css_class": "tickerquestion", "link_flair_richtext": [], "link_flair_template_id": "65741e70-65e6-11e5-8105-129e4297eb59", "link_flair_text": "Ticker Question", "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 1, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/stocks/comments/fywqtz/bkng_advice/", "pinned": false, "pwls": 6, "retrieved_on": 1586580711, "score": 1, "selftext": "When would be a good time to jump in on Booking Holdings I see their fair value at around 1950 and they were trading above that before the crash. Anyone have some insight or advice?", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "stocks", "subreddit_id": "t5_2qjfk", "subreddit_subscribers": 591406, "subreddit_type": "public", "thumbnail": "self", "title": "BKNG Advice", "total_awards_received": 0, "treatment_tags": [], "url": "https://www.reddit.com/r/stocks/comments/fywqtz/bkng_advice/", "whitelist_status": "all_ads", "wls": 6, "created": 1586577109.0}], [[], false, "kkInkr", null, [], null, "text", "t2_4d8y75sv", false, false, [], false, false, 1580437895, "self.stocks", "https://www.reddit.com/r/stocks/comments/ewh9ip/cabo/", {}, "ewh9ip", true, false, false, false, true, true, false, "", [], "dark", "text", false, false, true, 4, 0, false, "all_ads", "/r/stocks/comments/ewh9ip/cabo/", false, 6, 1580437897, 1, "Anyone knows anything about this company? The price history mimic that of AMZN/BKNG.", true, false, false, "stocks", "t5_2qjfk", 478529, "public", "self", "CABO", 0, "https://www.reddit.com/r/stocks/comments/ewh9ip/cabo/", "all_ads", 6, 1580434295.0, {"all_awardings": [], "allow_live_comments": false, "author": "kkInkr", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_4d8y75sv", "author_patreon_flair": false, "author_premium": false, "awarders": [], "can_mod_post": false, "contest_mode": false, "created_utc": 1580437895, "domain": "self.stocks", "full_link": "https://www.reddit.com/r/stocks/comments/ewh9ip/cabo/", "gildings": {}, "id": "ewh9ip", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 4, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/stocks/comments/ewh9ip/cabo/", "pinned": false, "pwls": 6, "retrieved_on": 1580437897, "score": 1, "selftext": "Anyone knows anything about this company? The price history mimic that of AMZN/BKNG.", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "stocks", "subreddit_id": "t5_2qjfk", "subreddit_subscribers": 478529, "subreddit_type": "public", "thumbnail": "self", "title": "CABO", "total_awards_received": 0, "url": "https://www.reddit.com/r/stocks/comments/ewh9ip/cabo/", "whitelist_status": "all_ads", "wls": 6, "created": 1580434295.0}]]