[[[], false, "EducationalOlive0", null, [], null, "text", "t2_5ncum280", false, false, [], false, false, 1608748294, "self.stocks", "https://www.reddit.com/r/stocks/comments/kiyfwx/pfmt_performant_financial_boring_business_but_a/", {}, "kiyfwx", true, false, false, false, true, true, false, "", [], "dark", "text", false, false, true, 24, 0, false, "all_ads", "/r/stocks/comments/kiyfwx/pfmt_performant_financial_boring_business_but_a/", false, "self", {"enabled": false, "images": [{"id": "KN_eOqEeipI6_qcQuig4n-Sq1MpJYYXxlqi9NDSn9Do", "resolutions": [{"height": 25, "url": "https://external-preview.redd.it/CR1tMgcEGj5dM1We08jDPVqcCjpyz1dW-P51E8oDu4Y.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=24a517bf8a387457f6921fd5ebdabd4f9a5c6708", "width": 108}, {"height": 51, "url": "https://external-preview.redd.it/CR1tMgcEGj5dM1We08jDPVqcCjpyz1dW-P51E8oDu4Y.jpg?width=216&amp;crop=smart&amp;auto=webp&amp;s=adfdb10aad0fcb0d98af0d2f16f9f4635613a113", "width": 216}, {"height": 76, "url": "https://external-preview.redd.it/CR1tMgcEGj5dM1We08jDPVqcCjpyz1dW-P51E8oDu4Y.jpg?width=320&amp;crop=smart&amp;auto=webp&amp;s=a71c48335df63c176dadd52f883e2504b70edfa6", "width": 320}, {"height": 152, "url": "https://external-preview.redd.it/CR1tMgcEGj5dM1We08jDPVqcCjpyz1dW-P51E8oDu4Y.jpg?width=640&amp;crop=smart&amp;auto=webp&amp;s=31bf3a46091eeaaed0ac09a18a358382c1858641", "width": 640}, {"height": 229, "url": "https://external-preview.redd.it/CR1tMgcEGj5dM1We08jDPVqcCjpyz1dW-P51E8oDu4Y.jpg?width=960&amp;crop=smart&amp;auto=webp&amp;s=bf9eed7037c16d416d760d932313374b32b0fb33", "width": 960}, {"height": 258, "url": "https://external-preview.redd.it/CR1tMgcEGj5dM1We08jDPVqcCjpyz1dW-P51E8oDu4Y.jpg?width=1080&amp;crop=smart&amp;auto=webp&amp;s=abd9040a2fa07e07008457063be52b425a95aef8", "width": 1080}], "source": {"height": 361, "url": "https://external-preview.redd.it/CR1tMgcEGj5dM1We08jDPVqcCjpyz1dW-P51E8oDu4Y.jpg?auto=webp&amp;s=5568fda33388504671590221b02b7265a3c7064f", "width": 1511}, "variants": {}}]}, 6, 1608748304, 1, "Disclaimer: I originally posted this in r/securityanalysis yesterday and received some responses. I am reposting it here to a bigger audience, with an added section to respond to some of the questions I received. I am hoping that by reposting on here, we can get more a discussion. I am not too familiar with reddit as I typically post on smaller value investing forums, and it is first time posting there. I plan to long in this company as I see the long term position of the company's growth in the health care sector. This is a minor position (5%) in what is a concentrated (10-15 company) portfolio.\n\n**PFMT- Performant Financial**  \n**Overview:**  \nPFMT is a technology-based provider of audit, recovery, payment accuracy, coordination of benefits (COB), and outsource services in the United States. PFMT analyze claims, identify, prevent and correct inaccurate payments. Using their proprietary analytics platform and industry expertise, PFMT aim to reduce losses on billions of dollars worth of improper healthcare payments, state/federal/and treasury tax delinquencies, defaulted student loans and other receivables. Primary customers include government commercial health plans, CMS, Blues plans, regional Insurers, private/commercial programs, etc that operate in complex and highly regulated environments that rely on PFMT's innovative and disruptive approach. Revenue is generated based on a percentage of validated recoveries for clients. Contracts are negotiated on case by case basis, fees may range from 10-30% of recoveries and the duration of contracts may last 3-5+ years. These are high margin, recurring revenue contracts, expected to provide multiple years of prolonged double digit growth.  \nThis is not a sexy business, quite boring in fact. However, a good investment should be boring. Hopefully you will also appreciate the new path management has coursed, and see the potential upside in this turnaround story.  \nHistorically, PFMT was known for its legacy business as a collection agency for student loans, federal/state tax delinquencies and other receivables. Since the taking over of student loan originations by the Federal government a decade ago, PFMTs student loan collections have seen a diminishing contribution to revenues over time. Currently, the student loans collection business accounts for about 22% of revenues. While \"Other\" legacy collections still account for about 26% of revenues. Growth in Other legacy collections has remained relatively flat over the years. A smaller business segment derives marginal revenues from first party call centers and licensing of hosted technology solutions to clients. ***The diamond in the rough refers to PFMT's up-and-coming*** ***healthcare*** ***business segment***, composed of claims auditing and eligibility reviews. After seeing losses in 2018/19 due to high ramp up costs and standard implementation time lags, this segment appears to be set for robust growth going forward. Management has been clear that from 2017-2019, adjusted EBITDA has witnessed a slowdown to reflect a period of transformation in the company to establish itself in the Healthcare space. Management has confidently reiterated their belief in successfully reaching a 2021 goal of achieving $200M revenue with 20% EBITDA margins, with double digit growth continuing for years to come.\n\n**Covid-19 Impact:**  \nThis year was shaping up to be a strong year for PFMT, as Q1 showed promising results that validated the new trajectory of the company. Unfortunately, Q2 and Q3 were impacted by the public health emergency related to Covid-19. The CARES act brought changes that affected the student loans collection segment. Student loan payments, interest accrual and involuntary collection of payments (wage garnishments) were originally suspended till September 30, 2020 but were extended till December 31, 2020. However, PFMT continued to generate student loan revenue for a number of months from existing in-process borrow rehabilitation agreements. Another impact of Covid came from existing healthcare audit customers that requested a short-term pause on PFMT activities. Mgmt has indicated these pauses have largely ended during the third quarter. To mitigate the impact of this temporary slowdown, mgmt had furloughed more than 500 employees which could result in savings of about $18 million. The company is now aggressively ramping up efforts (including hiring/recruiting). Mgmt anticipates the ramp up efforts to be properly reflected in revenue by Q1 of 2021.\n\n**Healthcare Business:**  \nThe healthcare platform has finally reached scale, accounting for the largest (and continually growing) contribution to PFMTs revenue. In Q3, the healthcare business generated $17.6M in revenue (48.5% of total revenues (refer to Figure 1 below to view a cut out from the latest 10-k)). That is a 20.5% increase on sequential basis and a 63% increase from the same period last year. Please refer to figure 2 below, to see the change in healthcare revenues over time. This segment will continue to grow as Mgmt has made it clear this will be a main focus for the company. Soon healthcare will be the primary source of revenue (50%++), leading to a market multiple re-rate.  \nHealthcare revenues over last 11 quarters:\n\nQ3 2020= $17.6M  \nQ2 2020= $14.6M  \nQ1 2020= $17.5M  \nQ4 2019=$14.3M  \nQ3 2019= $10.8M  \nQ2 2019= $9.3M  \nQ1 2019= $9M  \nQ4 2018= $9.9M  \nQ3 2018= $6.6M  \nQ2 2018= $6.1M  \nQ1 2018= $3.5M\n\n\\[Figure 1: Q3 Financial Highlight\\]([https://imgur.com/a/WlqPLjZ](https://imgur.com/a/WlqPLjZ))\n\n\\[Figure 2: PFMT Healthcare Revenues\\]([https://imgur.com/a/W1OtGXu](https://imgur.com/a/W1OtGXu))\n\n**Macro:**  \nThe macro environment indicates there should be tailwinds for the audit, recovery, payment accuracy and coordination of benefits outsourcing business solutions PFMT provides. According to the CMS, national healthcare expenditures are forecast to grow at 5.4% CAGR for the next 8 years. Reaching $6.8T by 2028. Despite efforts to reduce the amount of improper payments, error rates in the industry range from 6% in commercial to 14.9% in government plans. Healthcare spending growth is driven primarily by a combination of increasing enrollment and cost inflation. Given the current unemployment environment, we are witnessing a spike in Medicaid enrollment, which should continue to benefit the business via rising utilization and claims volumes. It is useful to note that there can be a lag of several months between Medicaid eligibility and resulting claims volumes. This indicates that a majority of the benefits from the current environment are still to come. Also, as private organizations and state governments are struggling with lower revenues and budget deficits, this could create an increased focus on cost containment strategies where PFMT could play a supporting function. PFMT mgmt sees a $200B+ healthcare TAM growing annually.  \n**Competitors:**  \nPFMT differentiates itself with its proprietary technology and customizable approach to each of their customers' needs. The space is mostly dominated by large, slow moving players, that lack flexibility and uniqueness in their approach. Major competitors include HMS Holdings Corp (HMSY-US, \\~\\~$3B mkt cap) and Cotiviti (acquired in mid-2018 for $4.9B). Contracts in this industry are limited, take time to implement and can last years. PFMT continues to build a moat around it's business by consistently winning, maintaining and being awarded new contracts. An example includes being re-awarded CMS recovery Audit Region 1 and being awarded the newly created Region 5. Thus, successfully showcasing PFMTs superior product and path to success in this space. PFMTs will continue to encroach on incumbents' healthcare market share as the market begins to realize the superiority of their technology and approach. Refer to Figure 3, below, for an image taken form the CMS website showing the audit region relative to competition. Figure 4 may help to visualize the healthcare insurance payment cycle, and where PFMT may offer value.  \n**Debt:**  \nOn Aug 2017, PFMT entered a credit agreement with an existing shareholder and customer, ECMC. As of September 30, 2020 PFMT has about $62M loan outstanding under this credit agreement. ECMC has been able to accumulate about 5.8M warrants in PFMT as part of the agreement (about 10% of outstanding shares) all at an average exercise price of $1.95. The effective interest rate was about 13.9% in the 1H 2020. The loan is classified as a current liability, with maturity in August 2021. However, PFMT has two one-year options to extend maturity.  \nPFMT currently (as of Sept 30,2020) has about $17.3M cash and equivalents on hand and is entering a period of FCF generation.  \nThe current low interest rate environment offers low hanging fruit for companies looking to refinance their loans at a lower rate. Reducing their loan rate to 5-8% could save up to $5.5M in annual interest expense.  \n**Timing/Technicals:**  \nAs the calendar approached their earnings announcement date (Nov 11), PFMT stock was trading around recent highs of $2. The stock started selling off aggressively into the earnings and significantly further following earnings (despite a very positive release). The selling pressure appears to have been caused by portfolio management layoffs at Invesco, a top holder. Public disclosure of these layoffs coincides with timing of initial selloff, and a recent 13G filing confirms the exited position. This should quell any fears holders and followers of this stock may have had, as the selling was not based on fundamental flaws in the company or a new short thesis. Invesco owned about 18% of PFMT. Following the recent pressure, it appears the stock is in extremely oversold territory. Since their exit, the average volume profile of the stock has improved significantly, making accumulating a position easier for both retail and institutional demand.  \n**Valuation:**  \nThe timing of Covid partially contributes to why the market overlooked this stock, as Q2 and Q3 earnings were impacted. To establish a fair EBITDA estimation for 2020, we will use Q1 results with a conservative bias. Q1 is most appropriate because it will give us the clearest picture of how the company was performing prior to the temporary impacts of Covid. Using Q1, EBITDA was $6.4M (after deducting stock compensation). Annualizing that amount will give us an EBITDA run rate of $25.6M. This is a conservative measure because we do not account for the impact of any potential interest rate savings or growth in the healthcare segment. Next we need to establish the enterprise value (EV= debt + mkt cap - cash). Which we use to calculate EV/EBITDA. Calculation below.  \nEBITDA= $25.6M  \nEnterprise Value (EV)= $62M (debt) + $41 (mkt cap) -$17.3M (Cash) = $85.7 M  \nEV/EBITDA= 3.3X  \nFully diluted share count of 59.7M o/s\n\nNow lets take a look at some Healthcare IT comparables. The first 7 are general comps, the bottom 3 are the most similar comps to PFMT. To clarify, HMSY is currently publicly trading and is a direct competitor to PFMT. In December 2019, HMSY acquired Accent (a coordination of benefits/payments accuracy unit of Intrado focused on commercial and Medicare Advantage payers) for $155M. Accent had generated about $50M of revenue during the 12 months ending october 2019 (vs PFMTs $150M revenues in 2019). Based on the transaction price, HMSY paid an estimated 11-12X EV/Ebitda on a TTM basis. COTV was acquired and taken private in 2018, it continues to be a direct competitor with PFMT. COTV operated in payment integrity and was acquired for $4.9B in mid 2018, an estimated EV/EBITDA multiple of 14-15X based on consensus 2019 estimates. Also, keep in mind that the average EV/EBITDA for S&amp;P companies in 2020 is about 14.5X.  \nHealthcare IT Peer Trading Comp Table  \n                        Mkt Cap  SHARES O/S           EV         EV/EBITDA\n\nHMSY              2,793   88.6M                   3,021 16.8X  \nCHNG              5,581 304.5M                10,237 11.2X  \nACN          173,423 661.1M              171,554 19X  \nADS                 3,466   49.6M                24,047 30.3X  \nHQY               5,013       77M                  5,803 27.2X  \nIQV                34,135  191.7M                45,733 19.5X  \nCERN            23,727 306.6M                24,167 14X\n\n                                                                    Average: 19.7X\n\nPFMT              40.5           59.7M                         86 3.3X  \n(fully diluted)\n\nMost Similar Comps:  \nCOTV                  4,900 (2019 est)                14.5X  \nAccess                 155 (Acquired by HMSY in 2019) 11-12X  \nHMSY              2,793 88.6M                   3,021 16.8X\n\n                                                                         Average: 14.3X  \n\\[Table 2\\]([https://imgur.com/a/MP4yZgi](https://imgur.com/a/MP4yZgi))\n\nThe market still largely views PFMT as a declining student loans collections firm. Yet growing beneath the surface is an attractive healthcare business. As this segment continues to grow the market will recognize the high quality recurring revenue, ability to scale, and increasingly healthcare-focused pure-play as a catalyst for a multiple rerate. Now using the comps above, I will provide 3 scenarios (best, base, worst case scenario) applying a discount to conservatively account for the micro-cap nature and higher leverage of PFMT.  \nIn the best case scenario, we apply a 14X EV/EBTDA ratio (rounded down from the most similar comparable peer average of 14.3X) which, on a fully diluted share basis, lead to a current price per share of $6.  \nIn the base case scenario, we take a couple of notches off the closest peer average and apply a 12X EV/EBITDA ratio. Resulting in a current target price of $5.15/share  \nIn the worst case scenario, we further take off two more notches from the most similar peer average to apply a 10X EV/EBITDA ratio. Resulting in a price of $4.29/share.  \nAlso, considering the existing ownership of the company. Parthenon investors, Prescott Group, Mill Road Capital are all large shareholders. It is not unreasonable to think that they pursue a more aggressive activist role in the company and set it up for sale at a premium. It is also possible that competitors recognize the massive discount of this up-and-coming threat, and decide to acquire PFMT before other market participants drive up the price making such a strategic acquisition far more expensive. All of which offer upside to existing shareholders.  \nAs we approach future quarters and results continue to support this positive narrative we should start to see investor appetite pick up for this name. Average daily volumes have quadrupled since Invesco's recent exiting has added to the freely trading shares, improving the liquidity profile of PFMT. These signals will start appearing on investor screens as they (professional small cap investors, value investors, quant investors, generalists, hedge funds, etc) look for new ideas. There is virtually zero sell-side coverage of this stock at the moment, this will likely change in the future. **Accumulating a position now, presents an opportunity for entry at basement level prices in a stock that has the potential to provide 500-700% upside.**\n\n*Thank you for taking the time to read my idea. Full disclosure, I am long PFMT. Feedback and criticism of this idea are encouraged. Always do your own due diligence. Ive included the sources used for this analysis in the links below.*  \n\\[***Figure 3.:*** *CMS RACs per region\\](*[*https://imgur.com/a/YWlHANZ*](https://imgur.com/a/YWlHANZ)*)*\n\n\\[***Figure 4:*** *Healthcare insurance payments explained\\](*[*https://imgur.com/a/sbrh5pZ*](https://imgur.com/a/sbrh5pZ)*)*  \n*Claim Submissions (Steps 1 + 2): After treating a patient, the healthcare provider submits a claim for reimbursement to the health insurer. The claim will include information on the diagnosis and treatment/procedure*  \n*Claim Adjudication (Step 3): The health plan conducts administrative checks (eg. validates provider information and patient eligibility/ coverage) and prices the claim using the providers contract/ fee schedule.*  \n*Pre-payment Review (Step 4): The payor will leverage internal tools, followed by third party/outsourced solutions (ie. PFMT offerings) to conduct payment accuracy analysis prior to payment. Errors (discrepancies between the submitted claim and the payors payment policies) are identified and corrected.*  \n*Claim Payment (Step 5 + 6): The health plan will reimburse the provider for the patient care and services rendered*  \n*Post-payment review (Step 7): The payor will again use internal tools, followed by third party solutions (PFMT) to evaluate prior payments with additional information that has become available (eg. clinical reviews). Payors will correct*\n\n**Part 2:** \n\n$PFMT hit $1 by EOD yesterday, as much as I would like to think that the prior write-up was a catalyst for PFMTs recent performance, it is more likely driven by some significant and recent industry developments.  This will be a short follow up summarizing the recent event and why I think it is important to the underlying thesis. Also, I will try to respond to the some of the questions received last night. Thank you to all who have engaged me. Hopefully we can continue this constructive dialogue around this investment idea. \n\nOn Monday morning (Dec 21), HMSY (a direct competitor of PFMT) announced it had agreed to be acquired by Gainwell Technologies for $3.4B. Gainwell is owned by the private equity firm Veritas Capital. In March 2020, DXC Technologies announced the sale of their Government Healthcare business segment for $5B in cash to Veritas which renamed this new segment: Gainwell Technologies. Prior to acquiring this segment from DXC, this healthcare business was generating $1.5B in annual revenues, growing double digits year over year with 20% margins (inline with industry standard and PFMTs 2021 margin goal). The transaction values HMSY at 16-17X forward 2021 EV/EBITDA.  From what I gather, this is above most consensus estimates but still seems to be a fair price. A reminder that Veritas also acquired Cotiviti (COTV) in 2018 at a slightly lower valuation of 14-16X EV/EBITDA. The willingness to pay a premium relative to their COTV recent transaction indicates growing opportunity in the space.\n\nVeritas intends on breaking up the various HMSY segments and redistributing them among its portfolio companies COTV and Gainwell. COTV will take on the payment integrity and population health management business while Gainwell will take on the Medicade, Coordination of benefits/third party liability services business. Strategically, Veritas is able to secure HMSY's valuable set of data assets in the Medicaid market, and gaining exposure to the potentially higher EBITDA in 2021 due to the positive recent Medicaid enrollment trend. However, HMSY has been under pressure for failing to deliver predictable results and underperformance in some segments (particularly their population health management business). This inherent volatility in the revenue model is a burden on these companies (including PFMT) as it masks longer term growth and margin expansion potential. \n\nThough FTC concerns don’t appear to be an issue. It is uncertain to me what this new Veritas combination will mean for their Medicare RAC regions. As HMSY has one region and COTV has two. I believe there is a program limit of two regions per vendor. This could prove to be an obstacle for the new entity.  Also the inherent culture clash in executing large mergers typically leads to significant employee turnover and loss of talent. In such a niche industry, I would imagine the labor market is tight and any brain drain could hurt the new entity. In fact, a basic linkedin search of these companies indicates a recent influx of talent from large competitors into PFMT. If industry incumbents, particularly experienced sales people, are realizing PFMT has a superior platform relative to the large slow moving competition then this should be another positive signal reinforcing PFMTs trajectory. Discount this as anecdotal investigative evidence but I think it has merit.\n\nThe continuing theme of consolidation in this particular area of Healthcare IT highlights the large market opportunity across cost-containment and solutions services.\n\nRecent transactions:\n\nAccess acquired by HMSY in 2018 at 11-12X EV/EBITDA\n\nDXC HC segment acquired by Veritas/Gainwell \n\nCOTV acquired by Veritas at 14-15X\n\nHMSY acquired by Veritas at 16-17X\n\n&amp;#x200B;\n\nThis all bodes well for PFMT, as it solidifies my view that this turnaround story is not being valued as an appropriate comp to its peers. If TODAY the market determines that HMSY is worth 16-17X EV/EBITDA, this supports my Base and Best Case Scenario of valuing PFMT using a 12X ($5.15/share) and 14X ($6/share) multiple, respectively (accounting for microcap nature and leverage by reducing the multiple by a few notches).  The recent price improvement in PFMT appears to be driven by a recognition of PFMT being undervalued on a comparable basis. Volumes have improved in the last few sessions but the stock is still extremely undervalued. Likely some retail investors accumulating entry positions. Imagine if a small fund of $100 AUM identifies this stock as an ideal investment, decides to initiate a small 200 basis point position. It would require 2-3M shares. The stock was up 20% today after trading only 1M shares, accumulating supply for a single fund position will require a significant movement in price. Given the current valuation, this opportunity could soon hit the radar screens of multiple funds. The recent string of transactions will continue to attract attention to this space. Sooner or later someone will start kicking the tires on PFMT...\n\nResponses to recent questions and comments:\n\n 1. Is it possible that customers build/improve their internal tools to the point where they become threats to PFMT?\n\nGood question. Customers may marginally improve their ability to audit claims internally but not to the point of being a threat. It's important to understand that the solutions/services offered by PFMT, HMSY, COTV, etc require technology- heavy platforms that require significant amount of resources (financial and intellectual) to develop, once developed there are minimal incremental costs for higher volumes. These types of commitments are not usually within the realm of possibilities among the customer base.  The ever-changing complexity around these types of industries makes in-house billing departments ill-equipped to maximize value relative to specialists like PFMT. An example to illustrate such complexity would be the ongoing changes in the International Classification of Disease codes (ICD). When the WHO decided to change the medical classification codes of ICD9 to ICD10, it increased the number of procedure codes from 13,000 to 68,000. This is just one example of the type of nuance that will always provide opportunity for specialist support from a PFMT. \n\n2. Terms of the credit agreement and Why hasn’t management refinanced the Debt?\n\nFor anyone eager to learn more about the terms of the Credit Agreement, i would advise you read the latest 10k (link posted in my original report). The 10-k is helpful in clearly outlining all details. \n\nI think management is working towards refinancing the debt. But these are not things that can be negotiated or arranged immediately. It is possible that management wants/needs to have a certain number of consistent quarter over quarter improvement before they can renegotiate terms. In the current interest rate environment and following their recent turnaround progress, this low hanging fruit should be picked soon enough. \n\n&amp;#x200B;\n\n3.   Divesting legacy business?\n\nI would not be surprised to see parts of the legacy business sold off as the focus turns toward the growing health care business. I will continue monitoring management discussion on next earnings call for any evidence to support this.\n\n&amp;#x200B;\n\n4. PFMT is transitioning to focus on its healthcare business.\n\n Some commentators have referred to PFMT as a pure-play student loans collection firm which would be a false description. Student loans do not account for a majority of their revenues and management has made it clear their focus has changed towards a constantly growing healthcare industry. \n\n&amp;#x200B;\n\n5. Comparables mentioned are 100X larger than PFMT, why is that a fair comparison?\n\nThis is a reasonable observation. The answer to which is a function of numerous factors. The current market cap is significantly depressed as the popularity contest that IS the stock market is not identifying the value of this name. The stock was depressed further as a large holder just sold their 18% position, pushing the price near all-time lows. The huge gap in public market valuation is one of the reasons why this is a table pounding buy in my opinion. As this gap closes the difference in market cap will seem more acceptable. \n\nAlso, despite being small, the fact that PFMT is able to compete on the same level with these giants is a testament to its superior product and team: evidenced by their ability to secure two Medicare RAC region contracts (competing directly with COTV and HMSY), among other contacts won from incumbents. \n\n6. What is the moat/\"secret sauce\"?\n\nI am not a software engineer, nor do I have inner workings into PFMT's technology. Based on publicly available information, I can speculate that PFMT's disruptive technology refers its ability to differentiate itself over the competition. Competitors have been using a \"one-size-fits-all approach\" to their customers. PFMT uses their proprietary software to scrape data and yield higher rates of potential recoverable claims. Their solutions are more client-centric than the competition. As a smaller player they can be nimble, providing customized solutions to fulfill each client’s needs. For this reason they continue to be rewarded with new contracts taken from large incumbents. See the recent presentations (on their website) for quantitative case study examples.\n\nThese contracts are difficult to win, have long term time horizons.  The technology to service customers is unique and initially capital intensive to establish. Barriers to entry are significant.\n\n  \n**Sources:**  \n[https://www.performantcorp.com/investors/events-and-presentations/default.aspx](https://www.performantcorp.com/investors/events-and-presentations/default.aspx)  \n[https://www.sec.gov/cgi-bin/browse-edgar?CIK=1550695&amp;owner=exclude](https://www.sec.gov/cgi-bin/browse-edgar?CIK=1550695&amp;owner=exclude)  \n[https://www.cms.gov/Research-Statistics-Data-and-Systems/Monitoring-Programs/Medicare-FFS-Compliance-Programs/Recovery-Audit-Program](https://www.cms.gov/Research-Statistics-Data-and-Systems/Monitoring-Programs/Medicare-FFS-Compliance-Programs/Recovery-Audit-Program)  \n[https://www.cms.gov/Research-Statistics-Data-and-Systems/Statistics-Trends-and-Reports/NationalHealthExpendData/NationalHealthAccountsHistorical](https://www.cms.gov/Research-Statistics-Data-and-Systems/Statistics-Trends-and-Reports/NationalHealthExpendData/NationalHealthAccountsHistorical)", false, false, false, "stocks", "t5_2qjfk", 985586, "public", "self", "$PFMT Performant Financial: Boring Business but a Diamond in the Rough", 0, [], 1.0, "https://www.reddit.com/r/stocks/comments/kiyfwx/pfmt_performant_financial_boring_business_but_a/", "all_ads", 6, 1608744694.0, {"all_awardings": [], "allow_live_comments": false, "author": "EducationalOlive0", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_5ncum280", "author_patreon_flair": false, "author_premium": false, "awarders": [], "can_mod_post": false, "contest_mode": false, "created_utc": 1608748294, "domain": "self.stocks", "full_link": "https://www.reddit.com/r/stocks/comments/kiyfwx/pfmt_performant_financial_boring_business_but_a/", "gildings": {}, "id": "kiyfwx", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 24, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/stocks/comments/kiyfwx/pfmt_performant_financial_boring_business_but_a/", "pinned": false, "post_hint": "self", "preview": {"enabled": false, "images": [{"id": "KN_eOqEeipI6_qcQuig4n-Sq1MpJYYXxlqi9NDSn9Do", "resolutions": [{"height": 25, "url": "https://external-preview.redd.it/CR1tMgcEGj5dM1We08jDPVqcCjpyz1dW-P51E8oDu4Y.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=24a517bf8a387457f6921fd5ebdabd4f9a5c6708", "width": 108}, {"height": 51, "url": "https://external-preview.redd.it/CR1tMgcEGj5dM1We08jDPVqcCjpyz1dW-P51E8oDu4Y.jpg?width=216&amp;crop=smart&amp;auto=webp&amp;s=adfdb10aad0fcb0d98af0d2f16f9f4635613a113", "width": 216}, {"height": 76, "url": "https://external-preview.redd.it/CR1tMgcEGj5dM1We08jDPVqcCjpyz1dW-P51E8oDu4Y.jpg?width=320&amp;crop=smart&amp;auto=webp&amp;s=a71c48335df63c176dadd52f883e2504b70edfa6", "width": 320}, {"height": 152, "url": "https://external-preview.redd.it/CR1tMgcEGj5dM1We08jDPVqcCjpyz1dW-P51E8oDu4Y.jpg?width=640&amp;crop=smart&amp;auto=webp&amp;s=31bf3a46091eeaaed0ac09a18a358382c1858641", "width": 640}, {"height": 229, "url": "https://external-preview.redd.it/CR1tMgcEGj5dM1We08jDPVqcCjpyz1dW-P51E8oDu4Y.jpg?width=960&amp;crop=smart&amp;auto=webp&amp;s=bf9eed7037c16d416d760d932313374b32b0fb33", "width": 960}, {"height": 258, "url": "https://external-preview.redd.it/CR1tMgcEGj5dM1We08jDPVqcCjpyz1dW-P51E8oDu4Y.jpg?width=1080&amp;crop=smart&amp;auto=webp&amp;s=abd9040a2fa07e07008457063be52b425a95aef8", "width": 1080}], "source": {"height": 361, "url": "https://external-preview.redd.it/CR1tMgcEGj5dM1We08jDPVqcCjpyz1dW-P51E8oDu4Y.jpg?auto=webp&amp;s=5568fda33388504671590221b02b7265a3c7064f", "width": 1511}, "variants": {}}]}, "pwls": 6, "retrieved_on": 1608748304, "score": 1, "selftext": "Disclaimer: I originally posted this in r/securityanalysis yesterday and received some responses. I am reposting it here to a bigger audience, with an added section to respond to some of the questions I received. I am hoping that by reposting on here, we can get more a discussion. I am not too familiar with reddit as I typically post on smaller value investing forums, and it is first time posting there. I plan to long in this company as I see the long term position of the company's growth in the health care sector. This is a minor position (5%) in what is a concentrated (10-15 company) portfolio.\n\n**PFMT- Performant Financial**  \n**Overview:**  \nPFMT is a technology-based provider of audit, recovery, payment accuracy, coordination of benefits (COB), and outsource services in the United States. PFMT analyze claims, identify, prevent and correct inaccurate payments. Using their proprietary analytics platform and industry expertise, PFMT aim to reduce losses on billions of dollars worth of improper healthcare payments, state/federal/and treasury tax delinquencies, defaulted student loans and other receivables. Primary customers include government commercial health plans, CMS, Blues plans, regional Insurers, private/commercial programs, etc that operate in complex and highly regulated environments that rely on PFMT's innovative and disruptive approach. Revenue is generated based on a percentage of validated recoveries for clients. Contracts are negotiated on case by case basis, fees may range from 10-30% of recoveries and the duration of contracts may last 3-5+ years. These are high margin, recurring revenue contracts, expected to provide multiple years of prolonged double digit growth.  \nThis is not a sexy business, quite boring in fact. However, a good investment should be boring. Hopefully you will also appreciate the new path management has coursed, and see the potential upside in this turnaround story.  \nHistorically, PFMT was known for its legacy business as a collection agency for student loans, federal/state tax delinquencies and other receivables. Since the taking over of student loan originations by the Federal government a decade ago, PFMTs student loan collections have seen a diminishing contribution to revenues over time. Currently, the student loans collection business accounts for about 22% of revenues. While \"Other\" legacy collections still account for about 26% of revenues. Growth in Other legacy collections has remained relatively flat over the years. A smaller business segment derives marginal revenues from first party call centers and licensing of hosted technology solutions to clients. ***The diamond in the rough refers to PFMT's up-and-coming*** ***healthcare*** ***business segment***, composed of claims auditing and eligibility reviews. After seeing losses in 2018/19 due to high ramp up costs and standard implementation time lags, this segment appears to be set for robust growth going forward. Management has been clear that from 2017-2019, adjusted EBITDA has witnessed a slowdown to reflect a period of transformation in the company to establish itself in the Healthcare space. Management has confidently reiterated their belief in successfully reaching a 2021 goal of achieving $200M revenue with 20% EBITDA margins, with double digit growth continuing for years to come.\n\n**Covid-19 Impact:**  \nThis year was shaping up to be a strong year for PFMT, as Q1 showed promising results that validated the new trajectory of the company. Unfortunately, Q2 and Q3 were impacted by the public health emergency related to Covid-19. The CARES act brought changes that affected the student loans collection segment. Student loan payments, interest accrual and involuntary collection of payments (wage garnishments) were originally suspended till September 30, 2020 but were extended till December 31, 2020. However, PFMT continued to generate student loan revenue for a number of months from existing in-process borrow rehabilitation agreements. Another impact of Covid came from existing healthcare audit customers that requested a short-term pause on PFMT activities. Mgmt has indicated these pauses have largely ended during the third quarter. To mitigate the impact of this temporary slowdown, mgmt had furloughed more than 500 employees which could result in savings of about $18 million. The company is now aggressively ramping up efforts (including hiring/recruiting). Mgmt anticipates the ramp up efforts to be properly reflected in revenue by Q1 of 2021.\n\n**Healthcare Business:**  \nThe healthcare platform has finally reached scale, accounting for the largest (and continually growing) contribution to PFMTs revenue. In Q3, the healthcare business generated $17.6M in revenue (48.5% of total revenues (refer to Figure 1 below to view a cut out from the latest 10-k)). That is a 20.5% increase on sequential basis and a 63% increase from the same period last year. Please refer to figure 2 below, to see the change in healthcare revenues over time. This segment will continue to grow as Mgmt has made it clear this will be a main focus for the company. Soon healthcare will be the primary source of revenue (50%++), leading to a market multiple re-rate.  \nHealthcare revenues over last 11 quarters:\n\nQ3 2020= $17.6M  \nQ2 2020= $14.6M  \nQ1 2020= $17.5M  \nQ4 2019=$14.3M  \nQ3 2019= $10.8M  \nQ2 2019= $9.3M  \nQ1 2019= $9M  \nQ4 2018= $9.9M  \nQ3 2018= $6.6M  \nQ2 2018= $6.1M  \nQ1 2018= $3.5M\n\n\\[Figure 1: Q3 Financial Highlight\\]([https://imgur.com/a/WlqPLjZ](https://imgur.com/a/WlqPLjZ))\n\n\\[Figure 2: PFMT Healthcare Revenues\\]([https://imgur.com/a/W1OtGXu](https://imgur.com/a/W1OtGXu))\n\n**Macro:**  \nThe macro environment indicates there should be tailwinds for the audit, recovery, payment accuracy and coordination of benefits outsourcing business solutions PFMT provides. According to the CMS, national healthcare expenditures are forecast to grow at 5.4% CAGR for the next 8 years. Reaching $6.8T by 2028. Despite efforts to reduce the amount of improper payments, error rates in the industry range from 6% in commercial to 14.9% in government plans. Healthcare spending growth is driven primarily by a combination of increasing enrollment and cost inflation. Given the current unemployment environment, we are witnessing a spike in Medicaid enrollment, which should continue to benefit the business via rising utilization and claims volumes. It is useful to note that there can be a lag of several months between Medicaid eligibility and resulting claims volumes. This indicates that a majority of the benefits from the current environment are still to come. Also, as private organizations and state governments are struggling with lower revenues and budget deficits, this could create an increased focus on cost containment strategies where PFMT could play a supporting function. PFMT mgmt sees a $200B+ healthcare TAM growing annually.  \n**Competitors:**  \nPFMT differentiates itself with its proprietary technology and customizable approach to each of their customers' needs. The space is mostly dominated by large, slow moving players, that lack flexibility and uniqueness in their approach. Major competitors include HMS Holdings Corp (HMSY-US, \\~\\~$3B mkt cap) and Cotiviti (acquired in mid-2018 for $4.9B). Contracts in this industry are limited, take time to implement and can last years. PFMT continues to build a moat around it's business by consistently winning, maintaining and being awarded new contracts. An example includes being re-awarded CMS recovery Audit Region 1 and being awarded the newly created Region 5. Thus, successfully showcasing PFMTs superior product and path to success in this space. PFMTs will continue to encroach on incumbents' healthcare market share as the market begins to realize the superiority of their technology and approach. Refer to Figure 3, below, for an image taken form the CMS website showing the audit region relative to competition. Figure 4 may help to visualize the healthcare insurance payment cycle, and where PFMT may offer value.  \n**Debt:**  \nOn Aug 2017, PFMT entered a credit agreement with an existing shareholder and customer, ECMC. As of September 30, 2020 PFMT has about $62M loan outstanding under this credit agreement. ECMC has been able to accumulate about 5.8M warrants in PFMT as part of the agreement (about 10% of outstanding shares) all at an average exercise price of $1.95. The effective interest rate was about 13.9% in the 1H 2020. The loan is classified as a current liability, with maturity in August 2021. However, PFMT has two one-year options to extend maturity.  \nPFMT currently (as of Sept 30,2020) has about $17.3M cash and equivalents on hand and is entering a period of FCF generation.  \nThe current low interest rate environment offers low hanging fruit for companies looking to refinance their loans at a lower rate. Reducing their loan rate to 5-8% could save up to $5.5M in annual interest expense.  \n**Timing/Technicals:**  \nAs the calendar approached their earnings announcement date (Nov 11), PFMT stock was trading around recent highs of $2. The stock started selling off aggressively into the earnings and significantly further following earnings (despite a very positive release). The selling pressure appears to have been caused by portfolio management layoffs at Invesco, a top holder. Public disclosure of these layoffs coincides with timing of initial selloff, and a recent 13G filing confirms the exited position. This should quell any fears holders and followers of this stock may have had, as the selling was not based on fundamental flaws in the company or a new short thesis. Invesco owned about 18% of PFMT. Following the recent pressure, it appears the stock is in extremely oversold territory. Since their exit, the average volume profile of the stock has improved significantly, making accumulating a position easier for both retail and institutional demand.  \n**Valuation:**  \nThe timing of Covid partially contributes to why the market overlooked this stock, as Q2 and Q3 earnings were impacted. To establish a fair EBITDA estimation for 2020, we will use Q1 results with a conservative bias. Q1 is most appropriate because it will give us the clearest picture of how the company was performing prior to the temporary impacts of Covid. Using Q1, EBITDA was $6.4M (after deducting stock compensation). Annualizing that amount will give us an EBITDA run rate of $25.6M. This is a conservative measure because we do not account for the impact of any potential interest rate savings or growth in the healthcare segment. Next we need to establish the enterprise value (EV= debt + mkt cap - cash). Which we use to calculate EV/EBITDA. Calculation below.  \nEBITDA= $25.6M  \nEnterprise Value (EV)= $62M (debt) + $41 (mkt cap) -$17.3M (Cash) = $85.7 M  \nEV/EBITDA= 3.3X  \nFully diluted share count of 59.7M o/s\n\nNow lets take a look at some Healthcare IT comparables. The first 7 are general comps, the bottom 3 are the most similar comps to PFMT. To clarify, HMSY is currently publicly trading and is a direct competitor to PFMT. In December 2019, HMSY acquired Accent (a coordination of benefits/payments accuracy unit of Intrado focused on commercial and Medicare Advantage payers) for $155M. Accent had generated about $50M of revenue during the 12 months ending october 2019 (vs PFMTs $150M revenues in 2019). Based on the transaction price, HMSY paid an estimated 11-12X EV/Ebitda on a TTM basis. COTV was acquired and taken private in 2018, it continues to be a direct competitor with PFMT. COTV operated in payment integrity and was acquired for $4.9B in mid 2018, an estimated EV/EBITDA multiple of 14-15X based on consensus 2019 estimates. Also, keep in mind that the average EV/EBITDA for S&amp;P companies in 2020 is about 14.5X.  \nHealthcare IT Peer Trading Comp Table  \n                        Mkt Cap  SHARES O/S           EV         EV/EBITDA\n\nHMSY              2,793   88.6M                   3,021 16.8X  \nCHNG              5,581 304.5M                10,237 11.2X  \nACN          173,423 661.1M              171,554 19X  \nADS                 3,466   49.6M                24,047 30.3X  \nHQY               5,013       77M                  5,803 27.2X  \nIQV                34,135  191.7M                45,733 19.5X  \nCERN            23,727 306.6M                24,167 14X\n\n                                                                    Average: 19.7X\n\nPFMT              40.5           59.7M                         86 3.3X  \n(fully diluted)\n\nMost Similar Comps:  \nCOTV                  4,900 (2019 est)                14.5X  \nAccess                 155 (Acquired by HMSY in 2019) 11-12X  \nHMSY              2,793 88.6M                   3,021 16.8X\n\n                                                                         Average: 14.3X  \n\\[Table 2\\]([https://imgur.com/a/MP4yZgi](https://imgur.com/a/MP4yZgi))\n\nThe market still largely views PFMT as a declining student loans collections firm. Yet growing beneath the surface is an attractive healthcare business. As this segment continues to grow the market will recognize the high quality recurring revenue, ability to scale, and increasingly healthcare-focused pure-play as a catalyst for a multiple rerate. Now using the comps above, I will provide 3 scenarios (best, base, worst case scenario) applying a discount to conservatively account for the micro-cap nature and higher leverage of PFMT.  \nIn the best case scenario, we apply a 14X EV/EBTDA ratio (rounded down from the most similar comparable peer average of 14.3X) which, on a fully diluted share basis, lead to a current price per share of $6.  \nIn the base case scenario, we take a couple of notches off the closest peer average and apply a 12X EV/EBITDA ratio. Resulting in a current target price of $5.15/share  \nIn the worst case scenario, we further take off two more notches from the most similar peer average to apply a 10X EV/EBITDA ratio. Resulting in a price of $4.29/share.  \nAlso, considering the existing ownership of the company. Parthenon investors, Prescott Group, Mill Road Capital are all large shareholders. It is not unreasonable to think that they pursue a more aggressive activist role in the company and set it up for sale at a premium. It is also possible that competitors recognize the massive discount of this up-and-coming threat, and decide to acquire PFMT before other market participants drive up the price making such a strategic acquisition far more expensive. All of which offer upside to existing shareholders.  \nAs we approach future quarters and results continue to support this positive narrative we should start to see investor appetite pick up for this name. Average daily volumes have quadrupled since Invesco's recent exiting has added to the freely trading shares, improving the liquidity profile of PFMT. These signals will start appearing on investor screens as they (professional small cap investors, value investors, quant investors, generalists, hedge funds, etc) look for new ideas. There is virtually zero sell-side coverage of this stock at the moment, this will likely change in the future. **Accumulating a position now, presents an opportunity for entry at basement level prices in a stock that has the potential to provide 500-700% upside.**\n\n*Thank you for taking the time to read my idea. Full disclosure, I am long PFMT. Feedback and criticism of this idea are encouraged. Always do your own due diligence. Ive included the sources used for this analysis in the links below.*  \n\\[***Figure 3.:*** *CMS RACs per region\\](*[*https://imgur.com/a/YWlHANZ*](https://imgur.com/a/YWlHANZ)*)*\n\n\\[***Figure 4:*** *Healthcare insurance payments explained\\](*[*https://imgur.com/a/sbrh5pZ*](https://imgur.com/a/sbrh5pZ)*)*  \n*Claim Submissions (Steps 1 + 2): After treating a patient, the healthcare provider submits a claim for reimbursement to the health insurer. The claim will include information on the diagnosis and treatment/procedure*  \n*Claim Adjudication (Step 3): The health plan conducts administrative checks (eg. validates provider information and patient eligibility/ coverage) and prices the claim using the providers contract/ fee schedule.*  \n*Pre-payment Review (Step 4): The payor will leverage internal tools, followed by third party/outsourced solutions (ie. PFMT offerings) to conduct payment accuracy analysis prior to payment. Errors (discrepancies between the submitted claim and the payors payment policies) are identified and corrected.*  \n*Claim Payment (Step 5 + 6): The health plan will reimburse the provider for the patient care and services rendered*  \n*Post-payment review (Step 7): The payor will again use internal tools, followed by third party solutions (PFMT) to evaluate prior payments with additional information that has become available (eg. clinical reviews). Payors will correct*\n\n**Part 2:** \n\n$PFMT hit $1 by EOD yesterday, as much as I would like to think that the prior write-up was a catalyst for PFMTs recent performance, it is more likely driven by some significant and recent industry developments.  This will be a short follow up summarizing the recent event and why I think it is important to the underlying thesis. Also, I will try to respond to the some of the questions received last night. Thank you to all who have engaged me. Hopefully we can continue this constructive dialogue around this investment idea. \n\nOn Monday morning (Dec 21), HMSY (a direct competitor of PFMT) announced it had agreed to be acquired by Gainwell Technologies for $3.4B. Gainwell is owned by the private equity firm Veritas Capital. In March 2020, DXC Technologies announced the sale of their Government Healthcare business segment for $5B in cash to Veritas which renamed this new segment: Gainwell Technologies. Prior to acquiring this segment from DXC, this healthcare business was generating $1.5B in annual revenues, growing double digits year over year with 20% margins (inline with industry standard and PFMTs 2021 margin goal). The transaction values HMSY at 16-17X forward 2021 EV/EBITDA.  From what I gather, this is above most consensus estimates but still seems to be a fair price. A reminder that Veritas also acquired Cotiviti (COTV) in 2018 at a slightly lower valuation of 14-16X EV/EBITDA. The willingness to pay a premium relative to their COTV recent transaction indicates growing opportunity in the space.\n\nVeritas intends on breaking up the various HMSY segments and redistributing them among its portfolio companies COTV and Gainwell. COTV will take on the payment integrity and population health management business while Gainwell will take on the Medicade, Coordination of benefits/third party liability services business. Strategically, Veritas is able to secure HMSY's valuable set of data assets in the Medicaid market, and gaining exposure to the potentially higher EBITDA in 2021 due to the positive recent Medicaid enrollment trend. However, HMSY has been under pressure for failing to deliver predictable results and underperformance in some segments (particularly their population health management business). This inherent volatility in the revenue model is a burden on these companies (including PFMT) as it masks longer term growth and margin expansion potential. \n\nThough FTC concerns don’t appear to be an issue. It is uncertain to me what this new Veritas combination will mean for their Medicare RAC regions. As HMSY has one region and COTV has two. I believe there is a program limit of two regions per vendor. This could prove to be an obstacle for the new entity.  Also the inherent culture clash in executing large mergers typically leads to significant employee turnover and loss of talent. In such a niche industry, I would imagine the labor market is tight and any brain drain could hurt the new entity. In fact, a basic linkedin search of these companies indicates a recent influx of talent from large competitors into PFMT. If industry incumbents, particularly experienced sales people, are realizing PFMT has a superior platform relative to the large slow moving competition then this should be another positive signal reinforcing PFMTs trajectory. Discount this as anecdotal investigative evidence but I think it has merit.\n\nThe continuing theme of consolidation in this particular area of Healthcare IT highlights the large market opportunity across cost-containment and solutions services.\n\nRecent transactions:\n\nAccess acquired by HMSY in 2018 at 11-12X EV/EBITDA\n\nDXC HC segment acquired by Veritas/Gainwell \n\nCOTV acquired by Veritas at 14-15X\n\nHMSY acquired by Veritas at 16-17X\n\n&amp;#x200B;\n\nThis all bodes well for PFMT, as it solidifies my view that this turnaround story is not being valued as an appropriate comp to its peers. If TODAY the market determines that HMSY is worth 16-17X EV/EBITDA, this supports my Base and Best Case Scenario of valuing PFMT using a 12X ($5.15/share) and 14X ($6/share) multiple, respectively (accounting for microcap nature and leverage by reducing the multiple by a few notches).  The recent price improvement in PFMT appears to be driven by a recognition of PFMT being undervalued on a comparable basis. Volumes have improved in the last few sessions but the stock is still extremely undervalued. Likely some retail investors accumulating entry positions. Imagine if a small fund of $100 AUM identifies this stock as an ideal investment, decides to initiate a small 200 basis point position. It would require 2-3M shares. The stock was up 20% today after trading only 1M shares, accumulating supply for a single fund position will require a significant movement in price. Given the current valuation, this opportunity could soon hit the radar screens of multiple funds. The recent string of transactions will continue to attract attention to this space. Sooner or later someone will start kicking the tires on PFMT...\n\nResponses to recent questions and comments:\n\n 1. Is it possible that customers build/improve their internal tools to the point where they become threats to PFMT?\n\nGood question. Customers may marginally improve their ability to audit claims internally but not to the point of being a threat. It's important to understand that the solutions/services offered by PFMT, HMSY, COTV, etc require technology- heavy platforms that require significant amount of resources (financial and intellectual) to develop, once developed there are minimal incremental costs for higher volumes. These types of commitments are not usually within the realm of possibilities among the customer base.  The ever-changing complexity around these types of industries makes in-house billing departments ill-equipped to maximize value relative to specialists like PFMT. An example to illustrate such complexity would be the ongoing changes in the International Classification of Disease codes (ICD). When the WHO decided to change the medical classification codes of ICD9 to ICD10, it increased the number of procedure codes from 13,000 to 68,000. This is just one example of the type of nuance that will always provide opportunity for specialist support from a PFMT. \n\n2. Terms of the credit agreement and Why hasn’t management refinanced the Debt?\n\nFor anyone eager to learn more about the terms of the Credit Agreement, i would advise you read the latest 10k (link posted in my original report). The 10-k is helpful in clearly outlining all details. \n\nI think management is working towards refinancing the debt. But these are not things that can be negotiated or arranged immediately. It is possible that management wants/needs to have a certain number of consistent quarter over quarter improvement before they can renegotiate terms. In the current interest rate environment and following their recent turnaround progress, this low hanging fruit should be picked soon enough. \n\n&amp;#x200B;\n\n3.   Divesting legacy business?\n\nI would not be surprised to see parts of the legacy business sold off as the focus turns toward the growing health care business. I will continue monitoring management discussion on next earnings call for any evidence to support this.\n\n&amp;#x200B;\n\n4. PFMT is transitioning to focus on its healthcare business.\n\n Some commentators have referred to PFMT as a pure-play student loans collection firm which would be a false description. Student loans do not account for a majority of their revenues and management has made it clear their focus has changed towards a constantly growing healthcare industry. \n\n&amp;#x200B;\n\n5. Comparables mentioned are 100X larger than PFMT, why is that a fair comparison?\n\nThis is a reasonable observation. The answer to which is a function of numerous factors. The current market cap is significantly depressed as the popularity contest that IS the stock market is not identifying the value of this name. The stock was depressed further as a large holder just sold their 18% position, pushing the price near all-time lows. The huge gap in public market valuation is one of the reasons why this is a table pounding buy in my opinion. As this gap closes the difference in market cap will seem more acceptable. \n\nAlso, despite being small, the fact that PFMT is able to compete on the same level with these giants is a testament to its superior product and team: evidenced by their ability to secure two Medicare RAC region contracts (competing directly with COTV and HMSY), among other contacts won from incumbents. \n\n6. What is the moat/\"secret sauce\"?\n\nI am not a software engineer, nor do I have inner workings into PFMT's technology. Based on publicly available information, I can speculate that PFMT's disruptive technology refers its ability to differentiate itself over the competition. Competitors have been using a \"one-size-fits-all approach\" to their customers. PFMT uses their proprietary software to scrape data and yield higher rates of potential recoverable claims. Their solutions are more client-centric than the competition. As a smaller player they can be nimble, providing customized solutions to fulfill each client’s needs. For this reason they continue to be rewarded with new contracts taken from large incumbents. See the recent presentations (on their website) for quantitative case study examples.\n\nThese contracts are difficult to win, have long term time horizons.  The technology to service customers is unique and initially capital intensive to establish. Barriers to entry are significant.\n\n  \n**Sources:**  \n[https://www.performantcorp.com/investors/events-and-presentations/default.aspx](https://www.performantcorp.com/investors/events-and-presentations/default.aspx)  \n[https://www.sec.gov/cgi-bin/browse-edgar?CIK=1550695&amp;owner=exclude](https://www.sec.gov/cgi-bin/browse-edgar?CIK=1550695&amp;owner=exclude)  \n[https://www.cms.gov/Research-Statistics-Data-and-Systems/Monitoring-Programs/Medicare-FFS-Compliance-Programs/Recovery-Audit-Program](https://www.cms.gov/Research-Statistics-Data-and-Systems/Monitoring-Programs/Medicare-FFS-Compliance-Programs/Recovery-Audit-Program)  \n[https://www.cms.gov/Research-Statistics-Data-and-Systems/Statistics-Trends-and-Reports/NationalHealthExpendData/NationalHealthAccountsHistorical](https://www.cms.gov/Research-Statistics-Data-and-Systems/Statistics-Trends-and-Reports/NationalHealthExpendData/NationalHealthAccountsHistorical)", "send_replies": false, "spoiler": false, "stickied": false, "subreddit": "stocks", "subreddit_id": "t5_2qjfk", "subreddit_subscribers": 985586, "subreddit_type": "public", "thumbnail": "self", "title": "$PFMT Performant Financial: Boring Business but a Diamond in the Rough", "total_awards_received": 0, "treatment_tags": [], "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/stocks/comments/kiyfwx/pfmt_performant_financial_boring_business_but_a/", "whitelist_status": "all_ads", "wls": 6, "created": 1608744694.0}], [[], false, "ehtalo", null, [], null, "text", "t2_4jizxvt", false, false, [], false, false, 1581471103, "self.stocks", "https://www.reddit.com/r/stocks/comments/f2j1mq/cerner_cern_loses_one_of_their_biggest_client/", {}, "f2j1mq", true, false, false, false, true, true, false, "", [], "dark", "text", false, false, true, 3, 0, false, "all_ads", "/r/stocks/comments/f2j1mq/cerner_cern_loses_one_of_their_biggest_client/", false, 6, 1581471104, 1, "Saw this in the news today, intresting to see their recent stock surge even with the news coming out that they lost AdventHealth one of their biggest client. \n\n&amp;#x200B;\n\n [https://www.bizjournals.com/kansascity/news/2020/02/11/cerner-adventhealth-ehr-revenue-cycle-contract-end.html](https://www.bizjournals.com/kansascity/news/2020/02/11/cerner-adventhealth-ehr-revenue-cycle-contract-end.html)", true, false, false, "stocks", "t5_2qjfk", 490426, "public", "self", "Cerner (CERN) loses one of their biggest client today", 0, "https://www.reddit.com/r/stocks/comments/f2j1mq/cerner_cern_loses_one_of_their_biggest_client/", "all_ads", 6, 1581467503.0, {"all_awardings": [], "allow_live_comments": false, "author": "ehtalo", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_4jizxvt", "author_patreon_flair": false, "author_premium": false, "awarders": [], "can_mod_post": false, "contest_mode": false, "created_utc": 1581471103, "domain": "self.stocks", "full_link": "https://www.reddit.com/r/stocks/comments/f2j1mq/cerner_cern_loses_one_of_their_biggest_client/", "gildings": {}, "id": "f2j1mq", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 3, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/stocks/comments/f2j1mq/cerner_cern_loses_one_of_their_biggest_client/", "pinned": false, "pwls": 6, "retrieved_on": 1581471104, "score": 1, "selftext": "Saw this in the news today, intresting to see their recent stock surge even with the news coming out that they lost AdventHealth one of their biggest client. \n\n&amp;#x200B;\n\n [https://www.bizjournals.com/kansascity/news/2020/02/11/cerner-adventhealth-ehr-revenue-cycle-contract-end.html](https://www.bizjournals.com/kansascity/news/2020/02/11/cerner-adventhealth-ehr-revenue-cycle-contract-end.html)", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "stocks", "subreddit_id": "t5_2qjfk", "subreddit_subscribers": 490426, "subreddit_type": "public", "thumbnail": "self", "title": "Cerner (CERN) loses one of their biggest client today", "total_awards_received": 0, "url": "https://www.reddit.com/r/stocks/comments/f2j1mq/cerner_cern_loses_one_of_their_biggest_client/", "whitelist_status": "all_ads", "wls": 6, "created": 1581467503.0}], [[], false, "ehtalo", null, [], null, "text", "t2_4jizxvt", false, false, [], false, false, 1581437904, "self.stocks", "https://www.reddit.com/r/stocks/comments/f2akzp/cern_loses_biggest_client_to_rival_epic/", {}, "f2akzp", false, false, false, false, false, true, false, "", [], "dark", "text", false, false, true, 2, 0, false, "all_ads", "/r/stocks/comments/f2akzp/cern_loses_biggest_client_to_rival_epic/", false, 6, "moderator", 1581437907, 1, "[removed]", true, false, false, "stocks", "t5_2qjfk", 489900, "public", "self", "CERN - loses biggest client to rival epic", 0, "https://www.reddit.com/r/stocks/comments/f2akzp/cern_loses_biggest_client_to_rival_epic/", "all_ads", 6, 1581434304.0, {"all_awardings": [], "allow_live_comments": false, "author": "ehtalo", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_4jizxvt", "author_patreon_flair": false, "author_premium": false, "awarders": [], "can_mod_post": false, "contest_mode": false, "created_utc": 1581437904, "domain": "self.stocks", "full_link": "https://www.reddit.com/r/stocks/comments/f2akzp/cern_loses_biggest_client_to_rival_epic/", "gildings": {}, "id": "f2akzp", "is_crosspostable": false, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": false, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 2, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/stocks/comments/f2akzp/cern_loses_biggest_client_to_rival_epic/", "pinned": false, "pwls": 6, "removed_by_category": "moderator", "retrieved_on": 1581437907, "score": 1, "selftext": "[removed]", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "stocks", "subreddit_id": "t5_2qjfk", "subreddit_subscribers": 489900, "subreddit_type": "public", "thumbnail": "self", "title": "CERN - loses biggest client to rival epic", "total_awards_received": 0, "url": "https://www.reddit.com/r/stocks/comments/f2akzp/cern_loses_biggest_client_to_rival_epic/", "whitelist_status": "all_ads", "wls": 6, "created": 1581434304.0}], [[], false, "fnhic6", null, [], null, "text", "t2_4df52vns", false, false, [], false, false, 1579390378, "self.stocks", "https://www.reddit.com/r/stocks/comments/eqobyv/cern_cerner_healthcare/", {}, "eqobyv", true, false, false, false, true, true, false, "", [], "dark", "text", false, false, true, 5, 0, false, "all_ads", "/r/stocks/comments/eqobyv/cern_cerner_healthcare/", false, 6, 1579390379, 1, "Seeing lot good news about it.. did anyone invest? Planning to invest 10k. Is going to be biggest EMR provider", true, false, [], false, "stocks", "t5_2qjfk", 470695, "public", "self", "CERN cerner healthcare", 0, "https://www.reddit.com/r/stocks/comments/eqobyv/cern_cerner_healthcare/", "all_ads", 6, 1579386778.0, {"all_awardings": [], "allow_live_comments": false, "author": "fnhic6", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_4df52vns", "author_patreon_flair": false, "author_premium": false, "awarders": [], "can_mod_post": false, "contest_mode": false, "created_utc": 1579390378, "domain": "self.stocks", "full_link": "https://www.reddit.com/r/stocks/comments/eqobyv/cern_cerner_healthcare/", "gildings": {}, "id": "eqobyv", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 5, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/stocks/comments/eqobyv/cern_cerner_healthcare/", "pinned": false, "pwls": 6, "retrieved_on": 1579390379, "score": 1, "selftext": "Seeing lot good news about it.. did anyone invest? Planning to invest 10k. Is going to be biggest EMR provider", "send_replies": true, "spoiler": false, "steward_reports": [], "stickied": false, "subreddit": "stocks", "subreddit_id": "t5_2qjfk", "subreddit_subscribers": 470695, "subreddit_type": "public", "thumbnail": "self", "title": "CERN cerner healthcare", "total_awards_received": 0, "url": "https://www.reddit.com/r/stocks/comments/eqobyv/cern_cerner_healthcare/", "whitelist_status": "all_ads", "wls": 6, "created": 1579386778.0}], [[], false, "fnhic6", null, [], null, "text", "t2_4df52vns", false, false, [], false, false, 1579291489, "self.stocks", "https://www.reddit.com/r/stocks/comments/eq5m8y/cerner_cern/", {}, "eq5m8y", false, false, false, false, false, true, false, "", [], "dark", "text", false, false, true, 0, 0, false, "all_ads", "/r/stocks/comments/eq5m8y/cerner_cern/", false, 6, "moderator", 1579291495, 1, "[removed]", true, false, [], false, "stocks", "t5_2qjfk", 470031, "public", "self", "Cerner CERN", 0, "https://www.reddit.com/r/stocks/comments/eq5m8y/cerner_cern/", "all_ads", 6, 1579287889.0, {"all_awardings": [], "allow_live_comments": false, "author": "fnhic6", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_4df52vns", "author_patreon_flair": false, "author_premium": false, "awarders": [], "can_mod_post": false, "contest_mode": false, "created_utc": 1579291489, "domain": "self.stocks", "full_link": "https://www.reddit.com/r/stocks/comments/eq5m8y/cerner_cern/", "gildings": {}, "id": "eq5m8y", "is_crosspostable": false, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": false, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 0, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/stocks/comments/eq5m8y/cerner_cern/", "pinned": false, "pwls": 6, "removed_by_category": "moderator", "retrieved_on": 1579291495, "score": 1, "selftext": "[removed]", "send_replies": true, "spoiler": false, "steward_reports": [], "stickied": false, "subreddit": "stocks", "subreddit_id": "t5_2qjfk", "subreddit_subscribers": 470031, "subreddit_type": "public", "thumbnail": "self", "title": "Cerner CERN", "total_awards_received": 0, "url": "https://www.reddit.com/r/stocks/comments/eq5m8y/cerner_cern/", "whitelist_status": "all_ads", "wls": 6, "created": 1579287889.0}]]