[[[], false, "bigbear0083", null, [], null, "text", "t2_eaak0", false, false, [], false, false, 1606577360, "self.stocks", "https://www.reddit.com/r/stocks/comments/k2pigi/wall_street_week_ahead_for_the_trading_week/", {}, "k2pigi", true, false, false, false, true, true, false, "", "news", [], "866eb162-65e6-11e5-a903-1252b640afe9", "News", "dark", "text", false, false, true, 143, 0, false, "all_ads", "/r/stocks/comments/k2pigi/wall_street_week_ahead_for_the_trading_week/", false, "self", {"enabled": false, "images": [{"id": "lgLmrb7N3-_WrnK86sgkiR36NkrdinQ9bY7z7lTdeVg", "resolutions": [{"height": 66, "url": "https://external-preview.redd.it/IIlocleANyt5esKlOaUAwukVJiZCV0iOnHrepaADDFM.png?width=108&amp;crop=smart&amp;auto=webp&amp;s=9f9e914d80fceddf91d8552ad27716b6657a199e", "width": 108}, {"height": 133, "url": "https://external-preview.redd.it/IIlocleANyt5esKlOaUAwukVJiZCV0iOnHrepaADDFM.png?width=216&amp;crop=smart&amp;auto=webp&amp;s=07e71ef2eb966faffe8f0c87583df8d9ad047a6f", "width": 216}, {"height": 197, "url": "https://external-preview.redd.it/IIlocleANyt5esKlOaUAwukVJiZCV0iOnHrepaADDFM.png?width=320&amp;crop=smart&amp;auto=webp&amp;s=05f653b1d564b94bee0488d021192c0256ee97c3", "width": 320}, {"height": 395, "url": "https://external-preview.redd.it/IIlocleANyt5esKlOaUAwukVJiZCV0iOnHrepaADDFM.png?width=640&amp;crop=smart&amp;auto=webp&amp;s=db8095070022c807765f886fbcbb19393fa1f425", "width": 640}, {"height": 592, "url": "https://external-preview.redd.it/IIlocleANyt5esKlOaUAwukVJiZCV0iOnHrepaADDFM.png?width=960&amp;crop=smart&amp;auto=webp&amp;s=70c7c68ac914bdd4ff182cf329008c60a784dcaa", "width": 960}, {"height": 666, "url": "https://external-preview.redd.it/IIlocleANyt5esKlOaUAwukVJiZCV0iOnHrepaADDFM.png?width=1080&amp;crop=smart&amp;auto=webp&amp;s=55e1f29122496f0d3ec5d93b1fe470698548e734", "width": 1080}], "source": {"height": 761, "url": "https://external-preview.redd.it/IIlocleANyt5esKlOaUAwukVJiZCV0iOnHrepaADDFM.png?auto=webp&amp;s=5c7c5bd01ca479308d9be2030c0f70cd18acfc8e", "width": 1233}, "variants": {}}]}, 6, 1606577371, 1, "Good Saturday morning to all of you here on r/stocks. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning November 30th, 2020.\n\n# **Stocks on track to close out month of big gains as jobs data looms  - [(Source)](https://www.cnbc.com/2020/11/27/stocks-on-track-to-close-out-month-of-big-gains-next-week-as-jobs-data-looms.html)**\n*****\n&gt; Stocks next week will come off one of their best months ever into a busy week of economic data and the ongoing tensions between the spreading virus and positive news on vaccines and treatments.\n*****\n&gt; Another highlight of the week is expected to be Tuesday’s testimony from Fed Chairman Jerome Powell and Treasury Secretary Steven Mnuchin before the Senate Banking Committee. They will be discussing the emergency measures taken to help the economy after the outbreak of the pandemic.\n*****\n&gt; The Dow was up nearly 13% for November so far, and if it holds its gains into Monday’s close, it will chalk up its best month since January, 1987. The S&amp;P 500 closed at a record 3,638 and was up 11.3% for the month. The gain is its best performance since April’s 12.7%, which was the third best month for the S&amp;P 500 since its origin in 1957.\n*****\n&gt; November was a big month also for market rotation, with investors favoring stocks that would benefit from a rebounding economy and showing less love for long-held favorites among big tech and internet names. Financials were up more than 17% in the past month, and industrials rose nearly 15%, as investors bet vaccines would help the economy return to normal next year.\n*****\n&gt; Tech notched a single digit gain for the month so far and lagged the broader market. But some strategists expect big tech and internet names, stay-at-home stocks, to fare better in December.\n*****\n&gt; “The death of big tech has been announced over and over again, and we see that the market doesn’t abandon them, but in fact migrates to big tech whenever there are concerns,” said Quincy Krosby, chief market strategist at Prudential Financial. “The post-pandemic question is whether big tech can co-exist with the small and mid-cap.” Small caps were one of the biggest winners in November, with the Russell 2000, up 20.6%.\n*****\n&gt; “We did not see major selling in Nasdaq,” as investors put funds in cyclicals and value, she said. Nasdaq was up 11.9% for the month so far, slightly better than the S&amp;P 500.\n*****\n&gt; Experts have warned that there could an even bigger surge in virus cases, following the Thanksgiving holiday which could start to show up in the coming week. There have been more than 12.6 million cases in the U.S.\n*****\n&gt; # Jobs report\n&gt; There are some important economic reports in the week ahead, the most important being Friday’s November employment report. There is is also ISM manufacturing data Tuesday.\n*****\n&gt; “My thought here is the data is going to matter because if you listen to the Fed, and if you read through the Fed’s minutes, they’re in transition here. They’re becoming more concerned about the rise in Covid cases, certainly about the lack of fiscal support,” said Gregory Faranello, head of U.S. rates at AmeriVet Securities.\n*****\n&gt; Strategists say another key report will be weekly jobless claims, which showed an increase in each of the last two weeks. “The employment data clearly has been weakening,” said Faranello. If it continues, it will keep a lid on Treasury yields, which move opposite prices.\n*****\n&gt; Jefferies economist Tom Simons expects the elimination of Census Bureau workers to detract from the job gains in November, and he forecasts the economy added just 340,000 jobs.\n*****\n&gt; “It is hard to envision a particularly strong report coming out on Friday,” noted Simons.\n*****\n&gt; Bank of America economists forecast just 150,000 payrolls were added for November, compared to 638,000 in October. The private sector is expected to add 300,000, but expected government layoffs impacted total payrolls in their forecast.\n*****\n&gt; Faranello said he expects the bond market to be much more active than normal this December because of the pending change in the White House, as well as the runoff election in Georgia Jan. 5 that will decide whether Republicans keep their Senate majority. The market has also been concerned about the lack of stimulus from Washington.\n*****\n&gt; “The theme in the market right now is definitely hope and optimism versus the on the ground dynamic with Covid,” said Faranello. “The real question is can the vaccine rally hold up if we see the virus rise and we continue to see shutdowns. How does the market perform in light of that?”\n*****\n&gt; Krosby said she expects the market to watch for vaccine news. “The question I think is now whether or not we see the emergency authorization given to Pfizer and followed by Moderna,” she said. “I think that is a catalyst to the market because that is when you will start to see the vaccine distributed.” The Food and Drug Administration’s vaccine advisory committee has a meeting set for Dec. 10 to discuss emergency authorization for the Pfizer\n*****\n&gt; Analysts expect investors to continue to gravitate to value and cyclicals, since they could have the biggest gains compared to already high priced big tech. But tech is still attractive.\n*****\n&gt; “We still see the Nasdaq leading,” said Krosby. “Whereas we enjoyed the vaccine related boom in the market, the fact is that investors and and traders are looking for big tech names to give them that growth in earnings and revenues.”\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/ZTiIHZf.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/kSw4HNb.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/oXE2aJo.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/30Iefrr.png))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/TEArZTK.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/BzpCasV.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/2DhrB6V.png)**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/cRtEdkM.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/ShSvr9G.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/e5ILGPd.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK!](https://i.imgur.com/e5ILGPd.png))**\n\n*****\n\n&gt; # December Almanac: Small Caps Have Shined\n\n&gt; December is now the number three S&amp;P 500 and Dow Jones Industrials month since 1950, averaging gains of 1.5% on each index. It’s the top Russell 2000 (1979) month and third best for NASDAQ (1971) and Russell 1000 (1979). In 2018, DJIA suffered its worst December performance since 1931 and its fourth worst December going all the way back to 1901. However, the market rarely falls precipitously in December and a repeat of 2018 is not highly likely. When December is down it is usually a turning point in the market—near a top or bottom. If the market has experienced fantastic gains leading up to December, stocks can pullback in the first half of the month.\n\n&gt; In the last seventeen election years, December’s ranking changed modestly to #2 DJIA, #5 NASDAQ, but S&amp;P 500 remains #3. Small caps, measured by the Russell 2000, have had a field day in election-year Decembers. Since 1980, the Russell 2000 has lost ground just once in ten election years in December. The average small cap gain in all ten years is a solid 3.0%. The Russell 2000’s single loss was in 1980 when the Prime Rate was 21.5%.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://64.media.tumblr.com/a451723116af31d8c7273c588c33b6c8/950092ad30c7af73-09/s400x600/360e0edef191c0c34d744f4a5ecd32fd8845da9d.jpg))**\n\n*****\n\n&gt; # Sector Weights Rising and Falling\n\n&gt; For most of the past year, one significant trend on a sector by sector basis has been the outperformance of sectors like Technology and Consumer Discretionary. The relative strength lines of these sectors have consistently shown outperformance versus the rest of the S&amp;P 500 as a whole, but since August, other sectors have begun to take the wheel. As we noted in today's Sector Snapshot, just about every sector has had a banner month in November with some of the biggest month to date rallies of the past 30 years, but some sectors have seen much larger returns than others. One of the best examples of this has been Energy which has risen over 35% in November. Similarly, Financials has risen an astounding 19.5% this month compared to more modest but still significant rallies of around 10% from Tech and Consumer Discretionary. Given those large degrees of outperformance, the relative strength lines of Energy and Financials have taken a sharp turn higher in recent weeks. Similarly, they have seen a turnaround in their weightings in the S&amp;P 500 as shown in the charts below.\n\n&gt; Over the past three months, the Financial sector has gained a full percentage point weighting while the Technology sector has lost 1.36 percentage points with a decline in weighting in three straight months. For Financials, that is the largest gain in weighting in a three month span since January 2017. For Tech, outside of the reshuffling in 2018 that saw a large share of its weight change into Communication Services, the last time the sector lost this much or more in weighting in three months was November of 2008. Prior to this recent string of losing weight over the past three months, Tech had seen weight gain in every month from October of last year through August. Even though the weight loss has been significant, it has only put a dent in the increased share of the entirety of the past year as the sector's weight is only back down to where it was in May.\n\n&gt; Similarly, looking at the other sectors, while Financials have added a full percentage point in share over the past few months, that follows nine months of declines running from last December through August. That brings the sector's weighting back above 10% in the S&amp;P 500, but that is only at the highest level since March. Similarly, Materials and Industrials have also seen their weights rise for three and four months in a row, respectively. As for Energy, the 0.44 percentage point gain in November is set to snap six straight months of declines; the longest such streak since at least 1990. As with Financials, that turn around this month has only put a dent in the longer term trend of weight loss as Energy's weighting is now only back to its highest level since July. Opposite of Energy, Consumer Discretionary is on pace to lose weight for the first time since March.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/11/112720-Sector-Weights.png))**\n\n*****\n\n&gt; # A Month to Be Thankful For\n\n&gt; Heading into today with just three trading days left in November, the average Russell 1,000 stock was up 17.44% month to date. As shown below, not one of the five largest stocks is up even close to 17% on the month. For a market that had recently been driven higher in large part because of the five mega-cap Tech names, November has seen the mega-caps stall a bit while the rest of the market has seen broad participation. This is the type of breadth that market bulls have been waiting and hoping for.\n\n&gt; Of the 35 largest stocks in the Russell 1,000, Tesla (TSLA) is up the most so far this month with a gain of 43%. The other big winners include Chevron (CVX), JP Morgan (JPM), Bank of America (BAC), Disney (DIS), and Comcast (CMCSA). Not one stock in the top 35 is down on the month, but the ones that are up the least are Netflix (NFLX), Procter &amp; Gamble (PG), Amazon (AMZN), and Home Depot (HD).\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/11/largeststocks.png))**\n\n&gt; Looking at sectors, the average Energy stock in the Russell 1,000 is up 46% month-to-date but still down 27% year-to-date. Three other sectors have seen their stocks average MTD gains of more than 20%: Financials, Industrials, and Real Estate. Stocks in the Health Care and Utilities sectors are up the least on an average basis this month, but even these underperformers are still up more than 5%.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/11/avgpctchg.png))**\n\n&gt; There are 37 stocks in the Russell 1,000 up more than 50% so far in November. Below is a list of this month's biggest winners. Coty (COTY) and Nordstrom (JWN) stand out the most with gains of more than 100%, followed by Spirit AeroSystems (SPR), Occidental Petroleum (OXY), Diamondback Energy (FANG), and Empire State Realty (ESRT). The list of biggest winners this month is full of names that got hit hardest by COVID in areas like energy, travel, retail, and real estate. Notably, while these stocks are up an average of 68.5% in November, they're still down an average of 23% on the year. On a median basis, they're down even more year-to-date at -31.55%.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/11/best-mtd.png))**\n\n*****\n\n&gt; # Biden - Best Since Reagan\n\n&gt; The market started off November on a positive note, and even after the election has continued to add to its gains. Through the close today (11/24), the S&amp;P 500 is up 7.90% since the close on Election Day. Relative to every other Presidential election since the beginning of the S&amp;P back in 1928, the three-week performance of the S&amp;P 500 following this Election Day ranks as the second-best of all time. It came down right to the wire, but the only other US President to see a stronger market reaction to their election (or re-election) was Ronald Reagan in 1980 (7.97%). Behind Reagan and Biden, the only other Presidents where the S&amp;P 500 experienced an upside move of 5%+ in reaction to their elections were Hoover in 1928 and Clinton in 1996.\n\n&gt; On the downside, the most negative reaction of the market in the three weeks after Election Day was the 14.75% decline following President Obama's election in 2008. In addition to Obama, the S&amp;P 500's four other three-week downside moves of more than 5% came after the elections of Truman in 1948, the election of George W Bush in 2000 (although at the time it was unknown who was the winner of that election), the election of Franklin D Roosevelt in 1932, and Dwight D Eisenhower's re-election in 1956.\n\n&gt; In aggregate, the S&amp;P 500 hasn't historically responded all that great in the three weeks after a Presidential election. For every one since 1928, the median return of the S&amp;P 500 in the three weeks after Election Day has been a gain of just 0.35%. Breaking out returns by party, in the three weeks after a Democratic candidate is elected, the S&amp;P 500's median performance is a decline of 1.11% compared to a median gain of 3.04% when a Republican is elected.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/11/112420-President.png))**\n\n*****\n\n&gt; # DJIA 1,000 Point Thresholds\n\n&gt; What a wild year 2020 has been! With the DJIA closing above 30,000 today, it was the second first-time upside break of a 1,000 point threshold this year. While there have only been two new upside crosses of 1,000 point thresholds, due to the sharp pullback in March from the pandemic that briefly took the DJIA below 19,000 on a closing basis, there have actually been 12 different upside 1,000 point thresholds at some point in the year.\n\n&gt; The table below lists the first time that the DJIA closed above each 1,000 point threshold in its history along with the total number of times the index has crossed that level on a closing basis throughout history. The thousand point level that has seen the most crosses on a closing basis was 11,000 (87 crosses) while 10,000 ranks second at 67.\n\n&gt; Obviously, the higher the DJIA goes, the less impactful a move of 1,000 points becomes. At current levels, 1,000 points represents just 3.3%, which is really nothing more than a very bad day in the market. Given the diminishing impact of 1,000 points in the DJIA these days, their significance declines. Even still, the twelve new 1,000-point crosses since the 2016 election has given the President (who has publicly discussed the stock market more than any other President in history) plenty of ammunition to tweet about.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/11/112420-1000-Points-Threshold.png))**\n\n*****\n\n&gt; # 30,000 Reasons To Be Thankful\n\n&gt; As 2020 winds down, it has been an extremely tough year on all of us. Still, there are many reasons to be thankful and today we will share some reasons investors should be thankful.\n\n&gt; Stocks have had one of the largest reversals ever in 2020, something to be thankful for. In fact, this could be the first year ever to see the S&amp;P 500 down more than 30% peak-to-trough and finish higher.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/11/11.25.20-Revised-Chart-1.png?ssl=1))**\n\n&gt; We should also be thankful that Congress was split in 2020, likely marking the 11th consecutive year the S&amp;P 500 gained under a split Congress. Gridlock is good they tell us and that very well could be true yet again.\n\n&gt; Want something else to be thankful for? We likely will have a split Congress for another two years after the two Georgia runoffs are official.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/11/Blog-chart-2-11.25.20.png?ssl=1))**\n\n&gt; Let’s be thankful that it is looking like stocks once again will be higher the year a President is up for re-election. In fact, you have to go back to FDR in the ‘40s the last time the S&amp;P 500 was lower for the year when a President was up for re-election.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/11/blog-chart-3-11.25.20.png?ssl=1))**\n\n&gt; Let’s be thankful that the fastest bear market in history (only 16 days) is officially a thing of the past.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/11/Blog-chart-4-11.25.20.png?ssl=1))**\n\n&gt; We are thankful that we are in a new bull market, which if history plays out once again, could have a lot of life left to it. In fact, the average bull market has lasted more than five years.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/11/blog-chart-5-11.25.20.png?ssl=1))**\n\n&gt; “Let’s be thankful that the huge move off the March lows was a major clue of more strength,” explained LPL Financial Chief Market Strategist Ryan Detrick. “We noted at the time (many different ways) that the enormous move we saw off the March lows likely suggested significantly higher prices, while many ignored the market signals and instead looked for a re-test for months on end.”\n\n&gt; The 20-days off the March lows was the second best 20-day rally ever and sure enough, the returns have been very strong.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/11/blog-chart-6-11.25.20.png?ssl=1))**\n\n&gt; We are finally seeing many stocks participate in this bull market, another reason to be thankful. In fact, the Value Line Arithmetic Index recently made new all-time highs. This index is a great look at what the ‘average’ stock is doing and is a sign that this move isn’t being led by just a few large cap tech stocks.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/11/blog-chart-7-11.25.20.png?ssl=1))**\n\n&gt; Let’s be thankful that the NYSE Cumulative Advance/Decline line is at new highs. This looks at how many stocks are going up versus down and new highs are a sign of very healthy participation.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/11/Blog-chart-8-11.25.20.png?ssl=1))**\n\n&gt; Emerging markets have started to turn higher and we are thankful that this group could be on the verge of a major breakout to new highs, clearing their peak from 2007. As we move into ’21, this is one group we think could continue to do quite well for investors.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/11/Blog-chart-9-11.25.20.png?ssl=1))**\n\n&gt; Global investors should be thankful, as the MSCI Global Index broke out to new highs as well, suggesting this rally isn’t only about the US anymore.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/11/Blog-chart-10-11.25.20.png?ssl=1))**\n\n&gt; We upgraded our view on small caps in September and the Russell 2000 Index is currently on pace to have its best monthly return ever. Investors should be thankful that this group is finally participating, as there are many more small caps than large caps, another sign of improving breadth, while small caps are also more domestic by nature and could be suggesting a strong US economy next year.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/11/Blog-chart-11-11.25.20.png?ssl=1))**\n\n&gt; Investors should be thankful for the incredible strength around the election, as the S&amp;P 500 gained more than 1% four consecutive days. This is extremely rare, yet, extremely bullish going out a year.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/11/Blog-chart-12-11.25.20.png?ssl=1))**\n\n&gt; As we showed in Frothy Sentiment Rides Bullish Technicals, the huge number of stocks in the S&amp;P 500 making new monthly highs should make bulls quite thankful.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/11/Blog-chart-13-11.25.20.png?ssl=1))**\n\n&gt; Earnings are expected to see a major bounce back, as the global economy gets back online next year, making many investors quite thankful.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/11/Blog-chart-14-11.25.20.png?ssl=1))**\n\n&gt; Economic forecasts may not develop as predicted.\n\n&gt; As shown in the LPL Chart of the Day, the final reason to be thankful? Dow at 30,000!\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/11/11.25.20-Blog-Chart-15.png?ssl=1))**\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/ShSvr9G.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/MNeVkWY.png))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 11.30.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/K9YO8LE.png))\n\n&gt; # ***Monday 11.30.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK!](https://i.imgur.com/K07am7f.png))\n\n*****\n\n&gt; # ***Tuesday  12.1.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/mDMs2lS.png))\n\n&gt; # ***Tuesday 12.1.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/i1pDKHj.png))\n\n*****\n\n&gt; # ***Wednesday 12.2.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/VI1tdCh.png))\n\n&gt; # ***Wednesday 12.2.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/XXBd26p.png))\n\n*****\n\n&gt; # ***Thursday 12.3.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/XLmV1VW.png))\n\n&gt; # ***Thursday 12.3.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/RZQI60z.png))\n\n*****\n\n&gt; # ***Friday 12.4.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n*****\n\n&gt; # ***Friday 12.4.20 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n*****\n\n&gt; # Zoom Video Communications, Inc. $471.61\n**Zoom Video Communications, Inc. (ZM)** is confirmed to report earnings at approximately 4:05 PM ET on Monday, November 30, 2020. The consensus earnings estimate is $0.75 per share on revenue of $694.51 million and the Earnings Whisper ® number is $0.99 per share. Investor sentiment going into the company's earnings release has 80% expecting an earnings beat The company's guidance was for earnings of $0.73 to $0.74 per share on revenue of $685.00 million to $690.00 million. Consensus estimates are for year-over-year earnings growth of 971.43% with revenue increasing by 316.89%. The stock has drifted higher by 7.3% from its open following the earnings release to be 72.1% above its 200 day moving average of $274.11. Overall earnings estimates have been revised higher since the company's last earnings release. On Wednesday, November 18, 2020 there was some notable buying of 4,957 contracts of the $500.00 call expiring on Friday, December 4, 2020. Option traders are pricing in a 15.3% move on earnings and the stock has averaged a 15.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=ZM&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Salesforce $247.63\n**Salesforce (CRM)** is confirmed to report earnings at approximately 4:05 PM ET on Tuesday, December 1, 2020. The consensus earnings estimate is $0.75 per share on revenue of $5.25 billion and the Earnings Whisper ® number is $0.83 per share. Investor sentiment going into the company's earnings release has 80% expecting an earnings beat The company's guidance was for earnings of $0.73 to $0.74 per share. Consensus estimates are for year-over-year earnings growth of 25.00% with revenue increasing by 16.33%. Short interest has increased by 47.7% since the company's last earnings release while the stock has drifted lower by 1.7% from its open following the earnings release to be 23.9% above its 200 day moving average of $199.80. Overall earnings estimates have been revised higher since the company's last earnings release. On Wednesday, November 18, 2020 there was some notable buying of 8,759 contracts of the $260.00 call and 8,560 contracts of the $260.00 put expiring on Friday, December 18, 2020. Option traders are pricing in a 8.1% move on earnings and the stock has averaged a 6.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=CRM&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # At Home Group Inc. $19.14\n**At Home Group Inc. (HOME)** is confirmed to report earnings at approximately 4:05 PM ET on Tuesday, December 1, 2020. The consensus earnings estimate is $0.63 per share on revenue of $470.00 million and the Earnings Whisper ® number is $0.67 per share. Investor sentiment going into the company's earnings release has 55% expecting an earnings beat. Consensus estiamtes are for year-over-year revenue growth of 47.46%. Short interest has increased by 9.6% since the company's last earnings release while the stock has drifted higher by 4.8% from its open following the earnings release to be 93.5% above its 200 day moving average of $9.89. Overall earnings estimates have been revised higher since the company's last earnings release. On Tuesday, November 24, 2020 there was some notable buying of 522 contracts of the $18.00 call expiring on Friday, December 18, 2020. Option traders are pricing in a 13.7% move on earnings and the stock has averaged a 26.2% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=HOME&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # CrowdStrike, Inc. $150.83\n**CrowdStrike, Inc. (CRWD)** is confirmed to report earnings at approximately 4:05 PM ET on Wednesday, December 2, 2020. The consensus earnings estimate is $0.01 per share on revenue of $213.70 million and the Earnings Whisper ® number is $0.04 per share. Investor sentiment going into the company's earnings release has 80% expecting an earnings beat The company's guidance was for revenue of $211.00 million to $215.00 million. Consensus estimates are for year-over-year earnings growth of 111.11% with revenue increasing by 70.80%. Short interest has increased by 43.9% since the company's last earnings release while the stock has drifted higher by 15.1% from its open following the earnings release to be 51.8% above its 200 day moving average of $99.38. Overall earnings estimates have been revised lower since the company's last earnings release. On Thursday, November 12, 2020 there was some notable buying of 3,249 contracts of the $115.00 put expiring on Friday, June 18, 2021. Option traders are pricing in a 11.3% move on earnings and the stock has averaged a 10.7% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=CRWD&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # DocuSign $226.87\n**DocuSign (DOCU)** is confirmed to report earnings at approximately 4:05 PM ET on Thursday, December 3, 2020. The consensus earnings estimate is $0.14 per share on revenue of $360.38 million and the Earnings Whisper ® number is $0.19 per share. Investor sentiment going into the company's earnings release has 78% expecting an earnings beat The company's guidance was for revenue of $358.00 million to $362.00 million. Consensus estimates are for year-over-year earnings growth of 7.69% with revenue increasing by 44.44%. The stock has drifted lower by 3.0% from its open following the earnings release to be 38.6% above its 200 day moving average of $163.71. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, November 13, 2020 there was some notable buying of 6,534 contracts of the $180.00 call expiring on Friday, March 19, 2021. Option traders are pricing in a 10.6% move on earnings and the stock has averaged a 11.0% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=DOCU&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Dollar General Corporation $218.01\n**Dollar General Corporation (DG)** is confirmed to report earnings at approximately 6:55 AM ET on Thursday, December 3, 2020. The consensus earnings estimate is $1.97 per share on revenue of $8.00 billion and the Earnings Whisper ® number is $2.30 per share. Investor sentiment going into the company's earnings release has 68% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 38.73% with revenue increasing by 14.43%. Short interest has increased by 8.9% since the company's last earnings release while the stock has drifted higher by 5.8% from its open following the earnings release to be 16.1% above its 200 day moving average of $187.80. Overall earnings estimates have been revised higher since the company's last earnings release. On Thursday, November 19, 2020 there was some notable buying of 893 contracts of the $220.00 call expiring on Friday, December 4, 2020. Option traders are pricing in a 5.0% move on earnings and the stock has averaged a 5.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=DG&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Momo Inc. $15.12\n**Momo Inc. (MOMO)** is confirmed to report earnings at approximately 4:15 AM ET on Tuesday, December 1, 2020. The consensus earnings estimate is $0.38 per share on revenue of $542.76 million and the Earnings Whisper ® number is $0.42 per share. Investor sentiment going into the company's earnings release has 63% expecting an earnings beat The company's guidance was for revenue of $542.00 million to $557.00 million. Consensus estimates are for earnings to decline year-over-year by 43.28% with revenue decreasing by 12.85%. Short interest has decreased by 25.5% since the company's last earnings release while the stock has drifted lower by 16.7% from its open following the earnings release to be 22.7% below its 200 day moving average of $19.56. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, November 13, 2020 there was some notable buying of 4,128 contracts of the $19.00 call expiring on Friday, December 4, 2020. Option traders are pricing in a 12.4% move on earnings and the stock has averaged a 6.7% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=MOMO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Marvell Technology Group Ltd. $45.11\n**Marvell Technology Group Ltd. (MRVL)** is confirmed to report earnings at approximately 4:05 PM ET on Thursday, December 3, 2020. The consensus earnings estimate is $0.25 per share on revenue of $750.38 million and the Earnings Whisper ® number is $0.27 per share. Investor sentiment going into the company's earnings release has 78% expecting an earnings beat The company's guidance was for earnings of $0.22 to $0.28 per share on revenue of $712.00 million to $788.00 million. Consensus estimates are for year-over-year earnings growth of 47.06% with revenue increasing by 13.27%. Short interest has increased by 69.3% since the company's last earnings release while the stock has drifted higher by 22.7% from its open following the earnings release to be 36.9% above its 200 day moving average of $32.94. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, November 24, 2020 there was some notable buying of 13,018 contracts of the $50.00 call expiring on Friday, January 15, 2021. Option traders are pricing in a 7.2% move on earnings and the stock has averaged a 5.4% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=MRVL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Autohome Inc. $105.89\n**Autohome Inc. (ATHM)** is confirmed to report earnings at approximately 5:30 AM ET on Monday, November 30, 2020. The consensus earnings estimate is $1.08 per share on revenue of $326.75 million and the Earnings Whisper ® number is $1.10 per share. Investor sentiment going into the company's earnings release has 39% expecting an earnings beat The company's guidance was for revenue of $317.00 million to $323.00 million. Consensus estimates are for year-over-year earnings growth of 31.71% with revenue increasing by 7.62%. Short interest has decreased by 12.8% since the company's last earnings release while the stock has drifted higher by 20.5% from its open following the earnings release to be 25.3% above its 200 day moving average of $84.51. Overall earnings estimates have been revised higher since the company's last earnings release. On Tuesday, November 17, 2020 there was some notable buying of 1,382 contracts of the $90.00 put expiring on Friday, December 18, 2020. Option traders are pricing in a 8.6% move on earnings and the stock has averaged a 5.4% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=ATHM&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/stocks.", true, false, false, "stocks", "t5_2qjfk", 933258, "public", "self", "Wall Street Week Ahead for the trading week beginning November 30th, 2020", 0, [], 1.0, "https://www.reddit.com/r/stocks/comments/k2pigi/wall_street_week_ahead_for_the_trading_week/", "all_ads", 6, 1606573760.0, {"all_awardings": [], "allow_live_comments": false, "author": "bigbear0083", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_eaak0", "author_patreon_flair": false, "author_premium": false, "awarders": [], "can_mod_post": false, "contest_mode": false, "created_utc": 1606577360, "domain": "self.stocks", "full_link": "https://www.reddit.com/r/stocks/comments/k2pigi/wall_street_week_ahead_for_the_trading_week/", "gildings": {}, "id": "k2pigi", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_css_class": "news", "link_flair_richtext": [], "link_flair_template_id": "866eb162-65e6-11e5-a903-1252b640afe9", "link_flair_text": "News", "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 143, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/stocks/comments/k2pigi/wall_street_week_ahead_for_the_trading_week/", "pinned": false, "post_hint": "self", "preview": {"enabled": false, "images": [{"id": "lgLmrb7N3-_WrnK86sgkiR36NkrdinQ9bY7z7lTdeVg", "resolutions": [{"height": 66, "url": "https://external-preview.redd.it/IIlocleANyt5esKlOaUAwukVJiZCV0iOnHrepaADDFM.png?width=108&amp;crop=smart&amp;auto=webp&amp;s=9f9e914d80fceddf91d8552ad27716b6657a199e", "width": 108}, {"height": 133, "url": "https://external-preview.redd.it/IIlocleANyt5esKlOaUAwukVJiZCV0iOnHrepaADDFM.png?width=216&amp;crop=smart&amp;auto=webp&amp;s=07e71ef2eb966faffe8f0c87583df8d9ad047a6f", "width": 216}, {"height": 197, "url": "https://external-preview.redd.it/IIlocleANyt5esKlOaUAwukVJiZCV0iOnHrepaADDFM.png?width=320&amp;crop=smart&amp;auto=webp&amp;s=05f653b1d564b94bee0488d021192c0256ee97c3", "width": 320}, {"height": 395, "url": "https://external-preview.redd.it/IIlocleANyt5esKlOaUAwukVJiZCV0iOnHrepaADDFM.png?width=640&amp;crop=smart&amp;auto=webp&amp;s=db8095070022c807765f886fbcbb19393fa1f425", "width": 640}, {"height": 592, "url": "https://external-preview.redd.it/IIlocleANyt5esKlOaUAwukVJiZCV0iOnHrepaADDFM.png?width=960&amp;crop=smart&amp;auto=webp&amp;s=70c7c68ac914bdd4ff182cf329008c60a784dcaa", "width": 960}, {"height": 666, "url": "https://external-preview.redd.it/IIlocleANyt5esKlOaUAwukVJiZCV0iOnHrepaADDFM.png?width=1080&amp;crop=smart&amp;auto=webp&amp;s=55e1f29122496f0d3ec5d93b1fe470698548e734", "width": 1080}], "source": {"height": 761, "url": "https://external-preview.redd.it/IIlocleANyt5esKlOaUAwukVJiZCV0iOnHrepaADDFM.png?auto=webp&amp;s=5c7c5bd01ca479308d9be2030c0f70cd18acfc8e", "width": 1233}, "variants": {}}]}, "pwls": 6, "retrieved_on": 1606577371, "score": 1, "selftext": "Good Saturday morning to all of you here on r/stocks. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning November 30th, 2020.\n\n# **Stocks on track to close out month of big gains as jobs data looms  - [(Source)](https://www.cnbc.com/2020/11/27/stocks-on-track-to-close-out-month-of-big-gains-next-week-as-jobs-data-looms.html)**\n*****\n&gt; Stocks next week will come off one of their best months ever into a busy week of economic data and the ongoing tensions between the spreading virus and positive news on vaccines and treatments.\n*****\n&gt; Another highlight of the week is expected to be Tuesday’s testimony from Fed Chairman Jerome Powell and Treasury Secretary Steven Mnuchin before the Senate Banking Committee. They will be discussing the emergency measures taken to help the economy after the outbreak of the pandemic.\n*****\n&gt; The Dow was up nearly 13% for November so far, and if it holds its gains into Monday’s close, it will chalk up its best month since January, 1987. The S&amp;P 500 closed at a record 3,638 and was up 11.3% for the month. The gain is its best performance since April’s 12.7%, which was the third best month for the S&amp;P 500 since its origin in 1957.\n*****\n&gt; November was a big month also for market rotation, with investors favoring stocks that would benefit from a rebounding economy and showing less love for long-held favorites among big tech and internet names. Financials were up more than 17% in the past month, and industrials rose nearly 15%, as investors bet vaccines would help the economy return to normal next year.\n*****\n&gt; Tech notched a single digit gain for the month so far and lagged the broader market. But some strategists expect big tech and internet names, stay-at-home stocks, to fare better in December.\n*****\n&gt; “The death of big tech has been announced over and over again, and we see that the market doesn’t abandon them, but in fact migrates to big tech whenever there are concerns,” said Quincy Krosby, chief market strategist at Prudential Financial. “The post-pandemic question is whether big tech can co-exist with the small and mid-cap.” Small caps were one of the biggest winners in November, with the Russell 2000, up 20.6%.\n*****\n&gt; “We did not see major selling in Nasdaq,” as investors put funds in cyclicals and value, she said. Nasdaq was up 11.9% for the month so far, slightly better than the S&amp;P 500.\n*****\n&gt; Experts have warned that there could an even bigger surge in virus cases, following the Thanksgiving holiday which could start to show up in the coming week. There have been more than 12.6 million cases in the U.S.\n*****\n&gt; # Jobs report\n&gt; There are some important economic reports in the week ahead, the most important being Friday’s November employment report. There is is also ISM manufacturing data Tuesday.\n*****\n&gt; “My thought here is the data is going to matter because if you listen to the Fed, and if you read through the Fed’s minutes, they’re in transition here. They’re becoming more concerned about the rise in Covid cases, certainly about the lack of fiscal support,” said Gregory Faranello, head of U.S. rates at AmeriVet Securities.\n*****\n&gt; Strategists say another key report will be weekly jobless claims, which showed an increase in each of the last two weeks. “The employment data clearly has been weakening,” said Faranello. If it continues, it will keep a lid on Treasury yields, which move opposite prices.\n*****\n&gt; Jefferies economist Tom Simons expects the elimination of Census Bureau workers to detract from the job gains in November, and he forecasts the economy added just 340,000 jobs.\n*****\n&gt; “It is hard to envision a particularly strong report coming out on Friday,” noted Simons.\n*****\n&gt; Bank of America economists forecast just 150,000 payrolls were added for November, compared to 638,000 in October. The private sector is expected to add 300,000, but expected government layoffs impacted total payrolls in their forecast.\n*****\n&gt; Faranello said he expects the bond market to be much more active than normal this December because of the pending change in the White House, as well as the runoff election in Georgia Jan. 5 that will decide whether Republicans keep their Senate majority. The market has also been concerned about the lack of stimulus from Washington.\n*****\n&gt; “The theme in the market right now is definitely hope and optimism versus the on the ground dynamic with Covid,” said Faranello. “The real question is can the vaccine rally hold up if we see the virus rise and we continue to see shutdowns. How does the market perform in light of that?”\n*****\n&gt; Krosby said she expects the market to watch for vaccine news. “The question I think is now whether or not we see the emergency authorization given to Pfizer and followed by Moderna,” she said. “I think that is a catalyst to the market because that is when you will start to see the vaccine distributed.” The Food and Drug Administration’s vaccine advisory committee has a meeting set for Dec. 10 to discuss emergency authorization for the Pfizer\n*****\n&gt; Analysts expect investors to continue to gravitate to value and cyclicals, since they could have the biggest gains compared to already high priced big tech. But tech is still attractive.\n*****\n&gt; “We still see the Nasdaq leading,” said Krosby. “Whereas we enjoyed the vaccine related boom in the market, the fact is that investors and and traders are looking for big tech names to give them that growth in earnings and revenues.”\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/ZTiIHZf.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/kSw4HNb.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/oXE2aJo.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/30Iefrr.png))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/TEArZTK.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/BzpCasV.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/2DhrB6V.png)**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/cRtEdkM.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/ShSvr9G.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/e5ILGPd.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK!](https://i.imgur.com/e5ILGPd.png))**\n\n*****\n\n&gt; # December Almanac: Small Caps Have Shined\n\n&gt; December is now the number three S&amp;P 500 and Dow Jones Industrials month since 1950, averaging gains of 1.5% on each index. It’s the top Russell 2000 (1979) month and third best for NASDAQ (1971) and Russell 1000 (1979). In 2018, DJIA suffered its worst December performance since 1931 and its fourth worst December going all the way back to 1901. However, the market rarely falls precipitously in December and a repeat of 2018 is not highly likely. When December is down it is usually a turning point in the market—near a top or bottom. If the market has experienced fantastic gains leading up to December, stocks can pullback in the first half of the month.\n\n&gt; In the last seventeen election years, December’s ranking changed modestly to #2 DJIA, #5 NASDAQ, but S&amp;P 500 remains #3. Small caps, measured by the Russell 2000, have had a field day in election-year Decembers. Since 1980, the Russell 2000 has lost ground just once in ten election years in December. The average small cap gain in all ten years is a solid 3.0%. The Russell 2000’s single loss was in 1980 when the Prime Rate was 21.5%.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://64.media.tumblr.com/a451723116af31d8c7273c588c33b6c8/950092ad30c7af73-09/s400x600/360e0edef191c0c34d744f4a5ecd32fd8845da9d.jpg))**\n\n*****\n\n&gt; # Sector Weights Rising and Falling\n\n&gt; For most of the past year, one significant trend on a sector by sector basis has been the outperformance of sectors like Technology and Consumer Discretionary. The relative strength lines of these sectors have consistently shown outperformance versus the rest of the S&amp;P 500 as a whole, but since August, other sectors have begun to take the wheel. As we noted in today's Sector Snapshot, just about every sector has had a banner month in November with some of the biggest month to date rallies of the past 30 years, but some sectors have seen much larger returns than others. One of the best examples of this has been Energy which has risen over 35% in November. Similarly, Financials has risen an astounding 19.5% this month compared to more modest but still significant rallies of around 10% from Tech and Consumer Discretionary. Given those large degrees of outperformance, the relative strength lines of Energy and Financials have taken a sharp turn higher in recent weeks. Similarly, they have seen a turnaround in their weightings in the S&amp;P 500 as shown in the charts below.\n\n&gt; Over the past three months, the Financial sector has gained a full percentage point weighting while the Technology sector has lost 1.36 percentage points with a decline in weighting in three straight months. For Financials, that is the largest gain in weighting in a three month span since January 2017. For Tech, outside of the reshuffling in 2018 that saw a large share of its weight change into Communication Services, the last time the sector lost this much or more in weighting in three months was November of 2008. Prior to this recent string of losing weight over the past three months, Tech had seen weight gain in every month from October of last year through August. Even though the weight loss has been significant, it has only put a dent in the increased share of the entirety of the past year as the sector's weight is only back down to where it was in May.\n\n&gt; Similarly, looking at the other sectors, while Financials have added a full percentage point in share over the past few months, that follows nine months of declines running from last December through August. That brings the sector's weighting back above 10% in the S&amp;P 500, but that is only at the highest level since March. Similarly, Materials and Industrials have also seen their weights rise for three and four months in a row, respectively. As for Energy, the 0.44 percentage point gain in November is set to snap six straight months of declines; the longest such streak since at least 1990. As with Financials, that turn around this month has only put a dent in the longer term trend of weight loss as Energy's weighting is now only back to its highest level since July. Opposite of Energy, Consumer Discretionary is on pace to lose weight for the first time since March.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/11/112720-Sector-Weights.png))**\n\n*****\n\n&gt; # A Month to Be Thankful For\n\n&gt; Heading into today with just three trading days left in November, the average Russell 1,000 stock was up 17.44% month to date. As shown below, not one of the five largest stocks is up even close to 17% on the month. For a market that had recently been driven higher in large part because of the five mega-cap Tech names, November has seen the mega-caps stall a bit while the rest of the market has seen broad participation. This is the type of breadth that market bulls have been waiting and hoping for.\n\n&gt; Of the 35 largest stocks in the Russell 1,000, Tesla (TSLA) is up the most so far this month with a gain of 43%. The other big winners include Chevron (CVX), JP Morgan (JPM), Bank of America (BAC), Disney (DIS), and Comcast (CMCSA). Not one stock in the top 35 is down on the month, but the ones that are up the least are Netflix (NFLX), Procter &amp; Gamble (PG), Amazon (AMZN), and Home Depot (HD).\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/11/largeststocks.png))**\n\n&gt; Looking at sectors, the average Energy stock in the Russell 1,000 is up 46% month-to-date but still down 27% year-to-date. Three other sectors have seen their stocks average MTD gains of more than 20%: Financials, Industrials, and Real Estate. Stocks in the Health Care and Utilities sectors are up the least on an average basis this month, but even these underperformers are still up more than 5%.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/11/avgpctchg.png))**\n\n&gt; There are 37 stocks in the Russell 1,000 up more than 50% so far in November. Below is a list of this month's biggest winners. Coty (COTY) and Nordstrom (JWN) stand out the most with gains of more than 100%, followed by Spirit AeroSystems (SPR), Occidental Petroleum (OXY), Diamondback Energy (FANG), and Empire State Realty (ESRT). The list of biggest winners this month is full of names that got hit hardest by COVID in areas like energy, travel, retail, and real estate. Notably, while these stocks are up an average of 68.5% in November, they're still down an average of 23% on the year. On a median basis, they're down even more year-to-date at -31.55%.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/11/best-mtd.png))**\n\n*****\n\n&gt; # Biden - Best Since Reagan\n\n&gt; The market started off November on a positive note, and even after the election has continued to add to its gains. Through the close today (11/24), the S&amp;P 500 is up 7.90% since the close on Election Day. Relative to every other Presidential election since the beginning of the S&amp;P back in 1928, the three-week performance of the S&amp;P 500 following this Election Day ranks as the second-best of all time. It came down right to the wire, but the only other US President to see a stronger market reaction to their election (or re-election) was Ronald Reagan in 1980 (7.97%). Behind Reagan and Biden, the only other Presidents where the S&amp;P 500 experienced an upside move of 5%+ in reaction to their elections were Hoover in 1928 and Clinton in 1996.\n\n&gt; On the downside, the most negative reaction of the market in the three weeks after Election Day was the 14.75% decline following President Obama's election in 2008. In addition to Obama, the S&amp;P 500's four other three-week downside moves of more than 5% came after the elections of Truman in 1948, the election of George W Bush in 2000 (although at the time it was unknown who was the winner of that election), the election of Franklin D Roosevelt in 1932, and Dwight D Eisenhower's re-election in 1956.\n\n&gt; In aggregate, the S&amp;P 500 hasn't historically responded all that great in the three weeks after a Presidential election. For every one since 1928, the median return of the S&amp;P 500 in the three weeks after Election Day has been a gain of just 0.35%. Breaking out returns by party, in the three weeks after a Democratic candidate is elected, the S&amp;P 500's median performance is a decline of 1.11% compared to a median gain of 3.04% when a Republican is elected.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/11/112420-President.png))**\n\n*****\n\n&gt; # DJIA 1,000 Point Thresholds\n\n&gt; What a wild year 2020 has been! With the DJIA closing above 30,000 today, it was the second first-time upside break of a 1,000 point threshold this year. While there have only been two new upside crosses of 1,000 point thresholds, due to the sharp pullback in March from the pandemic that briefly took the DJIA below 19,000 on a closing basis, there have actually been 12 different upside 1,000 point thresholds at some point in the year.\n\n&gt; The table below lists the first time that the DJIA closed above each 1,000 point threshold in its history along with the total number of times the index has crossed that level on a closing basis throughout history. The thousand point level that has seen the most crosses on a closing basis was 11,000 (87 crosses) while 10,000 ranks second at 67.\n\n&gt; Obviously, the higher the DJIA goes, the less impactful a move of 1,000 points becomes. At current levels, 1,000 points represents just 3.3%, which is really nothing more than a very bad day in the market. Given the diminishing impact of 1,000 points in the DJIA these days, their significance declines. Even still, the twelve new 1,000-point crosses since the 2016 election has given the President (who has publicly discussed the stock market more than any other President in history) plenty of ammunition to tweet about.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/11/112420-1000-Points-Threshold.png))**\n\n*****\n\n&gt; # 30,000 Reasons To Be Thankful\n\n&gt; As 2020 winds down, it has been an extremely tough year on all of us. Still, there are many reasons to be thankful and today we will share some reasons investors should be thankful.\n\n&gt; Stocks have had one of the largest reversals ever in 2020, something to be thankful for. In fact, this could be the first year ever to see the S&amp;P 500 down more than 30% peak-to-trough and finish higher.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/11/11.25.20-Revised-Chart-1.png?ssl=1))**\n\n&gt; We should also be thankful that Congress was split in 2020, likely marking the 11th consecutive year the S&amp;P 500 gained under a split Congress. Gridlock is good they tell us and that very well could be true yet again.\n\n&gt; Want something else to be thankful for? We likely will have a split Congress for another two years after the two Georgia runoffs are official.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/11/Blog-chart-2-11.25.20.png?ssl=1))**\n\n&gt; Let’s be thankful that it is looking like stocks once again will be higher the year a President is up for re-election. In fact, you have to go back to FDR in the ‘40s the last time the S&amp;P 500 was lower for the year when a President was up for re-election.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/11/blog-chart-3-11.25.20.png?ssl=1))**\n\n&gt; Let’s be thankful that the fastest bear market in history (only 16 days) is officially a thing of the past.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/11/Blog-chart-4-11.25.20.png?ssl=1))**\n\n&gt; We are thankful that we are in a new bull market, which if history plays out once again, could have a lot of life left to it. In fact, the average bull market has lasted more than five years.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/11/blog-chart-5-11.25.20.png?ssl=1))**\n\n&gt; “Let’s be thankful that the huge move off the March lows was a major clue of more strength,” explained LPL Financial Chief Market Strategist Ryan Detrick. “We noted at the time (many different ways) that the enormous move we saw off the March lows likely suggested significantly higher prices, while many ignored the market signals and instead looked for a re-test for months on end.”\n\n&gt; The 20-days off the March lows was the second best 20-day rally ever and sure enough, the returns have been very strong.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/11/blog-chart-6-11.25.20.png?ssl=1))**\n\n&gt; We are finally seeing many stocks participate in this bull market, another reason to be thankful. In fact, the Value Line Arithmetic Index recently made new all-time highs. This index is a great look at what the ‘average’ stock is doing and is a sign that this move isn’t being led by just a few large cap tech stocks.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/11/blog-chart-7-11.25.20.png?ssl=1))**\n\n&gt; Let’s be thankful that the NYSE Cumulative Advance/Decline line is at new highs. This looks at how many stocks are going up versus down and new highs are a sign of very healthy participation.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/11/Blog-chart-8-11.25.20.png?ssl=1))**\n\n&gt; Emerging markets have started to turn higher and we are thankful that this group could be on the verge of a major breakout to new highs, clearing their peak from 2007. As we move into ’21, this is one group we think could continue to do quite well for investors.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/11/Blog-chart-9-11.25.20.png?ssl=1))**\n\n&gt; Global investors should be thankful, as the MSCI Global Index broke out to new highs as well, suggesting this rally isn’t only about the US anymore.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/11/Blog-chart-10-11.25.20.png?ssl=1))**\n\n&gt; We upgraded our view on small caps in September and the Russell 2000 Index is currently on pace to have its best monthly return ever. Investors should be thankful that this group is finally participating, as there are many more small caps than large caps, another sign of improving breadth, while small caps are also more domestic by nature and could be suggesting a strong US economy next year.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/11/Blog-chart-11-11.25.20.png?ssl=1))**\n\n&gt; Investors should be thankful for the incredible strength around the election, as the S&amp;P 500 gained more than 1% four consecutive days. This is extremely rare, yet, extremely bullish going out a year.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/11/Blog-chart-12-11.25.20.png?ssl=1))**\n\n&gt; As we showed in Frothy Sentiment Rides Bullish Technicals, the huge number of stocks in the S&amp;P 500 making new monthly highs should make bulls quite thankful.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/11/Blog-chart-13-11.25.20.png?ssl=1))**\n\n&gt; Earnings are expected to see a major bounce back, as the global economy gets back online next year, making many investors quite thankful.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/11/Blog-chart-14-11.25.20.png?ssl=1))**\n\n&gt; Economic forecasts may not develop as predicted.\n\n&gt; As shown in the LPL Chart of the Day, the final reason to be thankful? Dow at 30,000!\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/11/11.25.20-Blog-Chart-15.png?ssl=1))**\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/ShSvr9G.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/MNeVkWY.png))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 11.30.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/K9YO8LE.png))\n\n&gt; # ***Monday 11.30.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK!](https://i.imgur.com/K07am7f.png))\n\n*****\n\n&gt; # ***Tuesday  12.1.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/mDMs2lS.png))\n\n&gt; # ***Tuesday 12.1.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/i1pDKHj.png))\n\n*****\n\n&gt; # ***Wednesday 12.2.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/VI1tdCh.png))\n\n&gt; # ***Wednesday 12.2.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/XXBd26p.png))\n\n*****\n\n&gt; # ***Thursday 12.3.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/XLmV1VW.png))\n\n&gt; # ***Thursday 12.3.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/RZQI60z.png))\n\n*****\n\n&gt; # ***Friday 12.4.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n*****\n\n&gt; # ***Friday 12.4.20 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n*****\n\n&gt; # Zoom Video Communications, Inc. $471.61\n**Zoom Video Communications, Inc. (ZM)** is confirmed to report earnings at approximately 4:05 PM ET on Monday, November 30, 2020. The consensus earnings estimate is $0.75 per share on revenue of $694.51 million and the Earnings Whisper ® number is $0.99 per share. Investor sentiment going into the company's earnings release has 80% expecting an earnings beat The company's guidance was for earnings of $0.73 to $0.74 per share on revenue of $685.00 million to $690.00 million. Consensus estimates are for year-over-year earnings growth of 971.43% with revenue increasing by 316.89%. The stock has drifted higher by 7.3% from its open following the earnings release to be 72.1% above its 200 day moving average of $274.11. Overall earnings estimates have been revised higher since the company's last earnings release. On Wednesday, November 18, 2020 there was some notable buying of 4,957 contracts of the $500.00 call expiring on Friday, December 4, 2020. Option traders are pricing in a 15.3% move on earnings and the stock has averaged a 15.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=ZM&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Salesforce $247.63\n**Salesforce (CRM)** is confirmed to report earnings at approximately 4:05 PM ET on Tuesday, December 1, 2020. The consensus earnings estimate is $0.75 per share on revenue of $5.25 billion and the Earnings Whisper ® number is $0.83 per share. Investor sentiment going into the company's earnings release has 80% expecting an earnings beat The company's guidance was for earnings of $0.73 to $0.74 per share. Consensus estimates are for year-over-year earnings growth of 25.00% with revenue increasing by 16.33%. Short interest has increased by 47.7% since the company's last earnings release while the stock has drifted lower by 1.7% from its open following the earnings release to be 23.9% above its 200 day moving average of $199.80. Overall earnings estimates have been revised higher since the company's last earnings release. On Wednesday, November 18, 2020 there was some notable buying of 8,759 contracts of the $260.00 call and 8,560 contracts of the $260.00 put expiring on Friday, December 18, 2020. Option traders are pricing in a 8.1% move on earnings and the stock has averaged a 6.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=CRM&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # At Home Group Inc. $19.14\n**At Home Group Inc. (HOME)** is confirmed to report earnings at approximately 4:05 PM ET on Tuesday, December 1, 2020. The consensus earnings estimate is $0.63 per share on revenue of $470.00 million and the Earnings Whisper ® number is $0.67 per share. Investor sentiment going into the company's earnings release has 55% expecting an earnings beat. Consensus estiamtes are for year-over-year revenue growth of 47.46%. Short interest has increased by 9.6% since the company's last earnings release while the stock has drifted higher by 4.8% from its open following the earnings release to be 93.5% above its 200 day moving average of $9.89. Overall earnings estimates have been revised higher since the company's last earnings release. On Tuesday, November 24, 2020 there was some notable buying of 522 contracts of the $18.00 call expiring on Friday, December 18, 2020. Option traders are pricing in a 13.7% move on earnings and the stock has averaged a 26.2% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=HOME&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # CrowdStrike, Inc. $150.83\n**CrowdStrike, Inc. (CRWD)** is confirmed to report earnings at approximately 4:05 PM ET on Wednesday, December 2, 2020. The consensus earnings estimate is $0.01 per share on revenue of $213.70 million and the Earnings Whisper ® number is $0.04 per share. Investor sentiment going into the company's earnings release has 80% expecting an earnings beat The company's guidance was for revenue of $211.00 million to $215.00 million. Consensus estimates are for year-over-year earnings growth of 111.11% with revenue increasing by 70.80%. Short interest has increased by 43.9% since the company's last earnings release while the stock has drifted higher by 15.1% from its open following the earnings release to be 51.8% above its 200 day moving average of $99.38. Overall earnings estimates have been revised lower since the company's last earnings release. On Thursday, November 12, 2020 there was some notable buying of 3,249 contracts of the $115.00 put expiring on Friday, June 18, 2021. Option traders are pricing in a 11.3% move on earnings and the stock has averaged a 10.7% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=CRWD&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # DocuSign $226.87\n**DocuSign (DOCU)** is confirmed to report earnings at approximately 4:05 PM ET on Thursday, December 3, 2020. The consensus earnings estimate is $0.14 per share on revenue of $360.38 million and the Earnings Whisper ® number is $0.19 per share. Investor sentiment going into the company's earnings release has 78% expecting an earnings beat The company's guidance was for revenue of $358.00 million to $362.00 million. Consensus estimates are for year-over-year earnings growth of 7.69% with revenue increasing by 44.44%. The stock has drifted lower by 3.0% from its open following the earnings release to be 38.6% above its 200 day moving average of $163.71. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, November 13, 2020 there was some notable buying of 6,534 contracts of the $180.00 call expiring on Friday, March 19, 2021. Option traders are pricing in a 10.6% move on earnings and the stock has averaged a 11.0% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=DOCU&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Dollar General Corporation $218.01\n**Dollar General Corporation (DG)** is confirmed to report earnings at approximately 6:55 AM ET on Thursday, December 3, 2020. The consensus earnings estimate is $1.97 per share on revenue of $8.00 billion and the Earnings Whisper ® number is $2.30 per share. Investor sentiment going into the company's earnings release has 68% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 38.73% with revenue increasing by 14.43%. Short interest has increased by 8.9% since the company's last earnings release while the stock has drifted higher by 5.8% from its open following the earnings release to be 16.1% above its 200 day moving average of $187.80. Overall earnings estimates have been revised higher since the company's last earnings release. On Thursday, November 19, 2020 there was some notable buying of 893 contracts of the $220.00 call expiring on Friday, December 4, 2020. Option traders are pricing in a 5.0% move on earnings and the stock has averaged a 5.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=DG&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Momo Inc. $15.12\n**Momo Inc. (MOMO)** is confirmed to report earnings at approximately 4:15 AM ET on Tuesday, December 1, 2020. The consensus earnings estimate is $0.38 per share on revenue of $542.76 million and the Earnings Whisper ® number is $0.42 per share. Investor sentiment going into the company's earnings release has 63% expecting an earnings beat The company's guidance was for revenue of $542.00 million to $557.00 million. Consensus estimates are for earnings to decline year-over-year by 43.28% with revenue decreasing by 12.85%. Short interest has decreased by 25.5% since the company's last earnings release while the stock has drifted lower by 16.7% from its open following the earnings release to be 22.7% below its 200 day moving average of $19.56. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, November 13, 2020 there was some notable buying of 4,128 contracts of the $19.00 call expiring on Friday, December 4, 2020. Option traders are pricing in a 12.4% move on earnings and the stock has averaged a 6.7% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=MOMO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Marvell Technology Group Ltd. $45.11\n**Marvell Technology Group Ltd. (MRVL)** is confirmed to report earnings at approximately 4:05 PM ET on Thursday, December 3, 2020. The consensus earnings estimate is $0.25 per share on revenue of $750.38 million and the Earnings Whisper ® number is $0.27 per share. Investor sentiment going into the company's earnings release has 78% expecting an earnings beat The company's guidance was for earnings of $0.22 to $0.28 per share on revenue of $712.00 million to $788.00 million. Consensus estimates are for year-over-year earnings growth of 47.06% with revenue increasing by 13.27%. Short interest has increased by 69.3% since the company's last earnings release while the stock has drifted higher by 22.7% from its open following the earnings release to be 36.9% above its 200 day moving average of $32.94. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, November 24, 2020 there was some notable buying of 13,018 contracts of the $50.00 call expiring on Friday, January 15, 2021. Option traders are pricing in a 7.2% move on earnings and the stock has averaged a 5.4% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=MRVL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Autohome Inc. $105.89\n**Autohome Inc. (ATHM)** is confirmed to report earnings at approximately 5:30 AM ET on Monday, November 30, 2020. The consensus earnings estimate is $1.08 per share on revenue of $326.75 million and the Earnings Whisper ® number is $1.10 per share. Investor sentiment going into the company's earnings release has 39% expecting an earnings beat The company's guidance was for revenue of $317.00 million to $323.00 million. Consensus estimates are for year-over-year earnings growth of 31.71% with revenue increasing by 7.62%. Short interest has decreased by 12.8% since the company's last earnings release while the stock has drifted higher by 20.5% from its open following the earnings release to be 25.3% above its 200 day moving average of $84.51. Overall earnings estimates have been revised higher since the company's last earnings release. On Tuesday, November 17, 2020 there was some notable buying of 1,382 contracts of the $90.00 put expiring on Friday, December 18, 2020. Option traders are pricing in a 8.6% move on earnings and the stock has averaged a 5.4% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=ATHM&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/stocks.", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "stocks", "subreddit_id": "t5_2qjfk", "subreddit_subscribers": 933258, "subreddit_type": "public", "thumbnail": "self", "title": "Wall Street Week Ahead for the trading week beginning November 30th, 2020", "total_awards_received": 0, "treatment_tags": [], "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/stocks/comments/k2pigi/wall_street_week_ahead_for_the_trading_week/", "whitelist_status": "all_ads", "wls": 6, "created": 1606573760.0}], [[], false, "ghostofdreadmon", null, [], null, "text", "t2_71br269c", false, true, [], false, false, 1606351964, "self.stocks", "https://www.reddit.com/r/stocks/comments/k151qw/theme_park_stocks/", {}, "k151qw", true, false, false, false, true, true, false, "", "discussion", [], "8acd2324-65e6-11e5-a263-122ab0778f8b", "Discussion", "dark", "text", false, false, false, 0, 0, false, "all_ads", "/r/stocks/comments/k151qw/theme_park_stocks/", false, 6, 1606351974, 1, "When considering COVID recovery stocks, I often read about general entertainment including cruise ships and movie theaters but very rarely see much about theme park stocks. There are a few solid “pure park” stocks like $SEAS, $FUN and $SIX that have plenty of upside. Other “mixed” tickers include $DIS and $CMCSA.  On the OTC front is $PRKA. \n\nI’ve held these for almost a year and they are all posting solid gains ($PRKA is bar coding, but not volatile.)  \n\nIn the past 3 months, $SEAS (46.67%), $FUN (34.53%) and $SIX (58.57%) have delivered consistent returns for me and have balanced out red days in other sectors. $DIS (12.44%) and $CMCSA (16.25%) have yielded less, but they are also more diversified companies with stakes in film, television and streaming beyond the parks. (Percentages based on my portfolio.)\n\nTheme parks are a HUGE industry and, though the shut-downs have brought big losses, many properties have successfully re-opened, remained so, and are planning for a big year of new attractions and greater potential attendance in 2021. \n\nThis sector started to move substantially again around the beginning of November. Keep it in mind for investing. I’ve been glad to own a stake during the red days, I love the industry and I believe it to be a better bet than even cruise lines due to the seemingly successful mitigation of COVID-19 issues.  \n\nAnyone else out there going long now on theme parks?", true, false, false, "stocks", "t5_2qjfk", 927338, "public", "self", "Theme Park Stocks", 0, [], 1.0, "https://www.reddit.com/r/stocks/comments/k151qw/theme_park_stocks/", "all_ads", 6, 1606348364.0, {"all_awardings": [], "allow_live_comments": false, "author": "ghostofdreadmon", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_71br269c", "author_patreon_flair": false, "author_premium": true, "awarders": [], "can_mod_post": false, "contest_mode": false, "created_utc": 1606351964, "domain": "self.stocks", "full_link": "https://www.reddit.com/r/stocks/comments/k151qw/theme_park_stocks/", "gildings": {}, "id": "k151qw", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_css_class": "discussion", "link_flair_richtext": [], "link_flair_template_id": "8acd2324-65e6-11e5-a263-122ab0778f8b", "link_flair_text": "Discussion", "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": false, "num_comments": 0, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/stocks/comments/k151qw/theme_park_stocks/", "pinned": false, "pwls": 6, "retrieved_on": 1606351974, "score": 1, "selftext": "When considering COVID recovery stocks, I often read about general entertainment including cruise ships and movie theaters but very rarely see much about theme park stocks. There are a few solid “pure park” stocks like $SEAS, $FUN and $SIX that have plenty of upside. Other “mixed” tickers include $DIS and $CMCSA.  On the OTC front is $PRKA. \n\nI’ve held these for almost a year and they are all posting solid gains ($PRKA is bar coding, but not volatile.)  \n\nIn the past 3 months, $SEAS (46.67%), $FUN (34.53%) and $SIX (58.57%) have delivered consistent returns for me and have balanced out red days in other sectors. $DIS (12.44%) and $CMCSA (16.25%) have yielded less, but they are also more diversified companies with stakes in film, television and streaming beyond the parks. (Percentages based on my portfolio.)\n\nTheme parks are a HUGE industry and, though the shut-downs have brought big losses, many properties have successfully re-opened, remained so, and are planning for a big year of new attractions and greater potential attendance in 2021. \n\nThis sector started to move substantially again around the beginning of November. Keep it in mind for investing. I’ve been glad to own a stake during the red days, I love the industry and I believe it to be a better bet than even cruise lines due to the seemingly successful mitigation of COVID-19 issues.  \n\nAnyone else out there going long now on theme parks?", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "stocks", "subreddit_id": "t5_2qjfk", "subreddit_subscribers": 927338, "subreddit_type": "public", "thumbnail": "self", "title": "Theme Park Stocks", "total_awards_received": 0, "treatment_tags": [], "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/stocks/comments/k151qw/theme_park_stocks/", "whitelist_status": "all_ads", "wls": 6, "created": 1606348364.0}], [[], false, "picuron", null, [], null, "text", "t2_11ftnj", false, false, [], false, false, 1604884790, "self.stocks", "https://www.reddit.com/r/stocks/comments/jqnzvk/i_used_a_webscraper_and_python_to_compile_the/", {}, "jqnzvk", true, false, false, false, true, true, false, "", [], "dark", "text", false, false, true, 21, 0, false, "all_ads", "/r/stocks/comments/jqnzvk/i_used_a_webscraper_and_python_to_compile_the/", false, 6, 1604884801, 1, "The auto-mod will automatically remove my submission if I say the \"RMP\" words, but here are the results:\n\n&amp;#x200B;\n\n    OTHER STOCKS has an allocation of 33.75%\n    AAPL has an allocation of 7.56%\n    TSLA has an allocation of 5.94%\n    MSFT has an allocation of 5.75%\n    NVDA has an allocation of 3.5%\n    NIO has an allocation of 3.33%\n    VOO has an allocation of 3.29%\n    AMZN has an allocation of 3.11%\n    VTI has an allocation of 2.57%\n    QQQ has an allocation of 2.47%\n    AMD has an allocation of 2.35%\n    ICLN has an allocation of 1.38%\n    SQ has an allocation of 1.36%\n    CASH has an allocation of 1.27%\n    BABA has an allocation of 1.26%\n    FB has an allocation of 1.06%\n    DIS has an allocation of 1.06%\n    SPY has an allocation of 0.93%\n    XLK has an allocation of 0.88%\n    KO has an allocation of 0.66%\n    WMT has an allocation of 0.58%\n    VGT has an allocation of 0.58%\n    GOOGL has an allocation of 0.55%\n    V has an allocation of 0.53%\n    VT has an allocation of 0.44%\n    CRM has an allocation of 0.41%\n    A has an allocation of 0.4%\n    ETSY has an allocation of 0.4%\n    BYND has an allocation of 0.39%\n    MA has an allocation of 0.38%\n    T has an allocation of 0.33%\n    INTC has an allocation of 0.32%\n    JPM has an allocation of 0.31%\n    PINS has an allocation of 0.29%\n    SBUX has an allocation of 0.28%\n    SHOP has an allocation of 0.28%\n    CRWD has an allocation of 0.28%\n    RTX has an allocation of 0.27%\n    GOOG has an allocation of 0.24%\n    DAL has an allocation of 0.24%\n    JNJ has an allocation of 0.24%\n    MCD has an allocation of 0.24%\n    PYPL has an allocation of 0.22%\n    BAC has an allocation of 0.2%\n    CVX has an allocation of 0.19%\n    BRK.B has an allocation of 0.18%\n    GOLD has an allocation of 0.18%\n    EA has an allocation of 0.17%\n    WM has an allocation of 0.17%\n    PEP has an allocation of 0.16%\n    SWKS has an allocation of 0.16%\n    WFC has an allocation of 0.16%\n    AXP has an allocation of 0.15%\n    BA has an allocation of 0.15%\n    HD has an allocation of 0.15%\n    PFE has an allocation of 0.15%\n    COST has an allocation of 0.14%\n    LOW has an allocation of 0.14%\n    QCOM has an allocation of 0.14%\n    O has an allocation of 0.14%\n    IWF has an allocation of 0.14%\n    GE has an allocation of 0.13%\n    NFLX has an allocation of 0.13%\n    CHWY has an allocation of 0.13%\n    VUG has an allocation of 0.13%\n    XOM has an allocation of 0.12%\n    NKE has an allocation of 0.12%\n    FVRR has an allocation of 0.12%\n    CCL has an allocation of 0.11%\n    DE has an allocation of 0.11%\n    TWTR has an allocation of 0.1%\n    PLTR has an allocation of 0.1%\n    SEDG has an allocation of 0.1%\n    AVGO has an allocation of 0.09%\n    CAG has an allocation of 0.09%\n    DFS has an allocation of 0.09%\n    KR has an allocation of 0.09%\n    SPG has an allocation of 0.09%\n    SNE has an allocation of 0.09%\n    ABBV has an allocation of 0.08%\n    ATVI has an allocation of 0.08%\n    AMGN has an allocation of 0.08%\n    CSCO has an allocation of 0.08%\n    DOW has an allocation of 0.08%\n    PG has an allocation of 0.08%\n    RCL has an allocation of 0.08%\n    NOW has an allocation of 0.08%\n    TGT has an allocation of 0.08%\n    VZ has an allocation of 0.08%\n    TTD has an allocation of 0.08%\n    UBER has an allocation of 0.08%\n    ZM has an allocation of 0.08%\n    AAL has an allocation of 0.07%\n    HAS has an allocation of 0.07%\n    PPL has an allocation of 0.07%\n    UAL has an allocation of 0.07%\n    BMY has an allocation of 0.06%\n    CMCSA has an allocation of 0.06%\n    GM has an allocation of 0.06%\n    HON has an allocation of 0.06%\n    MPC has an allocation of 0.06%\n    NCLH has an allocation of 0.06%\n    REGN has an allocation of 0.06%\n    TTWO has an allocation of 0.06%\n    LULU has an allocation of 0.06%\n    FDX has an allocation of 0.05%\n    MU has an allocation of 0.05%\n    SNAP has an allocation of 0.05%\n    SONY has an allocation of 0.05%\n    BBY has an allocation of 0.04%\n    CVS has an allocation of 0.04%\n    EL has an allocation of 0.04%\n    KHC has an allocation of 0.04%\n    REG has an allocation of 0.04%\n    LUV has an allocation of 0.04%\n    VRTX has an allocation of 0.04%\n    VTV has an allocation of 0.04%\n    MO has an allocation of 0.03%\n    ADSK has an allocation of 0.03%\n    CDNS has an allocation of 0.03%\n    CI has an allocation of 0.03%\n    IBM has an allocation of 0.03%\n    MLM has an allocation of 0.03%\n    NEE has an allocation of 0.03%\n    ODFL has an allocation of 0.03%\n    ROST has an allocation of 0.03%\n    TXN has an allocation of 0.03%\n    ULTA has an allocation of 0.03%\n    UAA has an allocation of 0.03%\n    UNH has an allocation of 0.03%\n    ACB has an allocation of 0.03%\n    CGC has an allocation of 0.03%\n    ACN has an allocation of 0.02%\n    ADBE has an allocation of 0.02%\n    AMT has an allocation of 0.02%\n    CAT has an allocation of 0.02%\n    DUK has an allocation of 0.02%\n    F has an allocation of 0.02%\n    GPS has an allocation of 0.02%\n    HRL has an allocation of 0.02%\n    HPQ has an allocation of 0.02%\n    LMT has an allocation of 0.02%\n    L has an allocation of 0.02%\n    MGM has an allocation of 0.02%\n    STX has an allocation of 0.02%\n    UNP has an allocation of 0.02%\n    WYNN has an allocation of 0.02%\n    XRX has an allocation of 0.02%\n    MRNA has an allocation of 0.02%\n    IVV has an allocation of 0.02%\n    FNILX has an allocation of 0.02%\n    MMM has an allocation of 0.01%\n    ABT has an allocation of 0.01%\n    AFL has an allocation of 0.01%\n    AMAT has an allocation of 0.01%\n    CBRE has an allocation of 0.01%\n    CMA has an allocation of 0.01%\n    CTVA has an allocation of 0.01%\n    FANG has an allocation of 0.01%\n    DG has an allocation of 0.01%\n    EOG has an allocation of 0.01%\n    EQIX has an allocation of 0.01%\n    IT has an allocation of 0.01%\n    IP has an allocation of 0.01%\n    J has an allocation of 0.01%\n    LHX has an allocation of 0.01%\n    LDOS has an allocation of 0.01%\n    LEN has an allocation of 0.01%\n    LLY has an allocation of 0.01%\n    LYV has an allocation of 0.01%\n    MAR has an allocation of 0.01%\n    NOC has an allocation of 0.01%\n    PM has an allocation of 0.01%\n    PLD has an allocation of 0.01%\n    SLB has an allocation of 0.01%\n    SO has an allocation of 0.01%\n    SWK has an allocation of 0.01%\n    SYF has an allocation of 0.01%\n    TSN has an allocation of 0.01%\n    WBA has an allocation of 0.01%\n    XLNX has an allocation of 0.01%", true, false, false, "stocks", "t5_2qjfk", 900809, "public", "self", "I used a web-scraper and Python to compile the average portfolio of the quarterly thread:", 0, [], 1.0, "https://www.reddit.com/r/stocks/comments/jqnzvk/i_used_a_webscraper_and_python_to_compile_the/", "all_ads", 6, 1604881190.0, {"all_awardings": [], "allow_live_comments": false, "author": "picuron", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_11ftnj", "author_patreon_flair": false, "author_premium": false, "awarders": [], "can_mod_post": false, "contest_mode": false, "created_utc": 1604884790, "domain": "self.stocks", "full_link": "https://www.reddit.com/r/stocks/comments/jqnzvk/i_used_a_webscraper_and_python_to_compile_the/", "gildings": {}, "id": "jqnzvk", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 21, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/stocks/comments/jqnzvk/i_used_a_webscraper_and_python_to_compile_the/", "pinned": false, "pwls": 6, "retrieved_on": 1604884801, "score": 1, "selftext": "The auto-mod will automatically remove my submission if I say the \"RMP\" words, but here are the results:\n\n&amp;#x200B;\n\n    OTHER STOCKS has an allocation of 33.75%\n    AAPL has an allocation of 7.56%\n    TSLA has an allocation of 5.94%\n    MSFT has an allocation of 5.75%\n    NVDA has an allocation of 3.5%\n    NIO has an allocation of 3.33%\n    VOO has an allocation of 3.29%\n    AMZN has an allocation of 3.11%\n    VTI has an allocation of 2.57%\n    QQQ has an allocation of 2.47%\n    AMD has an allocation of 2.35%\n    ICLN has an allocation of 1.38%\n    SQ has an allocation of 1.36%\n    CASH has an allocation of 1.27%\n    BABA has an allocation of 1.26%\n    FB has an allocation of 1.06%\n    DIS has an allocation of 1.06%\n    SPY has an allocation of 0.93%\n    XLK has an allocation of 0.88%\n    KO has an allocation of 0.66%\n    WMT has an allocation of 0.58%\n    VGT has an allocation of 0.58%\n    GOOGL has an allocation of 0.55%\n    V has an allocation of 0.53%\n    VT has an allocation of 0.44%\n    CRM has an allocation of 0.41%\n    A has an allocation of 0.4%\n    ETSY has an allocation of 0.4%\n    BYND has an allocation of 0.39%\n    MA has an allocation of 0.38%\n    T has an allocation of 0.33%\n    INTC has an allocation of 0.32%\n    JPM has an allocation of 0.31%\n    PINS has an allocation of 0.29%\n    SBUX has an allocation of 0.28%\n    SHOP has an allocation of 0.28%\n    CRWD has an allocation of 0.28%\n    RTX has an allocation of 0.27%\n    GOOG has an allocation of 0.24%\n    DAL has an allocation of 0.24%\n    JNJ has an allocation of 0.24%\n    MCD has an allocation of 0.24%\n    PYPL has an allocation of 0.22%\n    BAC has an allocation of 0.2%\n    CVX has an allocation of 0.19%\n    BRK.B has an allocation of 0.18%\n    GOLD has an allocation of 0.18%\n    EA has an allocation of 0.17%\n    WM has an allocation of 0.17%\n    PEP has an allocation of 0.16%\n    SWKS has an allocation of 0.16%\n    WFC has an allocation of 0.16%\n    AXP has an allocation of 0.15%\n    BA has an allocation of 0.15%\n    HD has an allocation of 0.15%\n    PFE has an allocation of 0.15%\n    COST has an allocation of 0.14%\n    LOW has an allocation of 0.14%\n    QCOM has an allocation of 0.14%\n    O has an allocation of 0.14%\n    IWF has an allocation of 0.14%\n    GE has an allocation of 0.13%\n    NFLX has an allocation of 0.13%\n    CHWY has an allocation of 0.13%\n    VUG has an allocation of 0.13%\n    XOM has an allocation of 0.12%\n    NKE has an allocation of 0.12%\n    FVRR has an allocation of 0.12%\n    CCL has an allocation of 0.11%\n    DE has an allocation of 0.11%\n    TWTR has an allocation of 0.1%\n    PLTR has an allocation of 0.1%\n    SEDG has an allocation of 0.1%\n    AVGO has an allocation of 0.09%\n    CAG has an allocation of 0.09%\n    DFS has an allocation of 0.09%\n    KR has an allocation of 0.09%\n    SPG has an allocation of 0.09%\n    SNE has an allocation of 0.09%\n    ABBV has an allocation of 0.08%\n    ATVI has an allocation of 0.08%\n    AMGN has an allocation of 0.08%\n    CSCO has an allocation of 0.08%\n    DOW has an allocation of 0.08%\n    PG has an allocation of 0.08%\n    RCL has an allocation of 0.08%\n    NOW has an allocation of 0.08%\n    TGT has an allocation of 0.08%\n    VZ has an allocation of 0.08%\n    TTD has an allocation of 0.08%\n    UBER has an allocation of 0.08%\n    ZM has an allocation of 0.08%\n    AAL has an allocation of 0.07%\n    HAS has an allocation of 0.07%\n    PPL has an allocation of 0.07%\n    UAL has an allocation of 0.07%\n    BMY has an allocation of 0.06%\n    CMCSA has an allocation of 0.06%\n    GM has an allocation of 0.06%\n    HON has an allocation of 0.06%\n    MPC has an allocation of 0.06%\n    NCLH has an allocation of 0.06%\n    REGN has an allocation of 0.06%\n    TTWO has an allocation of 0.06%\n    LULU has an allocation of 0.06%\n    FDX has an allocation of 0.05%\n    MU has an allocation of 0.05%\n    SNAP has an allocation of 0.05%\n    SONY has an allocation of 0.05%\n    BBY has an allocation of 0.04%\n    CVS has an allocation of 0.04%\n    EL has an allocation of 0.04%\n    KHC has an allocation of 0.04%\n    REG has an allocation of 0.04%\n    LUV has an allocation of 0.04%\n    VRTX has an allocation of 0.04%\n    VTV has an allocation of 0.04%\n    MO has an allocation of 0.03%\n    ADSK has an allocation of 0.03%\n    CDNS has an allocation of 0.03%\n    CI has an allocation of 0.03%\n    IBM has an allocation of 0.03%\n    MLM has an allocation of 0.03%\n    NEE has an allocation of 0.03%\n    ODFL has an allocation of 0.03%\n    ROST has an allocation of 0.03%\n    TXN has an allocation of 0.03%\n    ULTA has an allocation of 0.03%\n    UAA has an allocation of 0.03%\n    UNH has an allocation of 0.03%\n    ACB has an allocation of 0.03%\n    CGC has an allocation of 0.03%\n    ACN has an allocation of 0.02%\n    ADBE has an allocation of 0.02%\n    AMT has an allocation of 0.02%\n    CAT has an allocation of 0.02%\n    DUK has an allocation of 0.02%\n    F has an allocation of 0.02%\n    GPS has an allocation of 0.02%\n    HRL has an allocation of 0.02%\n    HPQ has an allocation of 0.02%\n    LMT has an allocation of 0.02%\n    L has an allocation of 0.02%\n    MGM has an allocation of 0.02%\n    STX has an allocation of 0.02%\n    UNP has an allocation of 0.02%\n    WYNN has an allocation of 0.02%\n    XRX has an allocation of 0.02%\n    MRNA has an allocation of 0.02%\n    IVV has an allocation of 0.02%\n    FNILX has an allocation of 0.02%\n    MMM has an allocation of 0.01%\n    ABT has an allocation of 0.01%\n    AFL has an allocation of 0.01%\n    AMAT has an allocation of 0.01%\n    CBRE has an allocation of 0.01%\n    CMA has an allocation of 0.01%\n    CTVA has an allocation of 0.01%\n    FANG has an allocation of 0.01%\n    DG has an allocation of 0.01%\n    EOG has an allocation of 0.01%\n    EQIX has an allocation of 0.01%\n    IT has an allocation of 0.01%\n    IP has an allocation of 0.01%\n    J has an allocation of 0.01%\n    LHX has an allocation of 0.01%\n    LDOS has an allocation of 0.01%\n    LEN has an allocation of 0.01%\n    LLY has an allocation of 0.01%\n    LYV has an allocation of 0.01%\n    MAR has an allocation of 0.01%\n    NOC has an allocation of 0.01%\n    PM has an allocation of 0.01%\n    PLD has an allocation of 0.01%\n    SLB has an allocation of 0.01%\n    SO has an allocation of 0.01%\n    SWK has an allocation of 0.01%\n    SYF has an allocation of 0.01%\n    TSN has an allocation of 0.01%\n    WBA has an allocation of 0.01%\n    XLNX has an allocation of 0.01%", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "stocks", "subreddit_id": "t5_2qjfk", "subreddit_subscribers": 900809, "subreddit_type": "public", "thumbnail": "self", "title": "I used a web-scraper and Python to compile the average portfolio of the quarterly thread:", "total_awards_received": 0, "treatment_tags": [], "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/stocks/comments/jqnzvk/i_used_a_webscraper_and_python_to_compile_the/", "whitelist_status": "all_ads", "wls": 6, "created": 1604881190.0}], [[], false, "spacej3di", null, [], null, "text", "t2_kdm2ull", false, false, [], false, false, 1604351206, "self.stocks", "https://www.reddit.com/r/stocks/comments/jmw7pz/top_market_news_monday_nov_2_2020/", {}, "jmw7pz", true, false, false, false, true, true, false, "", "resources", [], "a376614c-65e6-11e5-b6e7-123c7cc7e97b", "Resources", "dark", "text", false, false, true, 0, 0, false, "all_ads", "/r/stocks/comments/jmw7pz/top_market_news_monday_nov_2_2020/", false, 6, 1604351217, 1, "**Value groups led gainers with growth groups lagging:**\n\n* IOCs, drillers, refiners led **energy** higher. **Materials** were up with chemicals, containerboard, precious metals miners strongest. **Industrials** finished ahead as machinery, building materials and E&amp;Cs were among the gainers though airlines weaker. **Financials** were higher with asset managers, insurance and consumer finance among the bright spots. **Healthcare** gained with hospitals and managed care better though biotech worse. **Consumer staples** outperformed on strength in beverages, food, and HPC spaces. **Tech** lagged on softness in semis, software, AAPL-US. **Consumer discretionary** underperformed on AMZN-US and department store losses along with mixed restaurant and cruiseline performance. **Communication services** underperforming with large media names lower (CMCSA-US, CHTR-US) and weakness in interactive names.\n\n**Pennsylvania, mail-in ballots dominating election headlines ahead of Tuesday:**\n\n* Biden's persistent lead in national polling taking a back seat to state data. NY Times/Siena College survey showed Biden 3 points ahead in Florida, 6 points ahead in Pennsylvania and Arizona, and 11 points ahead in Wisconsin ([The Hill](https://thehill.com/homenews/campaign-polls/523817-biden-holds-edge-in-four-key-battleground-states-poll)). [Washington Post/ABC News](https://www.washingtonpost.com/politics/2020/11/01/post-abc-polls-biden-has-slight-lead-pennsylvania-florida-toss-up/?arc404=true) poll showed Biden with a 7-point lead in Pennsylvania and Trump with a 2-point lead in Florida, while today's [Reuters/Ipsos](https://www.reuters.com/article/us-usa-election-battleground-poll/biden-leads-trump-narrowly-in-florida-on-eve-of-election-reuters-ipsos-idUSKBN27I2K2?il=0) and [Quinnipiac](https://poll.qu.edu/florida/release-detail?ReleaseID=3683) polls showed Biden with narrow edge in Florida. Final [NBC/Marist](https://www.nbcnews.com/politics/meet-the-press/final-nbc-marist-state-polls-show-close-races-pennsylvania-arizona-n1245775) poll shows a 5 point Biden lead in PA (and a tie in AZ). Multiple reports touched on the heightened importance of Pennsylvania ([Washington Post](https://www.washingtonpost.com/politics/democrats-anxiety-pennsylvania/2020/10/31/10536746-1b19-11eb-aeec-b93bcc29a01b_story.html), [NY Times](https://www.nytimes.com/2020/11/01/us/politics/trump-biden-campaign.html)). Mail-in ballots another big issue as millions still have not been received in battleground states ([WSJ](https://www.wsj.com/articles/millions-of-mail-in-ballots-at-risk-in-battleground-states-with-looming-deadlines-11604152801)) and could take days after election to count ([WSJ](https://www.wsj.com/articles/pennsylvanias-top-election-official-cautions-it-could-take-days-for-vote-count-11604235600?mod=newsviewer_click&amp;adobe_mc=MCMID%3D09548783887017160851294218779233119726%7CMCORGID%3DCB68E4BA55144CAA0A4C98A5%2540AdobeOrg%7CTS%3D1604242142)). While Trump denied [Axios](https://www.axios.com/trump-claim-election-victory-ballots-97eb12b9-5e35-402f-9ea3-0ccfb47f613f.html) report he would prematurely declare victory on election night, he signaled legal challenges to prevent ballots from being counted after election day ([The Hill](https://thehill.com/homenews/administration/523917-trump-denies-he-will-prematurely-declare-victory-signals-election)).\n\n**US coronavirus cases hit nearly 100K, Fauci warns country poorly positioned ahead of winter:**\n\n* US reported more than 89K coronavirus cases on Saturday, a decline from Friday's record high 99.3K infections. [CNBC](https://www.cnbc.com/2020/10/31/us-reports-record-99321-new-covid-cases-as-scientists-warn-of-difficult-winter-.html) noted cases growing by 5% or more 43 states as of Friday while seven-day average of new cases surged almost 25% over the last week to a record high of more than 78K. Seven-day average of hospitalizations also hit a record high in 18 states with the Midwest a particular area of concern. Colder weather, school and business reopenings, indoor gatherings of friends and families and general coronavirus fatigue all blamed. Health officials continue to sound the alarm with Dr. Fauci saying US could not possibly be positioned more poorly going into the winter and that an abrupt change was needed in the US public health response ([Washington Post](https://www.washingtonpost.com/politics/fauci-covid-winter-forecast/2020/10/31/e3970eb0-1b8b-11eb-bb35-2dcfdab0a345_story.html)). Fauci's comments were criticized by the White House and President Trump on Sunday suggested he may fire him after the election ([CNBC](https://www.cnbc.com/2020/11/02/trump-suggests-he-might-try-to-fire-fauci-after-the-election.html)).\n\n**ISM manufacturing index highest in over two years:**\n\n* **ISM Manufacturing Index** for October of 59.3 beat 56 estimate, up from prior month 55.4. New orders index up 7.7 at 67.9, production index up 2 at 63, employment index up 3.6 at 53.2, new export orders index up 1.4 at 55.7. Strongest reading since Sep-18 with manufacturers becoming more proficient at expanding output in light of Covid-related precautions. Elsewhere, October **IHS Markit final manufacturing PMI** of 53.4 slightly above flash reading of 53.3 and prior month 53.2. New orders and output accelerated though employment grew more slowly and export orders contracted for the first time since July. Business confidence remained historically subdued but picked up from September. Equipment makers stronger while consumer goods makers weaker. September **construction spending** of 0.3% m/m weaker than 1% expected and 0.8% prior reading.\n\n**UK latest European country to go back to lockdowns, NY state to require negative test for visitors:**\n\n* Fresh coronavirus mitigation measures continue to dominate the headlines with most of the focus on Europe. UK announced a second national lockdown that will begin on Thursday and last until 2-Dec. Pubs, bars, restaurants and non-essential retail across the nation will close, while people must stay at home unless they have a reason to leave ([BBC](https://www.streetaccount.com/ReferenceLinkHandler.axd?r=https%3a%2f%2fwww.bbc.co.uk%2fnews%2fuk-54763956&amp;iid=2902638&amp;ct=2&amp;uid=129)). Greece ([Reuters](https://www.reuters.com/article/us-health-coronavirus-austria/austria-orders-curfew-shutting-restaurants-to-fight-covid-surge-idUSKBN27G0NS?il=0)), Belgium ([Bloomberg](https://www.bloomberg.com/news/articles/2020-10-30/belgium-imposes-lockdown-to-avert-health-care-system-collapse)) and Austria ([Reuters](https://www.reuters.com/article/us-health-coronavirus-austria/austria-orders-curfew-shutting-restaurants-to-fight-covid-surge-idUSKBN27G0NS?il=0)) among the other countries that have also followed France and Germany in implementing new lockdown measures. In the US, NY state announced that it will require visitors from most of the country to test negative for the coronavirus and quarantine for three days after entry before taking a second test on the fourth day ([Bloomberg](https://www.bloomberg.com/news/articles/2020-10-31/new-york-sets-3-day-quarantine-for-visitors-who-test-negative?sref=L75TRUmI)). Governor of New Jersey warned that he won't rule out another lockdown to stem the rise in coronavirus cases ([The Hill](https://thehill.com/homenews/state-watch/523748-nj-governor-wont-rule-out-another-lockdown-amid-rising-covid-cases))\n\n**Global PMIs largely see sequential improvement in October:**\n\n* **China official manufacturing PMI** slipped to 51.4 in October from 51.5 in September but slightly better than the 51.3 consensus and representing the eighth straight month of expansion. In addition, **Caixin manufacturing PMI** improved to 53.6 from 52.8, better than the 52.8 consensus. Marked sixth straight month of expansion and highest reading in nearly a decade. **Japan manufacturing PMI** improved to 48.7 in final October reading from 48.0 flash and 47.7 in prior month though remained in contraction for a record 18th straight month. **Eurozone manufacturing PMI** revised up to 54.8 in final October reading, up from 54.4 flash and 53.7 in September and the best reading in 274 months. Germany a particular standout with fastest expansion in 31 months though press reports also highlighted risk from resurgence in coronavirus cases and accompanying lockdowns.\n\n**Big beat rates, high bar, unchanged themes and virus and election complications:**\n\n* Nearly 65% of the S&amp;P 500 has now reported Q3 results. According to [FactSet](https://www.factset.com/hubfs/Resources%20Section/Research%20Desk/Earnings%20Insight/EarningsInsight_103020.pdf), more than 86% have surpassed consensus earnings estimates, well above the 73% one- and five-year averages. In aggregate, companies are reporting earnings over 19% above expectations, much better than the 8.0% and 5.6% one- and five-year average positive surprise rates. Companies leveraged to at-home trends (work, learn, watch, eat) have reported some of the best results. Cloud, auto and housing exposure have provided a tailwind while Q3 has also seen a rebound in digital ad spending. Travel, cross-border and urban exposure have remained big headwinds. Post-earnings price action has been influenced a number of factors, including a high bar/expectations, sustainability and more macro-leaning influences such as worsening coronavirus trends and election uncertainty.\n\n**Fed focus likely to shift to asset purchase composition:**\n\n* [WSJ](https://www.wsj.com/articles/fed-turns-attention-to-asset-purchases-after-spelling-out-low-rate-pledges-11604226601) previewed this week's Fed meeting. Noted while Fed not expected to announce any changes, it could review plans to provide additional support. Most obvious move for the Fed would be to shift the composition of asset purchases toward longer-dated Treasuries. Pointed out that the Fed is buying $120B a month of Treasury and MBS, more than the $85B pace at which it purchased assets in QE3 between 2012 and 2014. However, while QE3 was focused on long-term securities, Fed is currently buying equal amounts of short-, medium- and long-term debt. However, article also discussed thoughts that shifting the composition of purchases may not do much at this point given long-term yields are already depressed. Perceived lack of urgency to adjust QE program played into some concerns about \"peak Fed\" coming out of the September FOMC meeting.", true, false, false, "stocks", "t5_2qjfk", 894871, "public", "self", "Top Market News - Monday, Nov. 2, 2020", 0, [], 1.0, "https://www.reddit.com/r/stocks/comments/jmw7pz/top_market_news_monday_nov_2_2020/", "all_ads", 6, 1604347606.0, {"all_awardings": [], "allow_live_comments": false, "author": "spacej3di", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_kdm2ull", "author_patreon_flair": false, "author_premium": false, "awarders": [], "can_mod_post": false, "contest_mode": false, "created_utc": 1604351206, "domain": "self.stocks", "full_link": "https://www.reddit.com/r/stocks/comments/jmw7pz/top_market_news_monday_nov_2_2020/", "gildings": {}, "id": "jmw7pz", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_css_class": "resources", "link_flair_richtext": [], "link_flair_template_id": "a376614c-65e6-11e5-b6e7-123c7cc7e97b", "link_flair_text": "Resources", "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 0, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/stocks/comments/jmw7pz/top_market_news_monday_nov_2_2020/", "pinned": false, "pwls": 6, "retrieved_on": 1604351217, "score": 1, "selftext": "**Value groups led gainers with growth groups lagging:**\n\n* IOCs, drillers, refiners led **energy** higher. **Materials** were up with chemicals, containerboard, precious metals miners strongest. **Industrials** finished ahead as machinery, building materials and E&amp;Cs were among the gainers though airlines weaker. **Financials** were higher with asset managers, insurance and consumer finance among the bright spots. **Healthcare** gained with hospitals and managed care better though biotech worse. **Consumer staples** outperformed on strength in beverages, food, and HPC spaces. **Tech** lagged on softness in semis, software, AAPL-US. **Consumer discretionary** underperformed on AMZN-US and department store losses along with mixed restaurant and cruiseline performance. **Communication services** underperforming with large media names lower (CMCSA-US, CHTR-US) and weakness in interactive names.\n\n**Pennsylvania, mail-in ballots dominating election headlines ahead of Tuesday:**\n\n* Biden's persistent lead in national polling taking a back seat to state data. NY Times/Siena College survey showed Biden 3 points ahead in Florida, 6 points ahead in Pennsylvania and Arizona, and 11 points ahead in Wisconsin ([The Hill](https://thehill.com/homenews/campaign-polls/523817-biden-holds-edge-in-four-key-battleground-states-poll)). [Washington Post/ABC News](https://www.washingtonpost.com/politics/2020/11/01/post-abc-polls-biden-has-slight-lead-pennsylvania-florida-toss-up/?arc404=true) poll showed Biden with a 7-point lead in Pennsylvania and Trump with a 2-point lead in Florida, while today's [Reuters/Ipsos](https://www.reuters.com/article/us-usa-election-battleground-poll/biden-leads-trump-narrowly-in-florida-on-eve-of-election-reuters-ipsos-idUSKBN27I2K2?il=0) and [Quinnipiac](https://poll.qu.edu/florida/release-detail?ReleaseID=3683) polls showed Biden with narrow edge in Florida. Final [NBC/Marist](https://www.nbcnews.com/politics/meet-the-press/final-nbc-marist-state-polls-show-close-races-pennsylvania-arizona-n1245775) poll shows a 5 point Biden lead in PA (and a tie in AZ). Multiple reports touched on the heightened importance of Pennsylvania ([Washington Post](https://www.washingtonpost.com/politics/democrats-anxiety-pennsylvania/2020/10/31/10536746-1b19-11eb-aeec-b93bcc29a01b_story.html), [NY Times](https://www.nytimes.com/2020/11/01/us/politics/trump-biden-campaign.html)). Mail-in ballots another big issue as millions still have not been received in battleground states ([WSJ](https://www.wsj.com/articles/millions-of-mail-in-ballots-at-risk-in-battleground-states-with-looming-deadlines-11604152801)) and could take days after election to count ([WSJ](https://www.wsj.com/articles/pennsylvanias-top-election-official-cautions-it-could-take-days-for-vote-count-11604235600?mod=newsviewer_click&amp;adobe_mc=MCMID%3D09548783887017160851294218779233119726%7CMCORGID%3DCB68E4BA55144CAA0A4C98A5%2540AdobeOrg%7CTS%3D1604242142)). While Trump denied [Axios](https://www.axios.com/trump-claim-election-victory-ballots-97eb12b9-5e35-402f-9ea3-0ccfb47f613f.html) report he would prematurely declare victory on election night, he signaled legal challenges to prevent ballots from being counted after election day ([The Hill](https://thehill.com/homenews/administration/523917-trump-denies-he-will-prematurely-declare-victory-signals-election)).\n\n**US coronavirus cases hit nearly 100K, Fauci warns country poorly positioned ahead of winter:**\n\n* US reported more than 89K coronavirus cases on Saturday, a decline from Friday's record high 99.3K infections. [CNBC](https://www.cnbc.com/2020/10/31/us-reports-record-99321-new-covid-cases-as-scientists-warn-of-difficult-winter-.html) noted cases growing by 5% or more 43 states as of Friday while seven-day average of new cases surged almost 25% over the last week to a record high of more than 78K. Seven-day average of hospitalizations also hit a record high in 18 states with the Midwest a particular area of concern. Colder weather, school and business reopenings, indoor gatherings of friends and families and general coronavirus fatigue all blamed. Health officials continue to sound the alarm with Dr. Fauci saying US could not possibly be positioned more poorly going into the winter and that an abrupt change was needed in the US public health response ([Washington Post](https://www.washingtonpost.com/politics/fauci-covid-winter-forecast/2020/10/31/e3970eb0-1b8b-11eb-bb35-2dcfdab0a345_story.html)). Fauci's comments were criticized by the White House and President Trump on Sunday suggested he may fire him after the election ([CNBC](https://www.cnbc.com/2020/11/02/trump-suggests-he-might-try-to-fire-fauci-after-the-election.html)).\n\n**ISM manufacturing index highest in over two years:**\n\n* **ISM Manufacturing Index** for October of 59.3 beat 56 estimate, up from prior month 55.4. New orders index up 7.7 at 67.9, production index up 2 at 63, employment index up 3.6 at 53.2, new export orders index up 1.4 at 55.7. Strongest reading since Sep-18 with manufacturers becoming more proficient at expanding output in light of Covid-related precautions. Elsewhere, October **IHS Markit final manufacturing PMI** of 53.4 slightly above flash reading of 53.3 and prior month 53.2. New orders and output accelerated though employment grew more slowly and export orders contracted for the first time since July. Business confidence remained historically subdued but picked up from September. Equipment makers stronger while consumer goods makers weaker. September **construction spending** of 0.3% m/m weaker than 1% expected and 0.8% prior reading.\n\n**UK latest European country to go back to lockdowns, NY state to require negative test for visitors:**\n\n* Fresh coronavirus mitigation measures continue to dominate the headlines with most of the focus on Europe. UK announced a second national lockdown that will begin on Thursday and last until 2-Dec. Pubs, bars, restaurants and non-essential retail across the nation will close, while people must stay at home unless they have a reason to leave ([BBC](https://www.streetaccount.com/ReferenceLinkHandler.axd?r=https%3a%2f%2fwww.bbc.co.uk%2fnews%2fuk-54763956&amp;iid=2902638&amp;ct=2&amp;uid=129)). Greece ([Reuters](https://www.reuters.com/article/us-health-coronavirus-austria/austria-orders-curfew-shutting-restaurants-to-fight-covid-surge-idUSKBN27G0NS?il=0)), Belgium ([Bloomberg](https://www.bloomberg.com/news/articles/2020-10-30/belgium-imposes-lockdown-to-avert-health-care-system-collapse)) and Austria ([Reuters](https://www.reuters.com/article/us-health-coronavirus-austria/austria-orders-curfew-shutting-restaurants-to-fight-covid-surge-idUSKBN27G0NS?il=0)) among the other countries that have also followed France and Germany in implementing new lockdown measures. In the US, NY state announced that it will require visitors from most of the country to test negative for the coronavirus and quarantine for three days after entry before taking a second test on the fourth day ([Bloomberg](https://www.bloomberg.com/news/articles/2020-10-31/new-york-sets-3-day-quarantine-for-visitors-who-test-negative?sref=L75TRUmI)). Governor of New Jersey warned that he won't rule out another lockdown to stem the rise in coronavirus cases ([The Hill](https://thehill.com/homenews/state-watch/523748-nj-governor-wont-rule-out-another-lockdown-amid-rising-covid-cases))\n\n**Global PMIs largely see sequential improvement in October:**\n\n* **China official manufacturing PMI** slipped to 51.4 in October from 51.5 in September but slightly better than the 51.3 consensus and representing the eighth straight month of expansion. In addition, **Caixin manufacturing PMI** improved to 53.6 from 52.8, better than the 52.8 consensus. Marked sixth straight month of expansion and highest reading in nearly a decade. **Japan manufacturing PMI** improved to 48.7 in final October reading from 48.0 flash and 47.7 in prior month though remained in contraction for a record 18th straight month. **Eurozone manufacturing PMI** revised up to 54.8 in final October reading, up from 54.4 flash and 53.7 in September and the best reading in 274 months. Germany a particular standout with fastest expansion in 31 months though press reports also highlighted risk from resurgence in coronavirus cases and accompanying lockdowns.\n\n**Big beat rates, high bar, unchanged themes and virus and election complications:**\n\n* Nearly 65% of the S&amp;P 500 has now reported Q3 results. According to [FactSet](https://www.factset.com/hubfs/Resources%20Section/Research%20Desk/Earnings%20Insight/EarningsInsight_103020.pdf), more than 86% have surpassed consensus earnings estimates, well above the 73% one- and five-year averages. In aggregate, companies are reporting earnings over 19% above expectations, much better than the 8.0% and 5.6% one- and five-year average positive surprise rates. Companies leveraged to at-home trends (work, learn, watch, eat) have reported some of the best results. Cloud, auto and housing exposure have provided a tailwind while Q3 has also seen a rebound in digital ad spending. Travel, cross-border and urban exposure have remained big headwinds. Post-earnings price action has been influenced a number of factors, including a high bar/expectations, sustainability and more macro-leaning influences such as worsening coronavirus trends and election uncertainty.\n\n**Fed focus likely to shift to asset purchase composition:**\n\n* [WSJ](https://www.wsj.com/articles/fed-turns-attention-to-asset-purchases-after-spelling-out-low-rate-pledges-11604226601) previewed this week's Fed meeting. Noted while Fed not expected to announce any changes, it could review plans to provide additional support. Most obvious move for the Fed would be to shift the composition of asset purchases toward longer-dated Treasuries. Pointed out that the Fed is buying $120B a month of Treasury and MBS, more than the $85B pace at which it purchased assets in QE3 between 2012 and 2014. However, while QE3 was focused on long-term securities, Fed is currently buying equal amounts of short-, medium- and long-term debt. However, article also discussed thoughts that shifting the composition of purchases may not do much at this point given long-term yields are already depressed. Perceived lack of urgency to adjust QE program played into some concerns about \"peak Fed\" coming out of the September FOMC meeting.", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "stocks", "subreddit_id": "t5_2qjfk", "subreddit_subscribers": 894871, "subreddit_type": "public", "thumbnail": "self", "title": "Top Market News - Monday, Nov. 2, 2020", "total_awards_received": 0, "treatment_tags": [], "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/stocks/comments/jmw7pz/top_market_news_monday_nov_2_2020/", "whitelist_status": "all_ads", "wls": 6, "created": 1604347606.0}], [[], false, "coolcomfort123", null, [], null, "text", "t2_2sj2vd1h", false, false, [], false, false, 1603034268, "self.stocks", "https://www.reddit.com/r/stocks/comments/jdi0m1/netflix_reports_earnings_and_subscribers_tuesday/", {}, "jdi0m1", true, false, false, false, true, true, false, "", [], "dark", "text", false, false, false, 0, 0, false, "all_ads", "/r/stocks/comments/jdi0m1/netflix_reports_earnings_and_subscribers_tuesday/", false, 6, 1603034279, 1, "Analysts are ratcheting up expectations for Netflix ￼ ahead of the company’s third-quarter-earnings report on Tuesday.\n\nThree months ago, Netflix (ticker: NFLX) set a low bar for its most important operating metric: net new subscriber adds. After gains of 15.8 million in the March quarter and 10.1 million in the June quarter, the company projected a gain of just 2.6 million for the September quarter, temporarily muffling bullish sentiment on the stock.\n\nSome analysts think the company was too conservative. Netflix’s guidance called for revenue of $6.3 billion and profits of $2.09 a share; Street consensus is a little higher at $6.4 billion and $2.13 a share, respectively. But subscribers drive this stock, and on that front, some on the Street see a potential blowout—although there are some offsetting factors this quarter, including the controversy around the French film “Cuties,” which some have criticized as child pornography. (As an aside: Ignore the haters. It’s a thoughtful examination of the pressures on tween girls from social media. Go ahead, watch it.)\n\nLast week, J.P. Morgan analyst Doug Anmuth took his estimate on net new subscribers up to 5.1 million from 3.1 million. On Wednesday, Goldman Sachs analyst Heath Terry lifted his forecast to 6 million subscribers, and boosted his target price to a Street-high $670 from $600. And on Friday, a flurry of other analysts weighed in.\n\nMorgan Stanley analyst Benjamin Swinburne repeated his Overweight rating, and lifted his target to $630 from $600. “We continue to see short- and long-term benefits to Netflix growth and earnings power due to the changes brought on by the pandemic,” he wrote in a research note. “The virtuous cycle of leading global distribution scale and rising investments in film, unscripted and local originals should create increasing and outsize returns.”\n\nSwinburne’s subscriber outlook for the quarter is a conservative 2.5 million. But he added the company this year should be free-cash-flow positive for the first time since it began building the streaming business.\n\nBofA Global Research analyst Nat Schindler on Friday repeated his Buy rating and raised his target to $670 from $575. He sees subscriber adds about in line with guidance, with some risk on that front from accelerated churn as a result of the controversy around “Cuties,” the return of live sports, and ongoing competition in streaming from Walt Disney ￼’s (DIS) Disney+, Comcast ￼’s (CMCSA) Peacock and others. But he added that any short-term issues on subscriber growth does not impact the long-term growth for Netflix. “We continue to see the acceleration in Netflix subscriber penetration in [the first half] as a permanent benefit,” he wrote. “Investors should view potential valuation volatility driven by near-term subscriber trends as a particularly attractive opportunity.”\n\nDeutsche Bank’s Bryan Kraft reiterated his Buy rating, taking his price target up to $570 from $525. “We believe Netflix is a long term structural winner, and while the valuation does not leave much room for multiple expansion, we believe a Q3 subscriber beat, followed by a strong Q4 and price increases, will reinforce the bull case for the stock, allowing it to grind higher over the next 12 months, and possibly work to some degree in the short term as well,” he wrote.\n\nMonness Crespi Hardt’s Brian White repeated his Buy rating and $600 target. He wrote that the company’s position has been meaningfully improved by the pandemic. “This crisis has clearly accelerated a natural secular trend that was already playing out; however, we are now watching important pillars of an American entertainment institution starting to wobble, the movie theater experience,” he wrote. “This destruction is occurring due to the extent of this pandemic, coming at a time when Netflix has developed a strong footing in original content and global scale. Sitting inside a dark, indoor movie theater with strangers during a pandemic is not most people’s idea of a good time. Moreover, this experience is more expensive and time consuming.” He took a conservative approach on subscriber adds, projecting 2.5 million.\n\nSource: Barron's", true, false, false, "stocks", "t5_2qjfk", 882394, "public", "self", "Netflix Reports Earnings and Subscribers Tuesday. Here’s What to Watch.", 0, [], 1.0, "https://www.reddit.com/r/stocks/comments/jdi0m1/netflix_reports_earnings_and_subscribers_tuesday/", "all_ads", 6, 1603030668.0, {"all_awardings": [], "allow_live_comments": false, "author": "coolcomfort123", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_2sj2vd1h", "author_patreon_flair": false, "author_premium": false, "awarders": [], "can_mod_post": false, "contest_mode": false, "created_utc": 1603034268, "domain": "self.stocks", "full_link": "https://www.reddit.com/r/stocks/comments/jdi0m1/netflix_reports_earnings_and_subscribers_tuesday/", "gildings": {}, "id": "jdi0m1", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": false, "num_comments": 0, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/stocks/comments/jdi0m1/netflix_reports_earnings_and_subscribers_tuesday/", "pinned": false, "pwls": 6, "retrieved_on": 1603034279, "score": 1, "selftext": "Analysts are ratcheting up expectations for Netflix ￼ ahead of the company’s third-quarter-earnings report on Tuesday.\n\nThree months ago, Netflix (ticker: NFLX) set a low bar for its most important operating metric: net new subscriber adds. After gains of 15.8 million in the March quarter and 10.1 million in the June quarter, the company projected a gain of just 2.6 million for the September quarter, temporarily muffling bullish sentiment on the stock.\n\nSome analysts think the company was too conservative. Netflix’s guidance called for revenue of $6.3 billion and profits of $2.09 a share; Street consensus is a little higher at $6.4 billion and $2.13 a share, respectively. But subscribers drive this stock, and on that front, some on the Street see a potential blowout—although there are some offsetting factors this quarter, including the controversy around the French film “Cuties,” which some have criticized as child pornography. (As an aside: Ignore the haters. It’s a thoughtful examination of the pressures on tween girls from social media. Go ahead, watch it.)\n\nLast week, J.P. Morgan analyst Doug Anmuth took his estimate on net new subscribers up to 5.1 million from 3.1 million. On Wednesday, Goldman Sachs analyst Heath Terry lifted his forecast to 6 million subscribers, and boosted his target price to a Street-high $670 from $600. And on Friday, a flurry of other analysts weighed in.\n\nMorgan Stanley analyst Benjamin Swinburne repeated his Overweight rating, and lifted his target to $630 from $600. “We continue to see short- and long-term benefits to Netflix growth and earnings power due to the changes brought on by the pandemic,” he wrote in a research note. “The virtuous cycle of leading global distribution scale and rising investments in film, unscripted and local originals should create increasing and outsize returns.”\n\nSwinburne’s subscriber outlook for the quarter is a conservative 2.5 million. But he added the company this year should be free-cash-flow positive for the first time since it began building the streaming business.\n\nBofA Global Research analyst Nat Schindler on Friday repeated his Buy rating and raised his target to $670 from $575. He sees subscriber adds about in line with guidance, with some risk on that front from accelerated churn as a result of the controversy around “Cuties,” the return of live sports, and ongoing competition in streaming from Walt Disney ￼’s (DIS) Disney+, Comcast ￼’s (CMCSA) Peacock and others. But he added that any short-term issues on subscriber growth does not impact the long-term growth for Netflix. “We continue to see the acceleration in Netflix subscriber penetration in [the first half] as a permanent benefit,” he wrote. “Investors should view potential valuation volatility driven by near-term subscriber trends as a particularly attractive opportunity.”\n\nDeutsche Bank’s Bryan Kraft reiterated his Buy rating, taking his price target up to $570 from $525. “We believe Netflix is a long term structural winner, and while the valuation does not leave much room for multiple expansion, we believe a Q3 subscriber beat, followed by a strong Q4 and price increases, will reinforce the bull case for the stock, allowing it to grind higher over the next 12 months, and possibly work to some degree in the short term as well,” he wrote.\n\nMonness Crespi Hardt’s Brian White repeated his Buy rating and $600 target. He wrote that the company’s position has been meaningfully improved by the pandemic. “This crisis has clearly accelerated a natural secular trend that was already playing out; however, we are now watching important pillars of an American entertainment institution starting to wobble, the movie theater experience,” he wrote. “This destruction is occurring due to the extent of this pandemic, coming at a time when Netflix has developed a strong footing in original content and global scale. Sitting inside a dark, indoor movie theater with strangers during a pandemic is not most people’s idea of a good time. Moreover, this experience is more expensive and time consuming.” He took a conservative approach on subscriber adds, projecting 2.5 million.\n\nSource: Barron's", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "stocks", "subreddit_id": "t5_2qjfk", "subreddit_subscribers": 882394, "subreddit_type": "public", "thumbnail": "self", "title": "Netflix Reports Earnings and Subscribers Tuesday. Here’s What to Watch.", "total_awards_received": 0, "treatment_tags": [], "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/stocks/comments/jdi0m1/netflix_reports_earnings_and_subscribers_tuesday/", "whitelist_status": "all_ads", "wls": 6, "created": 1603030668.0}], [[], false, "WouldYouLikeToTouch", null, [], null, "text", "t2_60lxtajr", false, false, [], false, false, 1602272402, "self.stocks", "https://www.reddit.com/r/stocks/comments/j85ru8/what_do_people_think_about_hrl_and_cmcsa/", {}, "j85ru8", false, false, false, false, false, true, false, "", [], "dark", "text", false, false, true, 2, 0, false, "all_ads", "/r/stocks/comments/j85ru8/what_do_people_think_about_hrl_and_cmcsa/", false, 6, "moderator", 1602272413, 1, "[removed]", true, false, false, "stocks", "t5_2qjfk", 873556, "public", "self", "what do people think about HRL and CMCSA?", 0, [], 1.0, "https://www.reddit.com/r/stocks/comments/j85ru8/what_do_people_think_about_hrl_and_cmcsa/", "all_ads", 6, 1602268802.0, {"all_awardings": [], "allow_live_comments": false, "author": "WouldYouLikeToTouch", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_60lxtajr", "author_patreon_flair": false, "author_premium": false, "awarders": [], "can_mod_post": false, "contest_mode": false, "created_utc": 1602272402, "domain": "self.stocks", "full_link": "https://www.reddit.com/r/stocks/comments/j85ru8/what_do_people_think_about_hrl_and_cmcsa/", "gildings": {}, "id": "j85ru8", "is_crosspostable": false, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": false, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 2, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/stocks/comments/j85ru8/what_do_people_think_about_hrl_and_cmcsa/", "pinned": false, "pwls": 6, "removed_by_category": "moderator", "retrieved_on": 1602272413, "score": 1, "selftext": "[removed]", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "stocks", "subreddit_id": "t5_2qjfk", "subreddit_subscribers": 873556, "subreddit_type": "public", "thumbnail": "self", "title": "what do people think about HRL and CMCSA?", "total_awards_received": 0, "treatment_tags": [], "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/stocks/comments/j85ru8/what_do_people_think_about_hrl_and_cmcsa/", "whitelist_status": "all_ads", "wls": 6, "created": 1602268802.0}], [[], false, "spacej3di", null, [], null, "text", "t2_kdm2ull", false, false, [], false, false, 1600697833, "self.stocks", "https://www.reddit.com/r/stocks/comments/ix19id/morning_market_synopsis_monday_sept_21_2020/", {}, "ix19id", true, false, false, false, true, true, false, "", "resources", [], "a376614c-65e6-11e5-b6e7-123c7cc7e97b", "Resources", "dark", "text", false, false, true, 0, 0, false, "all_ads", "/r/stocks/comments/ix19id/morning_market_synopsis_monday_sept_21_2020/", false, 6, 1600697845, 1, " **US equities lower: Dow (2.40%), S&amp;P 500 (2.06%), Nasdaq (1.63%), Russell 2000 (2.94%)**\n\n* US equities lower in Monday morning trading, extending last week's decline when S&amp;P 500 finished at six-week low and suffered third straight weekly decline. Political risks surrounding SCOTUS vacancy, a renewed uptick in coronavirus case counts (and lockdown speculation) in Europe and money laundering accusations facing some big banks among the latest headwinds coming out of the weekend. Value groups worst performers, with energy, materials, industrials the biggest laggards. Consumer staples and utilities faring best. Tech and communication services also ahead with FAANGs relatively better. Treasuries stronger with the curve flattening. Dollar seeing good gains vs euro and sterling but little changed on yen cross. Gold down 2.3%. WTI crude off 3.2%.\n* September pullback has been attributed to several different factors though concerns about overbought conditions, particularly in the growth and momentum factors that have led the market higher since the 23-Mar coronavirus bottom, have received the bulk of the blame. The dampened prospects for a near-term fiscal stimulus deal have been another overhang. Some of the other excuses have included worries the Fed may be increasingly pushing on a string, heightened political uncertainty into the November election, skepticism about some of the more aggressive vaccine timelines and a resurgence in coronavirus cases in Europe.\n* **Supreme Court vacancy following the passing of Ruth Bader Ginsburg** has grabbed most of the attention over the last few days. **Trump said he will announce his nomination later this week** and **McConnell has vowed to approve year-end**, despite pushback from Democrats. Some **mixed thoughts on how the court shakeup may impact the election** in November. **Biggest near-term issue for the market is that it** **likely makes a deal on a fifth coronavirus relief package even more of a longshot**. However, **Pelosi said she won't use a government shutdown as a bargaining chip**.\n* President Trump signed off on deal under which TikTok will partner with **ORCL-US** and **WMT-US** to become a US-based company. **JPM-US** and **BK-US** among big banks caught up in money laundering allegations. **ILMN-US** to acquire GRAIL for $8B in stock and cash**.** **ALL-US** announced $750M accelerated share repurchase agreement. **NKLA-US** down big after founder Trevor Milton voluntarily agreed to step down as executive chairman following recent battle with short-selling firm. **TOL-US** said QTD net signed contracts up 110% y/y. **CUB-US** announced shareholder rights plan after Elliott acquired 15% stake and expressed interest in an acquisition.\n\n**Notable Gainers:**\n\n* \\+10.8% **ROKU-US** (Roku): Roku and CMCSA-US 's NBCUniversal reached a deal to put Peacock and other NBCU broadcast and cable apps on Roku platform, and NBC content on ad-supported Roku Channel; terms not disclosed, but includes meaningful partnership around advertising.\n* \\+3.7% **BJ-US** (BJ's Wholesale Club Holdings, Inc.): Added to Conviction List at Goldman Sachs; notes new member acquisition likely to drive higher comps; cites accelerating unit growth, record FCF, and margin tailwinds from merchandise expansion and cost initiatives.\n* \\+2.3% **ORCL-US** (Oracle): President Trump said he agreed to concept of a deal of partnership between TikTok and Oracle and WMT-US ; Oracle to hold 12.5% stake in new entity called TikTok Global; upgraded to outperform from sector perform at RBC Capital Markets, saying acquisition a potential catalyst to price appreciation.\n* \\+2.3% **RCII-US** (Rent-A-Center): Guided Q3 earnings and revenue above consensus and raised FY guide; said lease portfolio performance and customer payment activity have remained strong even without additional government stimulus.\n* \\+2.2% **TSLA-US** (Tesla): Electrek reported that CEO Musk told employees company has a chance at record vehicle deliveries for Q3.\n* \\+1.9% **UPS-US** (UPS): Upgraded to outperform from neutral at Credit Suisse; cited increased carrier pricing power, expectations for declining capital intensity going forward, and the new CEO.\n\n**Notable Decliners:**\n\n* \\-15.5% **NKLA-US** (Nikola Corp.): Trevor Milton is leaving the company, having stepped down as chair of the board amidst short seller claims of exaggerated technology and an investigation by the SEC/Justice Department; Stephen Girsky will become chair and Mark Russell will remain CEO after being named in June.\n* \\-14.8% **THC-US** (Tenet Healthcare): JPMorgan reevaluated hospital ratings; Tenet and UHS-US downgraded to underweight from neutral, HCA-US to neutral from overweight; cited the passing of Justice Ginsburg as a political catalyst for Biden with his proposed public option and lower eligibility age seen as negative; also noted stalling national hospital revenue trends, greater competitive forces via value-based care innovations.\n* \\-4.5% **ILMN-US** (Illumina): Reached agreement to buy remainder of Grail it does not already own for $7.1B in cash and stock; expects deal to be revenue accretive beginning in 2021 though some analysts have suggested Grail could require significant investments before paying off.\n* \\-4.1% **ADP-US** (ADP): Downgraded to market perform from outperform at Cowen; noted Next-Gen HCM has not become a meaningful contributor as fast as anticipated; cited slower-than-expected pace of platform availability and mini-app market development.\n* \\-3.3% **JPM-US** (JPMorgan Chase): Reporting on leaked suspicious activity reports from US Treasury alleged several of world's largest banks (including DB-US , STAN-GB , and BK-US ) facilitated more than $2T in suspicious transactions for suspected criminals over two decades.\n\n09:08:09 AM CDT on 21 Sep '20", false, false, false, "stocks", "t5_2qjfk", 854207, "public", "self", "Morning Market Synopsis - Monday, Sept. 21, 2020", 0, [], 1.0, "https://www.reddit.com/r/stocks/comments/ix19id/morning_market_synopsis_monday_sept_21_2020/", "all_ads", 6, 1600694233.0, {"all_awardings": [], "allow_live_comments": false, "author": "spacej3di", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_kdm2ull", "author_patreon_flair": false, "author_premium": false, "awarders": [], "can_mod_post": false, "contest_mode": false, "created_utc": 1600697833, "domain": "self.stocks", "full_link": "https://www.reddit.com/r/stocks/comments/ix19id/morning_market_synopsis_monday_sept_21_2020/", "gildings": {}, "id": "ix19id", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_css_class": "resources", "link_flair_richtext": [], "link_flair_template_id": "a376614c-65e6-11e5-b6e7-123c7cc7e97b", "link_flair_text": "Resources", "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 0, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/stocks/comments/ix19id/morning_market_synopsis_monday_sept_21_2020/", "pinned": false, "pwls": 6, "retrieved_on": 1600697845, "score": 1, "selftext": " **US equities lower: Dow (2.40%), S&amp;P 500 (2.06%), Nasdaq (1.63%), Russell 2000 (2.94%)**\n\n* US equities lower in Monday morning trading, extending last week's decline when S&amp;P 500 finished at six-week low and suffered third straight weekly decline. Political risks surrounding SCOTUS vacancy, a renewed uptick in coronavirus case counts (and lockdown speculation) in Europe and money laundering accusations facing some big banks among the latest headwinds coming out of the weekend. Value groups worst performers, with energy, materials, industrials the biggest laggards. Consumer staples and utilities faring best. Tech and communication services also ahead with FAANGs relatively better. Treasuries stronger with the curve flattening. Dollar seeing good gains vs euro and sterling but little changed on yen cross. Gold down 2.3%. WTI crude off 3.2%.\n* September pullback has been attributed to several different factors though concerns about overbought conditions, particularly in the growth and momentum factors that have led the market higher since the 23-Mar coronavirus bottom, have received the bulk of the blame. The dampened prospects for a near-term fiscal stimulus deal have been another overhang. Some of the other excuses have included worries the Fed may be increasingly pushing on a string, heightened political uncertainty into the November election, skepticism about some of the more aggressive vaccine timelines and a resurgence in coronavirus cases in Europe.\n* **Supreme Court vacancy following the passing of Ruth Bader Ginsburg** has grabbed most of the attention over the last few days. **Trump said he will announce his nomination later this week** and **McConnell has vowed to approve year-end**, despite pushback from Democrats. Some **mixed thoughts on how the court shakeup may impact the election** in November. **Biggest near-term issue for the market is that it** **likely makes a deal on a fifth coronavirus relief package even more of a longshot**. However, **Pelosi said she won't use a government shutdown as a bargaining chip**.\n* President Trump signed off on deal under which TikTok will partner with **ORCL-US** and **WMT-US** to become a US-based company. **JPM-US** and **BK-US** among big banks caught up in money laundering allegations. **ILMN-US** to acquire GRAIL for $8B in stock and cash**.** **ALL-US** announced $750M accelerated share repurchase agreement. **NKLA-US** down big after founder Trevor Milton voluntarily agreed to step down as executive chairman following recent battle with short-selling firm. **TOL-US** said QTD net signed contracts up 110% y/y. **CUB-US** announced shareholder rights plan after Elliott acquired 15% stake and expressed interest in an acquisition.\n\n**Notable Gainers:**\n\n* \\+10.8% **ROKU-US** (Roku): Roku and CMCSA-US 's NBCUniversal reached a deal to put Peacock and other NBCU broadcast and cable apps on Roku platform, and NBC content on ad-supported Roku Channel; terms not disclosed, but includes meaningful partnership around advertising.\n* \\+3.7% **BJ-US** (BJ's Wholesale Club Holdings, Inc.): Added to Conviction List at Goldman Sachs; notes new member acquisition likely to drive higher comps; cites accelerating unit growth, record FCF, and margin tailwinds from merchandise expansion and cost initiatives.\n* \\+2.3% **ORCL-US** (Oracle): President Trump said he agreed to concept of a deal of partnership between TikTok and Oracle and WMT-US ; Oracle to hold 12.5% stake in new entity called TikTok Global; upgraded to outperform from sector perform at RBC Capital Markets, saying acquisition a potential catalyst to price appreciation.\n* \\+2.3% **RCII-US** (Rent-A-Center): Guided Q3 earnings and revenue above consensus and raised FY guide; said lease portfolio performance and customer payment activity have remained strong even without additional government stimulus.\n* \\+2.2% **TSLA-US** (Tesla): Electrek reported that CEO Musk told employees company has a chance at record vehicle deliveries for Q3.\n* \\+1.9% **UPS-US** (UPS): Upgraded to outperform from neutral at Credit Suisse; cited increased carrier pricing power, expectations for declining capital intensity going forward, and the new CEO.\n\n**Notable Decliners:**\n\n* \\-15.5% **NKLA-US** (Nikola Corp.): Trevor Milton is leaving the company, having stepped down as chair of the board amidst short seller claims of exaggerated technology and an investigation by the SEC/Justice Department; Stephen Girsky will become chair and Mark Russell will remain CEO after being named in June.\n* \\-14.8% **THC-US** (Tenet Healthcare): JPMorgan reevaluated hospital ratings; Tenet and UHS-US downgraded to underweight from neutral, HCA-US to neutral from overweight; cited the passing of Justice Ginsburg as a political catalyst for Biden with his proposed public option and lower eligibility age seen as negative; also noted stalling national hospital revenue trends, greater competitive forces via value-based care innovations.\n* \\-4.5% **ILMN-US** (Illumina): Reached agreement to buy remainder of Grail it does not already own for $7.1B in cash and stock; expects deal to be revenue accretive beginning in 2021 though some analysts have suggested Grail could require significant investments before paying off.\n* \\-4.1% **ADP-US** (ADP): Downgraded to market perform from outperform at Cowen; noted Next-Gen HCM has not become a meaningful contributor as fast as anticipated; cited slower-than-expected pace of platform availability and mini-app market development.\n* \\-3.3% **JPM-US** (JPMorgan Chase): Reporting on leaked suspicious activity reports from US Treasury alleged several of world's largest banks (including DB-US , STAN-GB , and BK-US ) facilitated more than $2T in suspicious transactions for suspected criminals over two decades.\n\n09:08:09 AM CDT on 21 Sep '20", "send_replies": false, "spoiler": false, "stickied": false, "subreddit": "stocks", "subreddit_id": "t5_2qjfk", "subreddit_subscribers": 854207, "subreddit_type": "public", "thumbnail": "self", "title": "Morning Market Synopsis - Monday, Sept. 21, 2020", "total_awards_received": 0, "treatment_tags": [], "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/stocks/comments/ix19id/morning_market_synopsis_monday_sept_21_2020/", "whitelist_status": "all_ads", "wls": 6, "created": 1600694233.0}], [[], false, "TheAncient1sAnd0s", null, [], null, "text", "t2_oujsh", false, false, [], false, false, 1600203116, "self.stocks", "https://www.reddit.com/r/stocks/comments/ithf8l/how_to_invest_in_theme_parks_movie_companies_and/", {}, "ithf8l", true, false, false, false, true, true, false, "", [], "dark", "text", false, false, true, 7, 0, false, "all_ads", "/r/stocks/comments/ithf8l/how_to_invest_in_theme_parks_movie_companies_and/", false, 6, 1600203126, 1, " All in one.  You should be in CMCSA, plus(!) get a dividend.\n\nWhy does DIS get all the reddit hype?  The actual movies don't matter, cause if they did then these last 5 years of Star Wars and Marvel movies would have seen DIS go up instead of mostly sideways.  Total market laggard.  \n\nGet in CMCSA now because all time highs are right around the corner while DIS languishes.\n\nSince the middle of 2015: CMCSA is +85% while DIS is only +45% and that is NOT INCLUDING dividends that you get from CMCSA.\n\nProbably a smart move to stay out of the hypercompetitive streaming business too by CMCSA.", false, false, false, "stocks", "t5_2qjfk", 846949, "public", "self", "How to invest in theme parks, movie companies, and televised media", 0, [], 1.0, "https://www.reddit.com/r/stocks/comments/ithf8l/how_to_invest_in_theme_parks_movie_companies_and/", "all_ads", 6, 1600199516.0, {"all_awardings": [], "allow_live_comments": false, "author": "TheAncient1sAnd0s", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_oujsh", "author_patreon_flair": false, "author_premium": false, "awarders": [], "can_mod_post": false, "contest_mode": false, "created_utc": 1600203116, "domain": "self.stocks", "full_link": "https://www.reddit.com/r/stocks/comments/ithf8l/how_to_invest_in_theme_parks_movie_companies_and/", "gildings": {}, "id": "ithf8l", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 7, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/stocks/comments/ithf8l/how_to_invest_in_theme_parks_movie_companies_and/", "pinned": false, "pwls": 6, "retrieved_on": 1600203126, "score": 1, "selftext": " All in one.  You should be in CMCSA, plus(!) get a dividend.\n\nWhy does DIS get all the reddit hype?  The actual movies don't matter, cause if they did then these last 5 years of Star Wars and Marvel movies would have seen DIS go up instead of mostly sideways.  Total market laggard.  \n\nGet in CMCSA now because all time highs are right around the corner while DIS languishes.\n\nSince the middle of 2015: CMCSA is +85% while DIS is only +45% and that is NOT INCLUDING dividends that you get from CMCSA.\n\nProbably a smart move to stay out of the hypercompetitive streaming business too by CMCSA.", "send_replies": false, "spoiler": false, "stickied": false, "subreddit": "stocks", "subreddit_id": "t5_2qjfk", "subreddit_subscribers": 846949, "subreddit_type": "public", "thumbnail": "self", "title": "How to invest in theme parks, movie companies, and televised media", "total_awards_received": 0, "treatment_tags": [], "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/stocks/comments/ithf8l/how_to_invest_in_theme_parks_movie_companies_and/", "whitelist_status": "all_ads", "wls": 6, "created": 1600199516.0}], [[{"award_sub_type": "GLOBAL", "award_type": "global", "awardings_required_to_grant_benefits": null, "coin_price": 75, "coin_reward": 0, "count": 1, "days_of_drip_extension": 0, "days_of_premium": 0, "description": "Everything's better with a good hug", "end_date": null, "giver_coin_reward": 0, "icon_format": "PNG", "icon_height": 2048, "icon_url": "https://i.redd.it/award_images/t5_22cerq/5smbysczm1w41_Hugz.png", "icon_width": 2048, "id": "award_ce5f9ce6-49d9-4905-9228-22950e889206", "is_enabled": true, "is_new": false, "name": "Hugz", "penny_donate": 0, "penny_price": 0, "resized_icons": [{"height": 16, "url": "https://preview.redd.it/award_images/t5_22cerq/5smbysczm1w41_Hugz.png?width=16&amp;height=16&amp;auto=webp&amp;s=7a3164ef705ae0a41198e29767e4a51fd86e2dcd", "width": 16}, {"height": 32, "url": "https://preview.redd.it/award_images/t5_22cerq/5smbysczm1w41_Hugz.png?width=32&amp;height=32&amp;auto=webp&amp;s=5c621179e63f7f6fbb6a0807367bd79467878784", "width": 32}, {"height": 48, "url": "https://preview.redd.it/award_images/t5_22cerq/5smbysczm1w41_Hugz.png?width=48&amp;height=48&amp;auto=webp&amp;s=ebf40f79a711e9c4206f5f841235e43697f7a3f5", "width": 48}, {"height": 64, "url": "https://preview.redd.it/award_images/t5_22cerq/5smbysczm1w41_Hugz.png?width=64&amp;height=64&amp;auto=webp&amp;s=18dad26bb669e202c42ff6b742d6c0f9d1e62ee9", "width": 64}, {"height": 128, "url": "https://preview.redd.it/award_images/t5_22cerq/5smbysczm1w41_Hugz.png?width=128&amp;height=128&amp;auto=webp&amp;s=61ccae2b32cfbf2f26bd53c9d1287d1235da4d68", "width": 128}], "resized_static_icons": [{"height": 16, "url": "https://preview.redd.it/award_images/t5_22cerq/5smbysczm1w41_Hugz.png?width=16&amp;height=16&amp;auto=webp&amp;s=7a3164ef705ae0a41198e29767e4a51fd86e2dcd", "width": 16}, {"height": 32, "url": "https://preview.redd.it/award_images/t5_22cerq/5smbysczm1w41_Hugz.png?width=32&amp;height=32&amp;auto=webp&amp;s=5c621179e63f7f6fbb6a0807367bd79467878784", "width": 32}, {"height": 48, "url": "https://preview.redd.it/award_images/t5_22cerq/5smbysczm1w41_Hugz.png?width=48&amp;height=48&amp;auto=webp&amp;s=ebf40f79a711e9c4206f5f841235e43697f7a3f5", "width": 48}, {"height": 64, "url": "https://preview.redd.it/award_images/t5_22cerq/5smbysczm1w41_Hugz.png?width=64&amp;height=64&amp;auto=webp&amp;s=18dad26bb669e202c42ff6b742d6c0f9d1e62ee9", "width": 64}, {"height": 128, "url": "https://preview.redd.it/award_images/t5_22cerq/5smbysczm1w41_Hugz.png?width=128&amp;height=128&amp;auto=webp&amp;s=61ccae2b32cfbf2f26bd53c9d1287d1235da4d68", "width": 128}], "start_date": null, "static_icon_height": 2048, "static_icon_url": "https://i.redd.it/award_images/t5_22cerq/5smbysczm1w41_Hugz.png", "static_icon_width": 2048, "subreddit_coin_reward": 0, "subreddit_id": null, "tiers_by_required_awardings": null}, {"award_sub_type": "GLOBAL", "award_type": "global", "awardings_required_to_grant_benefits": null, "coin_price": 10, "coin_reward": 0, "count": 1, "days_of_drip_extension": 0, "days_of_premium": 0, "description": "Feeling relaxed and restored", "end_date": null, "giver_coin_reward": 0, "icon_format": "PNG", "icon_height": 512, "icon_url": "https://i.redd.it/award_images/t5_22cerq/0lurnbnhqkl51_Recharge.png", "icon_width": 512, "id": "award_e1b2bf9e-8c62-4edc-9b6d-ffa44a7cb53b", "is_enabled": true, "is_new": false, "name": "Recharge", "penny_donate": 0, "penny_price": 0, "resized_icons": [{"height": 16, "url": "https://preview.redd.it/award_images/t5_22cerq/0lurnbnhqkl51_Recharge.png?width=16&amp;height=16&amp;auto=webp&amp;s=8cab850fa5c59622b57b640bf1ec93407e73a064", "width": 16}, {"height": 32, "url": "https://preview.redd.it/award_images/t5_22cerq/0lurnbnhqkl51_Recharge.png?width=32&amp;height=32&amp;auto=webp&amp;s=ec65f144209ca7e1827f36254e05b1923c91fffa", "width": 32}, {"height": 48, "url": "https://preview.redd.it/award_images/t5_22cerq/0lurnbnhqkl51_Recharge.png?width=48&amp;height=48&amp;auto=webp&amp;s=414b87935482f371e119c28eaabe4f014b73a654", "width": 48}, {"height": 64, "url": "https://preview.redd.it/award_images/t5_22cerq/0lurnbnhqkl51_Recharge.png?width=64&amp;height=64&amp;auto=webp&amp;s=5e10e49d105b375ae680d573e0333b783922c71e", "width": 64}, {"height": 128, "url": "https://preview.redd.it/award_images/t5_22cerq/0lurnbnhqkl51_Recharge.png?width=128&amp;height=128&amp;auto=webp&amp;s=ecd9227a9edeef00a0f2c7dd10f20f765ca69e46", "width": 128}], "resized_static_icons": [{"height": 16, "url": "https://preview.redd.it/award_images/t5_22cerq/0lurnbnhqkl51_Recharge.png?width=16&amp;height=16&amp;auto=webp&amp;s=8cab850fa5c59622b57b640bf1ec93407e73a064", "width": 16}, {"height": 32, "url": "https://preview.redd.it/award_images/t5_22cerq/0lurnbnhqkl51_Recharge.png?width=32&amp;height=32&amp;auto=webp&amp;s=ec65f144209ca7e1827f36254e05b1923c91fffa", "width": 32}, {"height": 48, "url": "https://preview.redd.it/award_images/t5_22cerq/0lurnbnhqkl51_Recharge.png?width=48&amp;height=48&amp;auto=webp&amp;s=414b87935482f371e119c28eaabe4f014b73a654", "width": 48}, {"height": 64, "url": "https://preview.redd.it/award_images/t5_22cerq/0lurnbnhqkl51_Recharge.png?width=64&amp;height=64&amp;auto=webp&amp;s=5e10e49d105b375ae680d573e0333b783922c71e", "width": 64}, {"height": 128, "url": "https://preview.redd.it/award_images/t5_22cerq/0lurnbnhqkl51_Recharge.png?width=128&amp;height=128&amp;auto=webp&amp;s=ecd9227a9edeef00a0f2c7dd10f20f765ca69e46", "width": 128}], "start_date": null, "static_icon_height": 512, "static_icon_url": "https://i.redd.it/award_images/t5_22cerq/0lurnbnhqkl51_Recharge.png", "static_icon_width": 512, "subreddit_coin_reward": 0, "subreddit_id": null, "tiers_by_required_awardings": null}], true, "coolcomfort123", null, [], null, "text", "t2_2sj2vd1h", false, false, [], false, false, 1600003568, "self.stocks", 1600032706, "https://www.reddit.com/r/stocks/comments/iry8rp/netflix_users_dont_really_care_whether_content_is/", {}, "iry8rp", true, false, false, false, true, true, false, "", [], "dark", "text", false, false, false, 716, 0, false, "all_ads", "/r/stocks/comments/iry8rp/netflix_users_dont_really_care_whether_content_is/", false, "self", {"enabled": false, "images": [{"id": "X1j8pjb3moEIP2eY7yiUlLe-pRdHz86jK3DxuJgy_Ck", "resolutions": [{"height": 72, "url": "https://external-preview.redd.it/SBG0rSiznYZZv4uEMERvXVrvi105Ue46kyRnT_mQVnQ.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=e2d310593ea7b626c21e7b57aaaf3922c3efb7f3", "width": 108}, {"height": 144, "url": "https://external-preview.redd.it/SBG0rSiznYZZv4uEMERvXVrvi105Ue46kyRnT_mQVnQ.jpg?width=216&amp;crop=smart&amp;auto=webp&amp;s=ffd0ca4f95ab0d6df66de9753850d0749070a969", "width": 216}, {"height": 213, "url": "https://external-preview.redd.it/SBG0rSiznYZZv4uEMERvXVrvi105Ue46kyRnT_mQVnQ.jpg?width=320&amp;crop=smart&amp;auto=webp&amp;s=be3782dffaec7fb64e3daaa88c4bcf25e8fef674", "width": 320}, {"height": 426, "url": "https://external-preview.redd.it/SBG0rSiznYZZv4uEMERvXVrvi105Ue46kyRnT_mQVnQ.jpg?width=640&amp;crop=smart&amp;auto=webp&amp;s=c519910d2439336abb567f7106eaeb5bee94e28a", "width": 640}, {"height": 640, "url": "https://external-preview.redd.it/SBG0rSiznYZZv4uEMERvXVrvi105Ue46kyRnT_mQVnQ.jpg?width=960&amp;crop=smart&amp;auto=webp&amp;s=7ec3f141c945b05c06670f3cc4a6fe3d37e2af60", "width": 960}, {"height": 720, "url": "https://external-preview.redd.it/SBG0rSiznYZZv4uEMERvXVrvi105Ue46kyRnT_mQVnQ.jpg?width=1080&amp;crop=smart&amp;auto=webp&amp;s=bf29773e30579a156aa10c4c30acb7bf48fc9b45", "width": 1080}], "source": {"height": 3712, "url": "https://external-preview.redd.it/SBG0rSiznYZZv4uEMERvXVrvi105Ue46kyRnT_mQVnQ.jpg?auto=webp&amp;s=b55216f3919c6a32b81927a7c3c3334b39ace716", "width": 5568}, "variants": {}}]}, 6, 1600038686, 1545, "https://finance.yahoo.com/news/netflix-users-dont-really-care-whether-content-is-original-co-ceo-says-121745211.html\n\nDespite a coronavirus shutdown this year that temporarily halted most TV production, Netflix plans to release even more originals in 2021 than in 2020 — which would mark the latest achievement for a company’s whose massive investment in original content inspires both envy and ridicule.\n\nLast year, Netflix spent $15 billion on content, which put its investment even with ViacomCBS (VIAC) but behind Comcast (CMCSA) at $15.4 billion and Disney (DIS), which shelled out $27.8 billion — according to data compiled by Variety. The streaming giant will up its spend this year to $17.3 billion, most of which will go toward original content, said BMO Capital Markets analyst Dan Salmon in January.\n\nNetflix added nearly 26 million subscribers over the first six months of this year, bringing its total subscribers worldwide to about 193 million. By comparison, Disney Plus had 60.5 million subscribers worldwide as of Aug. 3 — though the platform has operated for a far shorter time, having launched last November.\n\nThanks for the awards.", true, false, false, "stocks", "t5_2qjfk", 844184, "public", "self", "Netflix users 'don't really care' whether content is created by Netflix, co-CEO says", 2, [], 0.98, "https://www.reddit.com/r/stocks/comments/iry8rp/netflix_users_dont_really_care_whether_content_is/", "all_ads", 6, 1599999968.0, {"all_awardings": [{"award_sub_type": "GLOBAL", "award_type": "global", "awardings_required_to_grant_benefits": null, "coin_price": 75, "coin_reward": 0, "count": 1, "days_of_drip_extension": 0, "days_of_premium": 0, "description": "Everything's better with a good hug", "end_date": null, "giver_coin_reward": 0, "icon_format": "PNG", "icon_height": 2048, "icon_url": "https://i.redd.it/award_images/t5_22cerq/5smbysczm1w41_Hugz.png", "icon_width": 2048, "id": "award_ce5f9ce6-49d9-4905-9228-22950e889206", "is_enabled": true, "is_new": false, "name": "Hugz", "penny_donate": 0, "penny_price": 0, "resized_icons": [{"height": 16, "url": "https://preview.redd.it/award_images/t5_22cerq/5smbysczm1w41_Hugz.png?width=16&amp;height=16&amp;auto=webp&amp;s=7a3164ef705ae0a41198e29767e4a51fd86e2dcd", "width": 16}, {"height": 32, "url": "https://preview.redd.it/award_images/t5_22cerq/5smbysczm1w41_Hugz.png?width=32&amp;height=32&amp;auto=webp&amp;s=5c621179e63f7f6fbb6a0807367bd79467878784", "width": 32}, {"height": 48, "url": "https://preview.redd.it/award_images/t5_22cerq/5smbysczm1w41_Hugz.png?width=48&amp;height=48&amp;auto=webp&amp;s=ebf40f79a711e9c4206f5f841235e43697f7a3f5", "width": 48}, {"height": 64, "url": "https://preview.redd.it/award_images/t5_22cerq/5smbysczm1w41_Hugz.png?width=64&amp;height=64&amp;auto=webp&amp;s=18dad26bb669e202c42ff6b742d6c0f9d1e62ee9", "width": 64}, {"height": 128, "url": "https://preview.redd.it/award_images/t5_22cerq/5smbysczm1w41_Hugz.png?width=128&amp;height=128&amp;auto=webp&amp;s=61ccae2b32cfbf2f26bd53c9d1287d1235da4d68", "width": 128}], "resized_static_icons": [{"height": 16, "url": "https://preview.redd.it/award_images/t5_22cerq/5smbysczm1w41_Hugz.png?width=16&amp;height=16&amp;auto=webp&amp;s=7a3164ef705ae0a41198e29767e4a51fd86e2dcd", "width": 16}, {"height": 32, "url": "https://preview.redd.it/award_images/t5_22cerq/5smbysczm1w41_Hugz.png?width=32&amp;height=32&amp;auto=webp&amp;s=5c621179e63f7f6fbb6a0807367bd79467878784", "width": 32}, {"height": 48, "url": "https://preview.redd.it/award_images/t5_22cerq/5smbysczm1w41_Hugz.png?width=48&amp;height=48&amp;auto=webp&amp;s=ebf40f79a711e9c4206f5f841235e43697f7a3f5", "width": 48}, {"height": 64, "url": "https://preview.redd.it/award_images/t5_22cerq/5smbysczm1w41_Hugz.png?width=64&amp;height=64&amp;auto=webp&amp;s=18dad26bb669e202c42ff6b742d6c0f9d1e62ee9", "width": 64}, {"height": 128, "url": "https://preview.redd.it/award_images/t5_22cerq/5smbysczm1w41_Hugz.png?width=128&amp;height=128&amp;auto=webp&amp;s=61ccae2b32cfbf2f26bd53c9d1287d1235da4d68", "width": 128}], "start_date": null, "static_icon_height": 2048, "static_icon_url": "https://i.redd.it/award_images/t5_22cerq/5smbysczm1w41_Hugz.png", "static_icon_width": 2048, "subreddit_coin_reward": 0, "subreddit_id": null, "tiers_by_required_awardings": null}, {"award_sub_type": "GLOBAL", "award_type": "global", "awardings_required_to_grant_benefits": null, "coin_price": 10, "coin_reward": 0, "count": 1, "days_of_drip_extension": 0, "days_of_premium": 0, "description": "Feeling relaxed and restored", "end_date": null, "giver_coin_reward": 0, "icon_format": "PNG", "icon_height": 512, "icon_url": "https://i.redd.it/award_images/t5_22cerq/0lurnbnhqkl51_Recharge.png", "icon_width": 512, "id": "award_e1b2bf9e-8c62-4edc-9b6d-ffa44a7cb53b", "is_enabled": true, "is_new": false, "name": "Recharge", "penny_donate": 0, "penny_price": 0, "resized_icons": [{"height": 16, "url": "https://preview.redd.it/award_images/t5_22cerq/0lurnbnhqkl51_Recharge.png?width=16&amp;height=16&amp;auto=webp&amp;s=8cab850fa5c59622b57b640bf1ec93407e73a064", "width": 16}, {"height": 32, "url": "https://preview.redd.it/award_images/t5_22cerq/0lurnbnhqkl51_Recharge.png?width=32&amp;height=32&amp;auto=webp&amp;s=ec65f144209ca7e1827f36254e05b1923c91fffa", "width": 32}, {"height": 48, "url": "https://preview.redd.it/award_images/t5_22cerq/0lurnbnhqkl51_Recharge.png?width=48&amp;height=48&amp;auto=webp&amp;s=414b87935482f371e119c28eaabe4f014b73a654", "width": 48}, {"height": 64, "url": "https://preview.redd.it/award_images/t5_22cerq/0lurnbnhqkl51_Recharge.png?width=64&amp;height=64&amp;auto=webp&amp;s=5e10e49d105b375ae680d573e0333b783922c71e", "width": 64}, {"height": 128, "url": "https://preview.redd.it/award_images/t5_22cerq/0lurnbnhqkl51_Recharge.png?width=128&amp;height=128&amp;auto=webp&amp;s=ecd9227a9edeef00a0f2c7dd10f20f765ca69e46", "width": 128}], "resized_static_icons": [{"height": 16, "url": "https://preview.redd.it/award_images/t5_22cerq/0lurnbnhqkl51_Recharge.png?width=16&amp;height=16&amp;auto=webp&amp;s=8cab850fa5c59622b57b640bf1ec93407e73a064", "width": 16}, {"height": 32, "url": "https://preview.redd.it/award_images/t5_22cerq/0lurnbnhqkl51_Recharge.png?width=32&amp;height=32&amp;auto=webp&amp;s=ec65f144209ca7e1827f36254e05b1923c91fffa", "width": 32}, {"height": 48, "url": "https://preview.redd.it/award_images/t5_22cerq/0lurnbnhqkl51_Recharge.png?width=48&amp;height=48&amp;auto=webp&amp;s=414b87935482f371e119c28eaabe4f014b73a654", "width": 48}, {"height": 64, "url": "https://preview.redd.it/award_images/t5_22cerq/0lurnbnhqkl51_Recharge.png?width=64&amp;height=64&amp;auto=webp&amp;s=5e10e49d105b375ae680d573e0333b783922c71e", "width": 64}, {"height": 128, "url": "https://preview.redd.it/award_images/t5_22cerq/0lurnbnhqkl51_Recharge.png?width=128&amp;height=128&amp;auto=webp&amp;s=ecd9227a9edeef00a0f2c7dd10f20f765ca69e46", "width": 128}], "start_date": null, "static_icon_height": 512, "static_icon_url": "https://i.redd.it/award_images/t5_22cerq/0lurnbnhqkl51_Recharge.png", "static_icon_width": 512, "subreddit_coin_reward": 0, "subreddit_id": null, "tiers_by_required_awardings": null}], "allow_live_comments": true, "author": "coolcomfort123", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_2sj2vd1h", "author_patreon_flair": false, "author_premium": false, "awarders": [], "can_mod_post": false, "contest_mode": false, "created_utc": 1600003568, "domain": "self.stocks", "edited": 1600032706, "full_link": "https://www.reddit.com/r/stocks/comments/iry8rp/netflix_users_dont_really_care_whether_content_is/", "gildings": {}, "id": "iry8rp", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": false, "num_comments": 716, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/stocks/comments/iry8rp/netflix_users_dont_really_care_whether_content_is/", "pinned": false, "post_hint": "self", "preview": {"enabled": false, "images": [{"id": "X1j8pjb3moEIP2eY7yiUlLe-pRdHz86jK3DxuJgy_Ck", "resolutions": [{"height": 72, "url": "https://external-preview.redd.it/SBG0rSiznYZZv4uEMERvXVrvi105Ue46kyRnT_mQVnQ.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=e2d310593ea7b626c21e7b57aaaf3922c3efb7f3", "width": 108}, {"height": 144, "url": "https://external-preview.redd.it/SBG0rSiznYZZv4uEMERvXVrvi105Ue46kyRnT_mQVnQ.jpg?width=216&amp;crop=smart&amp;auto=webp&amp;s=ffd0ca4f95ab0d6df66de9753850d0749070a969", "width": 216}, {"height": 213, "url": "https://external-preview.redd.it/SBG0rSiznYZZv4uEMERvXVrvi105Ue46kyRnT_mQVnQ.jpg?width=320&amp;crop=smart&amp;auto=webp&amp;s=be3782dffaec7fb64e3daaa88c4bcf25e8fef674", "width": 320}, {"height": 426, "url": "https://external-preview.redd.it/SBG0rSiznYZZv4uEMERvXVrvi105Ue46kyRnT_mQVnQ.jpg?width=640&amp;crop=smart&amp;auto=webp&amp;s=c519910d2439336abb567f7106eaeb5bee94e28a", "width": 640}, {"height": 640, "url": "https://external-preview.redd.it/SBG0rSiznYZZv4uEMERvXVrvi105Ue46kyRnT_mQVnQ.jpg?width=960&amp;crop=smart&amp;auto=webp&amp;s=7ec3f141c945b05c06670f3cc4a6fe3d37e2af60", "width": 960}, {"height": 720, "url": "https://external-preview.redd.it/SBG0rSiznYZZv4uEMERvXVrvi105Ue46kyRnT_mQVnQ.jpg?width=1080&amp;crop=smart&amp;auto=webp&amp;s=bf29773e30579a156aa10c4c30acb7bf48fc9b45", "width": 1080}], "source": {"height": 3712, "url": "https://external-preview.redd.it/SBG0rSiznYZZv4uEMERvXVrvi105Ue46kyRnT_mQVnQ.jpg?auto=webp&amp;s=b55216f3919c6a32b81927a7c3c3334b39ace716", "width": 5568}, "variants": {}}]}, "pwls": 6, "retrieved_on": 1600038686, "score": 1545, "selftext": "https://finance.yahoo.com/news/netflix-users-dont-really-care-whether-content-is-original-co-ceo-says-121745211.html\n\nDespite a coronavirus shutdown this year that temporarily halted most TV production, Netflix plans to release even more originals in 2021 than in 2020 — which would mark the latest achievement for a company’s whose massive investment in original content inspires both envy and ridicule.\n\nLast year, Netflix spent $15 billion on content, which put its investment even with ViacomCBS (VIAC) but behind Comcast (CMCSA) at $15.4 billion and Disney (DIS), which shelled out $27.8 billion — according to data compiled by Variety. The streaming giant will up its spend this year to $17.3 billion, most of which will go toward original content, said BMO Capital Markets analyst Dan Salmon in January.\n\nNetflix added nearly 26 million subscribers over the first six months of this year, bringing its total subscribers worldwide to about 193 million. By comparison, Disney Plus had 60.5 million subscribers worldwide as of Aug. 3 — though the platform has operated for a far shorter time, having launched last November.\n\nThanks for the awards.", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "stocks", "subreddit_id": "t5_2qjfk", "subreddit_subscribers": 844184, "subreddit_type": "public", "thumbnail": "self", "title": "Netflix users 'don't really care' whether content is created by Netflix, co-CEO says", "total_awards_received": 2, "treatment_tags": [], "upvote_ratio": 0.98, "url": "https://www.reddit.com/r/stocks/comments/iry8rp/netflix_users_dont_really_care_whether_content_is/", "whitelist_status": "all_ads", "wls": 6, "created": 1599999968.0}], [[], false, "Ford456fgfd", null, [], null, "text", "t2_3slhpvhs", false, false, [], false, false, 1596921711, "self.stocks", "https://www.reddit.com/r/stocks/comments/i67370/cmcsa_vs_vzn_vs_att/", {}, "i67370", false, false, false, false, false, true, false, "", [], "dark", "text", false, false, true, 0, 0, false, "all_ads", "/r/stocks/comments/i67370/cmcsa_vs_vzn_vs_att/", false, 6, "reddit", 1596921722, 1, "[removed]", true, false, false, "stocks", "t5_2qjfk", 784355, "public", "self", "CMCSA vs VZN vs ATT", 0, [], 1.0, "https://www.reddit.com/r/stocks/comments/i67370/cmcsa_vs_vzn_vs_att/", "all_ads", 6, 1596918111.0, {"all_awardings": [], "allow_live_comments": false, "author": "Ford456fgfd", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_3slhpvhs", "author_patreon_flair": false, "author_premium": false, "awarders": [], "can_mod_post": false, "contest_mode": false, "created_utc": 1596921711, "domain": "self.stocks", "full_link": "https://www.reddit.com/r/stocks/comments/i67370/cmcsa_vs_vzn_vs_att/", "gildings": {}, "id": "i67370", "is_crosspostable": false, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": false, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 0, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/stocks/comments/i67370/cmcsa_vs_vzn_vs_att/", "pinned": false, "pwls": 6, "removed_by_category": "reddit", "retrieved_on": 1596921722, "score": 1, "selftext": "[removed]", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "stocks", "subreddit_id": "t5_2qjfk", "subreddit_subscribers": 784355, "subreddit_type": "public", "thumbnail": "self", "title": "CMCSA vs VZN vs ATT", "total_awards_received": 0, "treatment_tags": [], "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/stocks/comments/i67370/cmcsa_vs_vzn_vs_att/", "whitelist_status": "all_ads", "wls": 6, "created": 1596918111.0}], [[], false, "flostat3ofmind", null, [], null, "text", "t2_7lrgelz6", false, false, [], false, false, 1596921686, "self.stocks", "https://www.reddit.com/r/stocks/comments/i672xq/cmcsa_vs_vzn_vs_att/", {}, "i672xq", true, false, false, false, true, true, false, "", [], "dark", "text", false, false, true, 8, 0, false, "all_ads", "/r/stocks/comments/i672xq/cmcsa_vs_vzn_vs_att/", false, 6, 1596921698, 1, "What are your thoughts on the these 3 companies, as competitors, who will come out on top?\n\nIn terms of stock value, CMCSA seems so undervalued and seems to have everything needed to succeed and adapt to the future technological environment. In what ways can Verizon and ATT come out ahead of CMCSA?", true, false, false, "stocks", "t5_2qjfk", 784354, "public", "self", "CMCSA vs VZN vs ATT", 0, [], 1.0, "https://www.reddit.com/r/stocks/comments/i672xq/cmcsa_vs_vzn_vs_att/", "all_ads", 6, 1596918086.0, {"all_awardings": [], "allow_live_comments": false, "author": "flostat3ofmind", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_7lrgelz6", "author_patreon_flair": false, "author_premium": false, "awarders": [], "can_mod_post": false, "contest_mode": false, "created_utc": 1596921686, "domain": "self.stocks", "full_link": "https://www.reddit.com/r/stocks/comments/i672xq/cmcsa_vs_vzn_vs_att/", "gildings": {}, "id": "i672xq", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 8, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/stocks/comments/i672xq/cmcsa_vs_vzn_vs_att/", "pinned": false, "pwls": 6, "retrieved_on": 1596921698, "score": 1, "selftext": "What are your thoughts on the these 3 companies, as competitors, who will come out on top?\n\nIn terms of stock value, CMCSA seems so undervalued and seems to have everything needed to succeed and adapt to the future technological environment. In what ways can Verizon and ATT come out ahead of CMCSA?", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "stocks", "subreddit_id": "t5_2qjfk", "subreddit_subscribers": 784354, "subreddit_type": "public", "thumbnail": "self", "title": "CMCSA vs VZN vs ATT", "total_awards_received": 0, "treatment_tags": [], "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/stocks/comments/i672xq/cmcsa_vs_vzn_vs_att/", "whitelist_status": "all_ads", "wls": 6, "created": 1596918086.0}], [[], false, "flostat3ofmind", null, [], null, "text", "t2_7lrgelz6", false, false, [], false, false, 1596828297, "self.stocks", "https://www.reddit.com/r/stocks/comments/i5k9h9/cmcsa_vs_verizon_vs_att/", {}, "i5k9h9", false, false, false, false, false, true, false, "", [], "dark", "text", false, false, true, 0, 0, false, "all_ads", "/r/stocks/comments/i5k9h9/cmcsa_vs_verizon_vs_att/", false, 6, "moderator", 1596828308, 1, "[removed]", true, false, false, "stocks", "t5_2qjfk", 782950, "public", "self", "CMCSA vs. Verizon vs. ATT", 0, [], 1.0, "https://www.reddit.com/r/stocks/comments/i5k9h9/cmcsa_vs_verizon_vs_att/", "all_ads", 6, 1596824697.0, {"all_awardings": [], "allow_live_comments": false, "author": "flostat3ofmind", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_7lrgelz6", "author_patreon_flair": false, "author_premium": false, "awarders": [], "can_mod_post": false, "contest_mode": false, "created_utc": 1596828297, "domain": "self.stocks", "full_link": "https://www.reddit.com/r/stocks/comments/i5k9h9/cmcsa_vs_verizon_vs_att/", "gildings": {}, "id": "i5k9h9", "is_crosspostable": false, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": false, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 0, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/stocks/comments/i5k9h9/cmcsa_vs_verizon_vs_att/", "pinned": false, "pwls": 6, "removed_by_category": "moderator", "retrieved_on": 1596828308, "score": 1, "selftext": "[removed]", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "stocks", "subreddit_id": "t5_2qjfk", "subreddit_subscribers": 782950, "subreddit_type": "public", "thumbnail": "self", "title": "CMCSA vs. Verizon vs. ATT", "total_awards_received": 0, "treatment_tags": [], "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/stocks/comments/i5k9h9/cmcsa_vs_verizon_vs_att/", "whitelist_status": "all_ads", "wls": 6, "created": 1596824697.0}], [[], false, "stillness0072", null, [], null, "text", "t2_6xvi0anb", false, false, [], false, false, 1593215868, "self.stocks", "https://www.reddit.com/r/stocks/comments/hgj2cw/is_cmcsa_a_short_candidate/", {}, "hgj2cw", true, false, false, false, true, true, false, "", "tickerdiscussion", [], "612ee368-65e6-11e5-b53f-129e4297eb59", "Ticker Discussion", "dark", "text", false, false, true, 3, 0, false, "all_ads", "/r/stocks/comments/hgj2cw/is_cmcsa_a_short_candidate/", false, 6, 1593215869, 1, "With Covid affecting park attendence at Universal, as well as Cinmark,Cineworld,AMC,Odeon,UCI etc... not showing their movies cause of Universal studios breaking an unspoken rule with them. Not to mention the huge debt load Comcast has. Plus low short interest fee, it seems like a no brainer.", true, false, false, "stocks", "t5_2qjfk", 721030, "public", "self", "Is CMCSA a short candidate?", 0, [], 1.0, "https://www.reddit.com/r/stocks/comments/hgj2cw/is_cmcsa_a_short_candidate/", "all_ads", 6, 1593212268.0, {"all_awardings": [], "allow_live_comments": false, "author": "stillness0072", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_6xvi0anb", "author_patreon_flair": false, "author_premium": false, "awarders": [], "can_mod_post": false, "contest_mode": false, "created_utc": 1593215868, "domain": "self.stocks", "full_link": "https://www.reddit.com/r/stocks/comments/hgj2cw/is_cmcsa_a_short_candidate/", "gildings": {}, "id": "hgj2cw", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_css_class": "tickerdiscussion", "link_flair_richtext": [], "link_flair_template_id": "612ee368-65e6-11e5-b53f-129e4297eb59", "link_flair_text": "Ticker Discussion", "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 3, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/stocks/comments/hgj2cw/is_cmcsa_a_short_candidate/", "pinned": false, "pwls": 6, "retrieved_on": 1593215869, "score": 1, "selftext": "With Covid affecting park attendence at Universal, as well as Cinmark,Cineworld,AMC,Odeon,UCI etc... not showing their movies cause of Universal studios breaking an unspoken rule with them. Not to mention the huge debt load Comcast has. Plus low short interest fee, it seems like a no brainer.", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "stocks", "subreddit_id": "t5_2qjfk", "subreddit_subscribers": 721030, "subreddit_type": "public", "thumbnail": "self", "title": "Is CMCSA a short candidate?", "total_awards_received": 0, "treatment_tags": [], "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/stocks/comments/hgj2cw/is_cmcsa_a_short_candidate/", "whitelist_status": "all_ads", "wls": 6, "created": 1593212268.0}], [[], false, "Jumpingjellybeaner", null, [], null, "text", "t2_dmm04", false, false, [], false, false, 1592539365, "self.stocks", "https://www.reddit.com/r/stocks/comments/hbtph4/investment_advice/", {}, "hbtph4", true, false, false, false, true, true, false, "", [], "dark", "text", false, false, true, 4, 0, false, "all_ads", "/r/stocks/comments/hbtph4/investment_advice/", false, 6, 1592539365, 1, "Just left my old employer and need to diversify both my 401k and individual stock portfolio. Any advice would be appreciated!\n\nBA- 18 shares at $195\n\nBABA- 8 shares at $221\n\nCMCSA- 920 shares at $30.5\n\nILMN- 12 shares at $348\n\nLUV- 6 shares at $36\n\nMSFT- 8 shares at $185\n\nRTX- 80 shares at $64\n\nAlso have about $55k in a 401k Vanguard Target Date 2060 fund", true, false, false, "stocks", "t5_2qjfk", 709424, "public", "self", "Investment advice", 0, [], 1.0, "https://www.reddit.com/r/stocks/comments/hbtph4/investment_advice/", "all_ads", 6, 1592535765.0, {"all_awardings": [], "allow_live_comments": false, "author": "Jumpingjellybeaner", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_dmm04", "author_patreon_flair": false, "author_premium": false, "awarders": [], "can_mod_post": false, "contest_mode": false, "created_utc": 1592539365, "domain": "self.stocks", "full_link": "https://www.reddit.com/r/stocks/comments/hbtph4/investment_advice/", "gildings": {}, "id": "hbtph4", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 4, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/stocks/comments/hbtph4/investment_advice/", "pinned": false, "pwls": 6, "retrieved_on": 1592539365, "score": 1, "selftext": "Just left my old employer and need to diversify both my 401k and individual stock portfolio. Any advice would be appreciated!\n\nBA- 18 shares at $195\n\nBABA- 8 shares at $221\n\nCMCSA- 920 shares at $30.5\n\nILMN- 12 shares at $348\n\nLUV- 6 shares at $36\n\nMSFT- 8 shares at $185\n\nRTX- 80 shares at $64\n\nAlso have about $55k in a 401k Vanguard Target Date 2060 fund", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "stocks", "subreddit_id": "t5_2qjfk", "subreddit_subscribers": 709424, "subreddit_type": "public", "thumbnail": "self", "title": "Investment advice", "total_awards_received": 0, "treatment_tags": [], "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/stocks/comments/hbtph4/investment_advice/", "whitelist_status": "all_ads", "wls": 6, "created": 1592535765.0}], [[], false, "thrownupandaway123", null, [], null, "text", "t2_6z15wcoc", false, false, [], false, false, 1592539128, "self.stocks", "https://www.reddit.com/r/stocks/comments/hbtng9/portfolio_advice/", {}, "hbtng9", true, false, false, false, true, true, false, "", [], "dark", "text", false, false, true, 0, 0, false, "all_ads", "/r/stocks/comments/hbtng9/portfolio_advice/", false, 6, 1592539129, 1, "Just left my old employer and need to diversify both my 401k and individual stock portfolio. Any advice would be appreciated!\n\nBA- 18 shares at $195\n\nBABA- 8 shares at $221\n\nCMCSA- 920 shares at $30.5\n\nILMN- 12 shares at $348\n\nLUV- 6 shares at $36\n\nMSFT- 8 shares at $185\n\nRTX- 80 shares at $64\n\nAlso have about $55k in a 401k Vanguard Target Date 2060 fund,", true, false, false, "stocks", "t5_2qjfk", 709418, "public", "self", "Portfolio advice", 0, [], 1.0, "https://www.reddit.com/r/stocks/comments/hbtng9/portfolio_advice/", "all_ads", 6, 1592535528.0, {"all_awardings": [], "allow_live_comments": false, "author": "thrownupandaway123", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_6z15wcoc", "author_patreon_flair": false, "author_premium": false, "awarders": [], "can_mod_post": false, "contest_mode": false, "created_utc": 1592539128, "domain": "self.stocks", "full_link": "https://www.reddit.com/r/stocks/comments/hbtng9/portfolio_advice/", "gildings": {}, "id": "hbtng9", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 0, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/stocks/comments/hbtng9/portfolio_advice/", "pinned": false, "pwls": 6, "retrieved_on": 1592539129, "score": 1, "selftext": "Just left my old employer and need to diversify both my 401k and individual stock portfolio. Any advice would be appreciated!\n\nBA- 18 shares at $195\n\nBABA- 8 shares at $221\n\nCMCSA- 920 shares at $30.5\n\nILMN- 12 shares at $348\n\nLUV- 6 shares at $36\n\nMSFT- 8 shares at $185\n\nRTX- 80 shares at $64\n\nAlso have about $55k in a 401k Vanguard Target Date 2060 fund,", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "stocks", "subreddit_id": "t5_2qjfk", "subreddit_subscribers": 709418, "subreddit_type": "public", "thumbnail": "self", "title": "Portfolio advice", "total_awards_received": 0, "treatment_tags": [], "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/stocks/comments/hbtng9/portfolio_advice/", "whitelist_status": "all_ads", "wls": 6, "created": 1592535528.0}], [[], false, "EricZ0212", null, [], null, "text", "t2_2mfnp2c3", false, false, [], false, false, 1591662463, "self.stocks", "https://www.reddit.com/r/stocks/comments/gzc0d2/comcastcmcsa_good_to_invest_in/", {}, "gzc0d2", true, false, false, false, true, true, false, "", [], "dark", "text", false, false, true, 8, 0, false, "all_ads", "/r/stocks/comments/gzc0d2/comcastcmcsa_good_to_invest_in/", false, 6, 1591809489, 1, "Good balance sheet, owns NBC, xFinity, Universal studios, other companies, and holds shares in Hulus and smaller other companies. However, they have had the reputation for worst company in the US 2 years in a row along with their horrible customer support but their holdings are very profitable.  Room for improvement?", true, false, false, "stocks", "t5_2qjfk", 691805, "public", "self", "Comcast(CMCSA) good to invest in?", 0, [], 1.0, "https://www.reddit.com/r/stocks/comments/gzc0d2/comcastcmcsa_good_to_invest_in/", "all_ads", 6, 1591658863.0, {"all_awardings": [], "allow_live_comments": false, "author": "EricZ0212", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_2mfnp2c3", "author_patreon_flair": false, "author_premium": false, "awarders": [], "can_mod_post": false, "contest_mode": false, "created_utc": 1591662463, "domain": "self.stocks", "full_link": "https://www.reddit.com/r/stocks/comments/gzc0d2/comcastcmcsa_good_to_invest_in/", "gildings": {}, "id": "gzc0d2", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 8, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/stocks/comments/gzc0d2/comcastcmcsa_good_to_invest_in/", "pinned": false, "pwls": 6, "retrieved_on": 1591809489, "score": 1, "selftext": "Good balance sheet, owns NBC, xFinity, Universal studios, other companies, and holds shares in Hulus and smaller other companies. However, they have had the reputation for worst company in the US 2 years in a row along with their horrible customer support but their holdings are very profitable.  Room for improvement?", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "stocks", "subreddit_id": "t5_2qjfk", "subreddit_subscribers": 691805, "subreddit_type": "public", "thumbnail": "self", "title": "Comcast(CMCSA) good to invest in?", "total_awards_received": 0, "treatment_tags": [], "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/stocks/comments/gzc0d2/comcastcmcsa_good_to_invest_in/", "whitelist_status": "all_ads", "wls": 6, "created": 1591658863.0}], [[], false, "coolcomfort123", null, [], null, "text", "t2_2sj2vd1h", false, false, [], false, false, 1590930640, "self.stocks", "https://www.reddit.com/r/stocks/comments/gtyt9g/why_cable_providers_are_expected_to_survive_the/", {}, "gtyt9g", true, false, false, false, true, true, false, "", [], "dark", "text", false, false, true, 10, 0, false, "all_ads", "/r/stocks/comments/gtyt9g/why_cable_providers_are_expected_to_survive_the/", false, 6, 1590930641, 1, "https://finance.yahoo.com/news/why-cable-providers-will-survive-despite-rise-in-cordcutting-123513718.html\n\nCord-cutting is expected to accelerate through 2021, but according to a new analyst note from Wells Fargo, the financial consequences for U.S. cable providers will be limited.\n\nAccording to the report, subscriber losses will continue to climb the next few years with Comcast (CMCSA) expected to shed 1.37 million subscribers by 2021— up from previous estimates of 1 million.\n\n“We see cord-cutting as a secular trend that likely will kick into high gear during and on the other side of COVID-19,” Wells Fargo's Jennifer Fritzsche explained.", true, false, false, "stocks", "t5_2qjfk", 669293, "public", "self", "Why cable providers are expected to survive the rise in cord-cutting", 0, [], 1.0, "https://www.reddit.com/r/stocks/comments/gtyt9g/why_cable_providers_are_expected_to_survive_the/", "all_ads", 6, 1590927040.0, {"all_awardings": [], "allow_live_comments": false, "author": "coolcomfort123", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_2sj2vd1h", "author_patreon_flair": false, "author_premium": false, "awarders": [], "can_mod_post": false, "contest_mode": false, "created_utc": 1590930640, "domain": "self.stocks", "full_link": "https://www.reddit.com/r/stocks/comments/gtyt9g/why_cable_providers_are_expected_to_survive_the/", "gildings": {}, "id": "gtyt9g", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 10, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/stocks/comments/gtyt9g/why_cable_providers_are_expected_to_survive_the/", "pinned": false, "pwls": 6, "retrieved_on": 1590930641, "score": 1, "selftext": "https://finance.yahoo.com/news/why-cable-providers-will-survive-despite-rise-in-cordcutting-123513718.html\n\nCord-cutting is expected to accelerate through 2021, but according to a new analyst note from Wells Fargo, the financial consequences for U.S. cable providers will be limited.\n\nAccording to the report, subscriber losses will continue to climb the next few years with Comcast (CMCSA) expected to shed 1.37 million subscribers by 2021— up from previous estimates of 1 million.\n\n“We see cord-cutting as a secular trend that likely will kick into high gear during and on the other side of COVID-19,” Wells Fargo's Jennifer Fritzsche explained.", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "stocks", "subreddit_id": "t5_2qjfk", "subreddit_subscribers": 669293, "subreddit_type": "public", "thumbnail": "self", "title": "Why cable providers are expected to survive the rise in cord-cutting", "total_awards_received": 0, "treatment_tags": [], "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/stocks/comments/gtyt9g/why_cable_providers_are_expected_to_survive_the/", "whitelist_status": "all_ads", "wls": 6, "created": 1590927040.0}], [[], false, "coolcomfort123", null, [], null, "text", "t2_2sj2vd1h", false, false, [], false, false, 1590866839, "self.stocks", "https://www.reddit.com/r/stocks/comments/gtk4p8/data_show_why_hbo_maxs_slow_start_may_not_tell/", {}, "gtk4p8", true, false, false, false, true, true, false, "", [], "dark", "text", false, false, true, 8, 0, false, "all_ads", "/r/stocks/comments/gtk4p8/data_show_why_hbo_maxs_slow_start_may_not_tell/", false, 6, 1590866840, 1, "https://finance.yahoo.com/news/data-shows-why-hbo-maxs-slow-start-may-not-tell-the-whole-story-153606592.html\n\nAT&amp;T’s (T) HBO Max made its official entrance into the streaming wars on Wednesday — and day-one downloads have sparked a debate over how widely consumers are embracing the new platform.\n\nAccording to data from Sensor Tower, 87,000 users across Apple’s App Store and Google Play downloaded the HBO Max app on Wednesday. That is well below competitors like Quibi (CMCSA) and Disney+ (DIS) which nabbed 380,000 and 4 million initial mobile downloads, respectively.\n\nMeanwhile, a few observers suggest HBO Max committed a strategic blunder by not reaching a deal to be available at launch on popular platforms Roku (ROKU) and Amazon’s (AMZN) Fire TV.", true, false, false, "stocks", "t5_2qjfk", 668684, "public", "self", "Data show why HBO Max's slow start may not tell the whole story", 0, [], 1.0, "https://www.reddit.com/r/stocks/comments/gtk4p8/data_show_why_hbo_maxs_slow_start_may_not_tell/", "all_ads", 6, 1590863239.0, {"all_awardings": [], "allow_live_comments": false, "author": "coolcomfort123", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_2sj2vd1h", "author_patreon_flair": false, "author_premium": false, "awarders": [], "can_mod_post": false, "contest_mode": false, "created_utc": 1590866839, "domain": "self.stocks", "full_link": "https://www.reddit.com/r/stocks/comments/gtk4p8/data_show_why_hbo_maxs_slow_start_may_not_tell/", "gildings": {}, "id": "gtk4p8", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 8, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/stocks/comments/gtk4p8/data_show_why_hbo_maxs_slow_start_may_not_tell/", "pinned": false, "pwls": 6, "retrieved_on": 1590866840, "score": 1, "selftext": "https://finance.yahoo.com/news/data-shows-why-hbo-maxs-slow-start-may-not-tell-the-whole-story-153606592.html\n\nAT&amp;T’s (T) HBO Max made its official entrance into the streaming wars on Wednesday — and day-one downloads have sparked a debate over how widely consumers are embracing the new platform.\n\nAccording to data from Sensor Tower, 87,000 users across Apple’s App Store and Google Play downloaded the HBO Max app on Wednesday. That is well below competitors like Quibi (CMCSA) and Disney+ (DIS) which nabbed 380,000 and 4 million initial mobile downloads, respectively.\n\nMeanwhile, a few observers suggest HBO Max committed a strategic blunder by not reaching a deal to be available at launch on popular platforms Roku (ROKU) and Amazon’s (AMZN) Fire TV.", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "stocks", "subreddit_id": "t5_2qjfk", "subreddit_subscribers": 668684, "subreddit_type": "public", "thumbnail": "self", "title": "Data show why HBO Max's slow start may not tell the whole story", "total_awards_received": 0, "treatment_tags": [], "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/stocks/comments/gtk4p8/data_show_why_hbo_maxs_slow_start_may_not_tell/", "whitelist_status": "all_ads", "wls": 6, "created": 1590863239.0}], [[], false, "cruzerkk", null, [], null, "text", "t2_3zecaqca", false, false, [], false, false, 1588774727, "self.stocks", "https://www.reddit.com/r/stocks/comments/gekuv6/the_old_verizon_vs_comcast_bet_vz_vs_cmcsa/", {}, "gekuv6", true, false, false, false, true, true, false, "", [], "dark", "text", false, false, true, 0, 0, false, "all_ads", "/r/stocks/comments/gekuv6/the_old_verizon_vs_comcast_bet_vz_vs_cmcsa/", false, 6, 1588775467, 1, "I have some bucks to spare and am confused between the 2 (long term). Both of them are trading at fair prices, alhough it looks like there is more upside to purchasing CMCSA than to VZ (according to the analysts at least).\n\nI am a believer in Comcast's business model because of the way they do their business and because of the diversification factor. But as a consumer (who has used both their services) I have to go with Verizon as the better product.  \n\nIf you had to choose today, which one would you go for and why ? I just wanted to get some thoughts from fellow traders before making a final decision.", true, false, false, "stocks", "t5_2qjfk", 635501, "public", "self", "The old Verizon vs Comcast bet ! (VZ vs CMCSA) - CONFUSED", 0, [], 1.0, "https://www.reddit.com/r/stocks/comments/gekuv6/the_old_verizon_vs_comcast_bet_vz_vs_cmcsa/", "all_ads", 6, 1588771127.0, {"all_awardings": [], "allow_live_comments": false, "author": "cruzerkk", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_3zecaqca", "author_patreon_flair": false, "author_premium": false, "awarders": [], "can_mod_post": false, "contest_mode": false, "created_utc": 1588774727, "domain": "self.stocks", "full_link": "https://www.reddit.com/r/stocks/comments/gekuv6/the_old_verizon_vs_comcast_bet_vz_vs_cmcsa/", "gildings": {}, "id": "gekuv6", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 0, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/stocks/comments/gekuv6/the_old_verizon_vs_comcast_bet_vz_vs_cmcsa/", "pinned": false, "pwls": 6, "retrieved_on": 1588775467, "score": 1, "selftext": "I have some bucks to spare and am confused between the 2 (long term). Both of them are trading at fair prices, alhough it looks like there is more upside to purchasing CMCSA than to VZ (according to the analysts at least).\n\nI am a believer in Comcast's business model because of the way they do their business and because of the diversification factor. But as a consumer (who has used both their services) I have to go with Verizon as the better product.  \n\nIf you had to choose today, which one would you go for and why ? I just wanted to get some thoughts from fellow traders before making a final decision.", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "stocks", "subreddit_id": "t5_2qjfk", "subreddit_subscribers": 635501, "subreddit_type": "public", "thumbnail": "self", "title": "The old Verizon vs Comcast bet ! (VZ vs CMCSA) - CONFUSED", "total_awards_received": 0, "treatment_tags": [], "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/stocks/comments/gekuv6/the_old_verizon_vs_comcast_bet_vz_vs_cmcsa/", "whitelist_status": "all_ads", "wls": 6, "created": 1588771127.0}], [[], false, "jonsnow0276", null, [], null, "text", "t2_8ziy370", false, false, [], false, false, 1586974949, "self.stocks", "https://www.reddit.com/r/stocks/comments/g1xkw9/sports_with_no_fans/", {}, "g1xkw9", true, false, false, false, true, true, false, "", "discussion", [], "8acd2324-65e6-11e5-a263-122ab0778f8b", "Discussion", "dark", "text", false, false, true, 4, 0, false, "all_ads", "/r/stocks/comments/g1xkw9/sports_with_no_fans/", false, 6, 1587029987, 1, "I’m starting to get the feeling that sports will be played without fans when they return.. I don’t think the NFL will be played with fans.. what stocks will benefit from this? I was thinking\nCMCSA\nPENN\nVIAC (CBS)\nDish\nVZ\n\nI feel like more people will want to watch sports and stream them.. a lot of people like myself have season tickets and won’t be able to goto the games.. making me stay home to watch them. I mean you have to stay home regardless right now. What stocks do you think benefits from no fans in the stadiums?", true, false, false, "stocks", "t5_2qjfk", 600628, "public", "self", "Sports with no fans?", 0, [], "https://www.reddit.com/r/stocks/comments/g1xkw9/sports_with_no_fans/", "all_ads", 6, 1586971349.0, {"all_awardings": [], "allow_live_comments": false, "author": "jonsnow0276", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_8ziy370", "author_patreon_flair": false, "author_premium": false, "awarders": [], "can_mod_post": false, "contest_mode": false, "created_utc": 1586974949, "domain": "self.stocks", "full_link": "https://www.reddit.com/r/stocks/comments/g1xkw9/sports_with_no_fans/", "gildings": {}, "id": "g1xkw9", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_css_class": "discussion", "link_flair_richtext": [], "link_flair_template_id": "8acd2324-65e6-11e5-a263-122ab0778f8b", "link_flair_text": "Discussion", "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 4, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/stocks/comments/g1xkw9/sports_with_no_fans/", "pinned": false, "pwls": 6, "retrieved_on": 1587029987, "score": 1, "selftext": "I’m starting to get the feeling that sports will be played without fans when they return.. I don’t think the NFL will be played with fans.. what stocks will benefit from this? I was thinking\nCMCSA\nPENN\nVIAC (CBS)\nDish\nVZ\n\nI feel like more people will want to watch sports and stream them.. a lot of people like myself have season tickets and won’t be able to goto the games.. making me stay home to watch them. I mean you have to stay home regardless right now. What stocks do you think benefits from no fans in the stadiums?", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "stocks", "subreddit_id": "t5_2qjfk", "subreddit_subscribers": 600628, "subreddit_type": "public", "thumbnail": "self", "title": "Sports with no fans?", "total_awards_received": 0, "treatment_tags": [], "url": "https://www.reddit.com/r/stocks/comments/g1xkw9/sports_with_no_fans/", "whitelist_status": "all_ads", "wls": 6, "created": 1586971349.0}], [[], false, "josueluis", null, [], null, "text", "t2_q5sy9p5", false, false, [], false, false, 1585755241, "self.stocks", "https://www.reddit.com/r/stocks/comments/ft1z1o/opinions_on_comcast/", {}, "ft1z1o", true, false, false, false, true, true, false, "", [], "dark", "text", false, false, true, 3, 0, false, "all_ads", "/r/stocks/comments/ft1z1o/opinions_on_comcast/", false, 6, 1585755247, 1, "Trying to diversify my portfolio and am considering CMCSA as its near its low. Thoughts?\n\nMy portfolio: AAPL, ALLY, CAT, DIS, HD, JNJ, KO, MA, MSFT, SQ, T", true, false, false, "stocks", "t5_2qjfk", 575061, "public", "self", "Opinions on Comcast?", 0, "https://www.reddit.com/r/stocks/comments/ft1z1o/opinions_on_comcast/", "all_ads", 6, 1585751641.0, {"all_awardings": [], "allow_live_comments": false, "author": "josueluis", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_q5sy9p5", "author_patreon_flair": false, "author_premium": false, "awarders": [], "can_mod_post": false, "contest_mode": false, "created_utc": 1585755241, "domain": "self.stocks", "full_link": "https://www.reddit.com/r/stocks/comments/ft1z1o/opinions_on_comcast/", "gildings": {}, "id": "ft1z1o", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 3, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/stocks/comments/ft1z1o/opinions_on_comcast/", "pinned": false, "pwls": 6, "retrieved_on": 1585755247, "score": 1, "selftext": "Trying to diversify my portfolio and am considering CMCSA as its near its low. Thoughts?\n\nMy portfolio: AAPL, ALLY, CAT, DIS, HD, JNJ, KO, MA, MSFT, SQ, T", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "stocks", "subreddit_id": "t5_2qjfk", "subreddit_subscribers": 575061, "subreddit_type": "public", "thumbnail": "self", "title": "Opinions on Comcast?", "total_awards_received": 0, "url": "https://www.reddit.com/r/stocks/comments/ft1z1o/opinions_on_comcast/", "whitelist_status": "all_ads", "wls": 6, "created": 1585751641.0}], [[], false, "bigbear0083", null, [], null, "text", "t2_eaak0", false, true, [], false, false, 1585053005, "self.stocks", "https://www.reddit.com/r/stocks/comments/fo4bfr/todays_stock_market_news_tuesday_march_24th_2020/", {}, "fo4bfr", true, false, false, false, true, true, false, "", "news", [], "866eb162-65e6-11e5-a903-1252b640afe9", "News", "dark", "text", false, false, true, 1, 0, false, "all_ads", "/r/stocks/comments/fo4bfr/todays_stock_market_news_tuesday_march_24th_2020/", false, 6, 1585053006, 1, "#Good morning traders and investors of the r/stocks sub! Welcome to Tuesday. Here is your stock market news this AM-\n\n*****\n\n#[Today's Top Headlines for Tuesday, March 24th, 2020](https://www.cnbc.com/2020/03/24/5-things-to-know-before-the-stock-market-opens-march-24-2020.html)\n\n*****\n\n&gt; * U.S. stock futures hit their 5% “limit up” levels Tuesday as top Senate and White House officials neared a $2 trillion deal to rescue the economy from the coronavirus crisis. The exchange-traded fund that tracks the Dow, which has no curbs, was up just over 5%. The Dow Jones Industrial Average closed down 582 points or 3.1% on Monday after the Senate failed for a second time in less than 24 hours to advance the stimulus bill. Investors were more concerned about talks on Capitol Hill than encouraged by the Federal Reserve’s announcement Monday of an open-ended asset purchase program. As of Monday’s close, the lowest since November 2016, the Dow was down 37% from its record highs last month.\n\n*****\n\n&gt; * Senate Democrats expressed optimism about reaching a relief deal from the coronavirus crisis after negotiations with Trump administration officials stretched late into the night. Treasury Secretary Steven Mnuchin said talks were set to resume Tuesday morning. House Speaker Nancy Pelosi came out with House Democrats’ $2.5 trillion bill. Also on Monday, President Donald Trump suggested he wants to urge businesses to reopen, sooner rather than later. “I’m not looking at months,” the president said.\n\n*****\n\n&gt; * As Trump considers relaxing some coronavirus restrictions, the U.K. issued a stay-at-home order, starting Tuesday, allowing only essential trips. All nonessential public buildings and places are closed, ranging from libraries to churches, outdoor gyms and playgrounds. All social events including weddings and baptisms are also prohibited. In China, the two-month lockdown of most of Hubei province was lifted. However, Wuhan, the city in the province where the coronavirus originated in December, remains locked down until April 8.\n\n*****\n\n&gt; * Global coronavirus cases approached 384,000 with 16,594 deaths and nearly 102,000 recoveries, according to Johns Hopkins University data. China, at about 81,500 cases, has just 21% of the infections around the world as the spread in European nations and the United States continued to spike higher. Italy, the hardest-hit country outside China, saw cases rise to nearly 64,000. The death toll in Italy of 6,077 was nearly double that of China and the highest in the world. Cases in America increased to 46,450 with 593 deaths. Nearly half the U.S. cases and the highest U.S. death toll of 188 were in New York state.\n\n*****\n\n&gt; * Top U.S. airlines are working on plans for a possible voluntary shutdown of nearly all U.S. passenger flights, industry and federal officials told The Wall Street Journal. The government was also talking about ordering such a move, the Journal said. The carriers and the White House have made no final decisions.Demand for air travel has plummeted as many states have issued formal stay-at-home orders or just encouraged people not to leave their homes. Social-distancing has become the new way of life as the world grapples with containing the coronavirus pandemic.\n\n*****\n\n#STOCK FUTURES CURRENTLY:\n######(**[CLICK HERE FOR STOCK FUTURES CHARTS!](http://finviz.com/futures.ashx)**)\n\n*****\n\n#YESTERDAY'S MARKET MAP:\n######(**[CLICK HERE FOR YESTERDAY'S MARKET MAP!](https://i.imgur.com/cfaAWsy.png)**)\n\n*****\n\n#TODAY'S MARKET MAP:\n######(**[CLICK HERE FOR TODAY'S MARKET MAP!](https://finviz.com/map.ashx)**)\n\n*****\n\n#YESTERDAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR YESTERDAY'S S&amp;P SECTORS CHART!](https://i.imgur.com/kH00D11.png)**)\n\n*****\n\n#TODAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR TODAY'S S&amp;P SECTORS CHART!](https://finviz.com/groups.ashx)**)\n\n*****\n\n#TODAY'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR TODAY'S ECONOMIC CALENDAR!](https://i.imgur.com/SjUA7ht.png)**)\n\n*****\n\n#THIS WEEK'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR THIS WEEK'S ECONOMIC CALENDAR!](https://i.imgur.com/8KStTCM.png)**)\n\n*****\n\n#THIS WEEK'S UPCOMING IPO'S:\n######(**[CLICK HERE FOR THIS WEEK'S UPCOMING IPO'S!](https://i.imgur.com/aUBjBP0.png)**)\n\n*****\n\n#THIS WEEK'S EARNINGS CALENDAR:\n($MU $LULU $NKE $PAYS $SIG $PAYX $GME $ONTX $CSIQ $JT $INFO $GO $WGO $LX $SCVL $SNX $HOME $BWAY $AEYE $KBH $RKDA $FDS $ERJ $PRGS $OPGN $SCS $NEOG $PUMP $HYRE $AIR $MYOS $LIQT $SAIC $SCWX $ESLT $VTSI $OCGN $QIWI $WOR $TNP $HTHT)\n######(**[CLICK HERE FOR THIS WEEK'S EARNINGS CALENDAR!](https://i.imgur.com/K1bLbWQ.png)**)\n\n*****\n\n#THIS MORNING'S PRE-MARKET EARNINGS CALENDAR:\n($INFO $LX $AEYE $NEOG $TNP $CMCM $VTSI $YJ $QIWI $ECOR $EH $DMAC $PANL $FENG $CANG)\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS CALENDAR!](https://i.imgur.com/XJRjXat.jpg)**)\n\n*****\n\n#EARNINGS RELEASES BEFORE THE OPEN TODAY:\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS RELEASES!](https://i.imgur.com/OOVZiVo.png)**)\n\n*****\n\n#EARNINGS RELEASES AFTER THE CLOSE TODAY:\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS RELEASES!](https://i.imgur.com/joftHtT.png)**)\n\n*****\n\n#YESTERDAY'S ANALYST UPGRADES/DOWNGRADES:\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #1!](https://i.imgur.com/irtsavz.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #2!](https://i.imgur.com/AIITRE6.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #3!](https://i.imgur.com/RlkMxl6.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #4!](https://i.imgur.com/trFFJU3.png)**)\n\n\n*****\n\n#YESTERDAY'S INSIDER TRADING FILINGS:\n######(**[CLICK HERE FOR YESTERDAY'S INSIDER TRADING FILINGS!](https://i.imgur.com/MxOAol4.png)**)\n\n*****\n\n#TODAY'S DIVIDEND CALENDAR:\n######(**[CLICK HERE FOR TODAY'S DIVIDEND CALENDAR!](https://i.imgur.com/BgKOWeP.png)**)\n\n\n*****\n\n#THIS MORNING'S MOST ACTIVE TRENDING TICKERS:\n\n* NVAX\n* ZM\n* NFLX\n* PENN\n* NUGT\n* MAIN\n* IVR\n* SCPH\n* NKE\n* BDTX\n\n*****\n\n#THIS MORNING'S STOCK NEWS MOVERS:\n\n######(**source: [cnbc.com](https://www.cnbc.com/2020/03/24/stocks-making-the-biggest-moves-in-the-premarket-chevron-twitter-amazon-mondelez-more.html)**)\n\n*****\n\n&gt; **Chevron (CVX)** – Chevron plans to cut capital spending plans for 2020 by 20%, and will suspend its share buyback program. But the energy giant said it has no plans to cut its dividend.\n\n&gt; #**STOCK SYMBOL:** CVX\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=CVX&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/CVX)**)\n\n*****\n\n&gt; **IHS Markit (INFO)** – The financial information provider reported quarterly profit of 66 cents per share, 2 cents a share above estimates. Revenue came in essentially in line with forecasts. The company said it still expects double-digit earnings growth this year and that it has a strong plan to deal with changing market dynamics.\n\n&gt; #**STOCK SYMBOL:** INFO\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=INFO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/INFO)**)\n\n*****\n\n&gt; **Twitter (TWTR)** – Twitter withdrew its guidance, as ad sales decline due to the coronavirus outbreak. Twitter noted, however, that the virus outbreak has also resulted in a jump in active users.\n\n&gt; #**STOCK SYMBOL:** TWTR\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=TWTR&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/TWTR)**)\n\n*****\n\n&gt; **Amazon.com (AMZN)** – Amazon suspended more than 3,900 selling accounts on its U.S. platform for violating its fair pricing policies. The retail giant said it is sharing information with federal and state regulators about sellers it thinks are engaging in price gouging.\n\n&gt; #**STOCK SYMBOL:** AMZN\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=AMZN&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/AMZN)**)\n\n*****\n\n&gt; **Mondelez (MDLZ)** – Mondelez will increase hourly wages by $2 and also pay a $125 weekly bonus for sales representatives. The snack maker is among those dealing with a surge in demand for food and household products.\n\n&gt; #**STOCK SYMBOL:** MDLZ\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=MDLZ&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/MDLZ)**)\n\n*****\n\n&gt; **Comcast (CMCSA)** – The NBCUniversal and CNBC parent has been assuming that the Tokyo Olympics will be postponed, according to The Wall Street Journal quoting people familiar with the matter. Comcast and Discovery Communications (DISCA) hold the rights to the 2020 Olympics.\n\n&gt; #**STOCK SYMBOL:** CMCSA\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=CMCSA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/CMCSA)**)\n\n*****\n\n&gt; **Gilead Sciences (GILD)** – The drugmaker won the U.S. Food and Drug Administration’s “orphan drug” designation for its experimental drug remdesivir, considered a promising possible treatment for the coronavirus. The designation allows a seven-year period of marketing exclusivity as well as tax and other incentives.\n\n&gt; #**STOCK SYMBOL:** GILD\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=GILD&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/GILD)**)\n\n*****\n\n&gt; **Dollar Tree (DLTR)** – Dollar Tree was upgraded to “outperform” from “market perform” at Telsey Advisory Group, saying the discount retailer is well-positioned to attract traffic and gain market share and that its product mix is a good one for the current challenging environment.\n\n&gt; #**STOCK SYMBOL:** DLTR\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=DLTR&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/DLTR)**)\n\n*****\n\n&gt; **Spotify (SPOT)** – Spotify was upgraded to “market perform” from “underperform at Bernstein, which said the music streaming service’s stock price has come down significantly while the firm’s outlook for Spotify has not changed much.\n\n&gt; #**STOCK SYMBOL:** SPOT\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=SPOT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/SPOT)**)\n\n*****\n\n&gt; **Perrigo (PRGO)** – Perrigo was upgraded to “overweight” from “neutral” at JPMorgan Chase, which thinks the drug maker will benefit from increased demand for flu treatments.\n\n&gt; #**STOCK SYMBOL:** PRGO\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=PRGO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/PRGO)**)\n\n*****\n\n&gt; **Deckers (DECK)** – The footwear maker was upgraded to “outperform” from “neutral” at Wedbush, which bases its upgrade on conversations with management that give it confidence the company can weather the current global economic shock.\n\n&gt; #**STOCK SYMBOL:** DECK\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=DECK&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/DECK)**)\n\n*****\n\n#**DISCUSS!**\n\nWhat's on everyone's radar for today's trading day ahead here at r/stocks?\n\n*****\n\n# **I hope you all have an excellent trading day ahead today on this Tuesday, March 24th, 2020! :)**", true, false, false, "stocks", "t5_2qjfk", 557400, "public", "self", "Today's Stock Market News [Tuesday, March 24th, 2020]", 0, "https://www.reddit.com/r/stocks/comments/fo4bfr/todays_stock_market_news_tuesday_march_24th_2020/", "all_ads", 6, 1585049405.0, {"all_awardings": [], "allow_live_comments": false, "author": "bigbear0083", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_eaak0", "author_patreon_flair": false, "author_premium": true, "awarders": [], "can_mod_post": false, "contest_mode": false, "created_utc": 1585053005, "domain": "self.stocks", "full_link": "https://www.reddit.com/r/stocks/comments/fo4bfr/todays_stock_market_news_tuesday_march_24th_2020/", "gildings": {}, "id": "fo4bfr", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_css_class": "news", "link_flair_richtext": [], "link_flair_template_id": "866eb162-65e6-11e5-a903-1252b640afe9", "link_flair_text": "News", "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 1, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/stocks/comments/fo4bfr/todays_stock_market_news_tuesday_march_24th_2020/", "pinned": false, "pwls": 6, "retrieved_on": 1585053006, "score": 1, "selftext": "#Good morning traders and investors of the r/stocks sub! Welcome to Tuesday. Here is your stock market news this AM-\n\n*****\n\n#[Today's Top Headlines for Tuesday, March 24th, 2020](https://www.cnbc.com/2020/03/24/5-things-to-know-before-the-stock-market-opens-march-24-2020.html)\n\n*****\n\n&gt; * U.S. stock futures hit their 5% “limit up” levels Tuesday as top Senate and White House officials neared a $2 trillion deal to rescue the economy from the coronavirus crisis. The exchange-traded fund that tracks the Dow, which has no curbs, was up just over 5%. The Dow Jones Industrial Average closed down 582 points or 3.1% on Monday after the Senate failed for a second time in less than 24 hours to advance the stimulus bill. Investors were more concerned about talks on Capitol Hill than encouraged by the Federal Reserve’s announcement Monday of an open-ended asset purchase program. As of Monday’s close, the lowest since November 2016, the Dow was down 37% from its record highs last month.\n\n*****\n\n&gt; * Senate Democrats expressed optimism about reaching a relief deal from the coronavirus crisis after negotiations with Trump administration officials stretched late into the night. Treasury Secretary Steven Mnuchin said talks were set to resume Tuesday morning. House Speaker Nancy Pelosi came out with House Democrats’ $2.5 trillion bill. Also on Monday, President Donald Trump suggested he wants to urge businesses to reopen, sooner rather than later. “I’m not looking at months,” the president said.\n\n*****\n\n&gt; * As Trump considers relaxing some coronavirus restrictions, the U.K. issued a stay-at-home order, starting Tuesday, allowing only essential trips. All nonessential public buildings and places are closed, ranging from libraries to churches, outdoor gyms and playgrounds. All social events including weddings and baptisms are also prohibited. In China, the two-month lockdown of most of Hubei province was lifted. However, Wuhan, the city in the province where the coronavirus originated in December, remains locked down until April 8.\n\n*****\n\n&gt; * Global coronavirus cases approached 384,000 with 16,594 deaths and nearly 102,000 recoveries, according to Johns Hopkins University data. China, at about 81,500 cases, has just 21% of the infections around the world as the spread in European nations and the United States continued to spike higher. Italy, the hardest-hit country outside China, saw cases rise to nearly 64,000. The death toll in Italy of 6,077 was nearly double that of China and the highest in the world. Cases in America increased to 46,450 with 593 deaths. Nearly half the U.S. cases and the highest U.S. death toll of 188 were in New York state.\n\n*****\n\n&gt; * Top U.S. airlines are working on plans for a possible voluntary shutdown of nearly all U.S. passenger flights, industry and federal officials told The Wall Street Journal. The government was also talking about ordering such a move, the Journal said. The carriers and the White House have made no final decisions.Demand for air travel has plummeted as many states have issued formal stay-at-home orders or just encouraged people not to leave their homes. Social-distancing has become the new way of life as the world grapples with containing the coronavirus pandemic.\n\n*****\n\n#STOCK FUTURES CURRENTLY:\n######(**[CLICK HERE FOR STOCK FUTURES CHARTS!](http://finviz.com/futures.ashx)**)\n\n*****\n\n#YESTERDAY'S MARKET MAP:\n######(**[CLICK HERE FOR YESTERDAY'S MARKET MAP!](https://i.imgur.com/cfaAWsy.png)**)\n\n*****\n\n#TODAY'S MARKET MAP:\n######(**[CLICK HERE FOR TODAY'S MARKET MAP!](https://finviz.com/map.ashx)**)\n\n*****\n\n#YESTERDAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR YESTERDAY'S S&amp;P SECTORS CHART!](https://i.imgur.com/kH00D11.png)**)\n\n*****\n\n#TODAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR TODAY'S S&amp;P SECTORS CHART!](https://finviz.com/groups.ashx)**)\n\n*****\n\n#TODAY'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR TODAY'S ECONOMIC CALENDAR!](https://i.imgur.com/SjUA7ht.png)**)\n\n*****\n\n#THIS WEEK'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR THIS WEEK'S ECONOMIC CALENDAR!](https://i.imgur.com/8KStTCM.png)**)\n\n*****\n\n#THIS WEEK'S UPCOMING IPO'S:\n######(**[CLICK HERE FOR THIS WEEK'S UPCOMING IPO'S!](https://i.imgur.com/aUBjBP0.png)**)\n\n*****\n\n#THIS WEEK'S EARNINGS CALENDAR:\n($MU $LULU $NKE $PAYS $SIG $PAYX $GME $ONTX $CSIQ $JT $INFO $GO $WGO $LX $SCVL $SNX $HOME $BWAY $AEYE $KBH $RKDA $FDS $ERJ $PRGS $OPGN $SCS $NEOG $PUMP $HYRE $AIR $MYOS $LIQT $SAIC $SCWX $ESLT $VTSI $OCGN $QIWI $WOR $TNP $HTHT)\n######(**[CLICK HERE FOR THIS WEEK'S EARNINGS CALENDAR!](https://i.imgur.com/K1bLbWQ.png)**)\n\n*****\n\n#THIS MORNING'S PRE-MARKET EARNINGS CALENDAR:\n($INFO $LX $AEYE $NEOG $TNP $CMCM $VTSI $YJ $QIWI $ECOR $EH $DMAC $PANL $FENG $CANG)\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS CALENDAR!](https://i.imgur.com/XJRjXat.jpg)**)\n\n*****\n\n#EARNINGS RELEASES BEFORE THE OPEN TODAY:\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS RELEASES!](https://i.imgur.com/OOVZiVo.png)**)\n\n*****\n\n#EARNINGS RELEASES AFTER THE CLOSE TODAY:\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS RELEASES!](https://i.imgur.com/joftHtT.png)**)\n\n*****\n\n#YESTERDAY'S ANALYST UPGRADES/DOWNGRADES:\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #1!](https://i.imgur.com/irtsavz.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #2!](https://i.imgur.com/AIITRE6.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #3!](https://i.imgur.com/RlkMxl6.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #4!](https://i.imgur.com/trFFJU3.png)**)\n\n\n*****\n\n#YESTERDAY'S INSIDER TRADING FILINGS:\n######(**[CLICK HERE FOR YESTERDAY'S INSIDER TRADING FILINGS!](https://i.imgur.com/MxOAol4.png)**)\n\n*****\n\n#TODAY'S DIVIDEND CALENDAR:\n######(**[CLICK HERE FOR TODAY'S DIVIDEND CALENDAR!](https://i.imgur.com/BgKOWeP.png)**)\n\n\n*****\n\n#THIS MORNING'S MOST ACTIVE TRENDING TICKERS:\n\n* NVAX\n* ZM\n* NFLX\n* PENN\n* NUGT\n* MAIN\n* IVR\n* SCPH\n* NKE\n* BDTX\n\n*****\n\n#THIS MORNING'S STOCK NEWS MOVERS:\n\n######(**source: [cnbc.com](https://www.cnbc.com/2020/03/24/stocks-making-the-biggest-moves-in-the-premarket-chevron-twitter-amazon-mondelez-more.html)**)\n\n*****\n\n&gt; **Chevron (CVX)** – Chevron plans to cut capital spending plans for 2020 by 20%, and will suspend its share buyback program. But the energy giant said it has no plans to cut its dividend.\n\n&gt; #**STOCK SYMBOL:** CVX\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=CVX&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/CVX)**)\n\n*****\n\n&gt; **IHS Markit (INFO)** – The financial information provider reported quarterly profit of 66 cents per share, 2 cents a share above estimates. Revenue came in essentially in line with forecasts. The company said it still expects double-digit earnings growth this year and that it has a strong plan to deal with changing market dynamics.\n\n&gt; #**STOCK SYMBOL:** INFO\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=INFO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/INFO)**)\n\n*****\n\n&gt; **Twitter (TWTR)** – Twitter withdrew its guidance, as ad sales decline due to the coronavirus outbreak. Twitter noted, however, that the virus outbreak has also resulted in a jump in active users.\n\n&gt; #**STOCK SYMBOL:** TWTR\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=TWTR&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/TWTR)**)\n\n*****\n\n&gt; **Amazon.com (AMZN)** – Amazon suspended more than 3,900 selling accounts on its U.S. platform for violating its fair pricing policies. The retail giant said it is sharing information with federal and state regulators about sellers it thinks are engaging in price gouging.\n\n&gt; #**STOCK SYMBOL:** AMZN\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=AMZN&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/AMZN)**)\n\n*****\n\n&gt; **Mondelez (MDLZ)** – Mondelez will increase hourly wages by $2 and also pay a $125 weekly bonus for sales representatives. The snack maker is among those dealing with a surge in demand for food and household products.\n\n&gt; #**STOCK SYMBOL:** MDLZ\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=MDLZ&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/MDLZ)**)\n\n*****\n\n&gt; **Comcast (CMCSA)** – The NBCUniversal and CNBC parent has been assuming that the Tokyo Olympics will be postponed, according to The Wall Street Journal quoting people familiar with the matter. Comcast and Discovery Communications (DISCA) hold the rights to the 2020 Olympics.\n\n&gt; #**STOCK SYMBOL:** CMCSA\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=CMCSA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/CMCSA)**)\n\n*****\n\n&gt; **Gilead Sciences (GILD)** – The drugmaker won the U.S. Food and Drug Administration’s “orphan drug” designation for its experimental drug remdesivir, considered a promising possible treatment for the coronavirus. The designation allows a seven-year period of marketing exclusivity as well as tax and other incentives.\n\n&gt; #**STOCK SYMBOL:** GILD\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=GILD&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/GILD)**)\n\n*****\n\n&gt; **Dollar Tree (DLTR)** – Dollar Tree was upgraded to “outperform” from “market perform” at Telsey Advisory Group, saying the discount retailer is well-positioned to attract traffic and gain market share and that its product mix is a good one for the current challenging environment.\n\n&gt; #**STOCK SYMBOL:** DLTR\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=DLTR&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/DLTR)**)\n\n*****\n\n&gt; **Spotify (SPOT)** – Spotify was upgraded to “market perform” from “underperform at Bernstein, which said the music streaming service’s stock price has come down significantly while the firm’s outlook for Spotify has not changed much.\n\n&gt; #**STOCK SYMBOL:** SPOT\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=SPOT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/SPOT)**)\n\n*****\n\n&gt; **Perrigo (PRGO)** – Perrigo was upgraded to “overweight” from “neutral” at JPMorgan Chase, which thinks the drug maker will benefit from increased demand for flu treatments.\n\n&gt; #**STOCK SYMBOL:** PRGO\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=PRGO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/PRGO)**)\n\n*****\n\n&gt; **Deckers (DECK)** – The footwear maker was upgraded to “outperform” from “neutral” at Wedbush, which bases its upgrade on conversations with management that give it confidence the company can weather the current global economic shock.\n\n&gt; #**STOCK SYMBOL:** DECK\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=DECK&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/DECK)**)\n\n*****\n\n#**DISCUSS!**\n\nWhat's on everyone's radar for today's trading day ahead here at r/stocks?\n\n*****\n\n# **I hope you all have an excellent trading day ahead today on this Tuesday, March 24th, 2020! :)**", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "stocks", "subreddit_id": "t5_2qjfk", "subreddit_subscribers": 557400, "subreddit_type": "public", "thumbnail": "self", "title": "Today's Stock Market News [Tuesday, March 24th, 2020]", "total_awards_received": 0, "url": "https://www.reddit.com/r/stocks/comments/fo4bfr/todays_stock_market_news_tuesday_march_24th_2020/", "whitelist_status": "all_ads", "wls": 6, "created": 1585049405.0}], [[], false, "vancouversportsbro", null, [], null, "text", "t2_hdf3u", false, false, [], false, false, 1583938189, "self.stocks", "https://www.reddit.com/r/stocks/comments/fgyavx/is_comcast_cmcsa_a_buy/", {}, "fgyavx", true, false, false, false, true, true, false, "", [], "dark", "text", false, false, true, 0, 0, false, "all_ads", "/r/stocks/comments/fgyavx/is_comcast_cmcsa_a_buy/", false, 6, 1583938194, 1, "Amid all of this market crisis, wondering if this is a good buy under 40 USD?\n\nI'm not a believer in cable innovating over the next ten years, but it seems like right now you can't go wrong with picking this up under 40.", true, false, false, "stocks", "t5_2qjfk", 529338, "public", "self", "Is Comcast CMCSA A Buy?", 0, "https://www.reddit.com/r/stocks/comments/fgyavx/is_comcast_cmcsa_a_buy/", "all_ads", 6, 1583934589.0, {"all_awardings": [], "allow_live_comments": false, "author": "vancouversportsbro", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_hdf3u", "author_patreon_flair": false, "author_premium": false, "awarders": [], "can_mod_post": false, "contest_mode": false, "created_utc": 1583938189, "domain": "self.stocks", "full_link": "https://www.reddit.com/r/stocks/comments/fgyavx/is_comcast_cmcsa_a_buy/", "gildings": {}, "id": "fgyavx", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 0, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/stocks/comments/fgyavx/is_comcast_cmcsa_a_buy/", "pinned": false, "pwls": 6, "retrieved_on": 1583938194, "score": 1, "selftext": "Amid all of this market crisis, wondering if this is a good buy under 40 USD?\n\nI'm not a believer in cable innovating over the next ten years, but it seems like right now you can't go wrong with picking this up under 40.", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "stocks", "subreddit_id": "t5_2qjfk", "subreddit_subscribers": 529338, "subreddit_type": "public", "thumbnail": "self", "title": "Is Comcast CMCSA A Buy?", "total_awards_received": 0, "url": "https://www.reddit.com/r/stocks/comments/fgyavx/is_comcast_cmcsa_a_buy/", "whitelist_status": "all_ads", "wls": 6, "created": 1583934589.0}], [[], false, "BigEppyW", null, [], null, "text", "t2_8erj6zi", false, false, [], false, false, 1579801667, "self.stocks", "https://www.reddit.com/r/stocks/comments/eswl6i/cmcsa_is_falling/", {}, "eswl6i", true, false, false, false, true, true, false, "", [], "dark", "text", false, false, true, 4, 0, false, "all_ads", "/r/stocks/comments/eswl6i/cmcsa_is_falling/", false, 6, 1579801671, 1, "Why is this falling. Is it about the Supreme Court case? I thought this was known information.", true, false, false, "stocks", "t5_2qjfk", 473988, "public", "self", "CMCSA is falling", 0, "https://www.reddit.com/r/stocks/comments/eswl6i/cmcsa_is_falling/", "all_ads", 6, 1579798067.0, {"all_awardings": [], "allow_live_comments": false, "author": "BigEppyW", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_8erj6zi", "author_patreon_flair": false, "author_premium": false, "awarders": [], "can_mod_post": false, "contest_mode": false, "created_utc": 1579801667, "domain": "self.stocks", "full_link": "https://www.reddit.com/r/stocks/comments/eswl6i/cmcsa_is_falling/", "gildings": {}, "id": "eswl6i", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 4, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/stocks/comments/eswl6i/cmcsa_is_falling/", "pinned": false, "pwls": 6, "retrieved_on": 1579801671, "score": 1, "selftext": "Why is this falling. Is it about the Supreme Court case? I thought this was known information.", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "stocks", "subreddit_id": "t5_2qjfk", "subreddit_subscribers": 473988, "subreddit_type": "public", "thumbnail": "self", "title": "CMCSA is falling", "total_awards_received": 0, "url": "https://www.reddit.com/r/stocks/comments/eswl6i/cmcsa_is_falling/", "whitelist_status": "all_ads", "wls": 6, "created": 1579798067.0}]]