[[[], false, "shipping_addict", null, [], null, "text", "t2_3nmjirla", false, false, [], false, false, 1608609680, "self.stocks", "https://www.reddit.com/r/stocks/comments/khxmi5/portfolio_advice/", {}, "khxmi5", true, false, false, false, true, true, false, "", "advice", [], "823be0a6-65e6-11e5-9784-125ee764bc01", "Advice", "dark", "text", false, false, true, 13, 0, false, "all_ads", "/r/stocks/comments/khxmi5/portfolio_advice/", false, 6, 1608609690, 1, "Hi there everyone! So I'm 23 and I've been lurking on here for over a year now and it wasn't till this year that I actually made a profit. I recently opened another brokerage account and that'll be the account where I hold everything for 10+ years and in the past 2 years I've learned quite a bit just going with the stock market.\n\nI'd like some thoughts/advice on the stocks I'm currently holding, most of these stocks I'll be moving to my new brokerage account. \n\nMy plan for 2021 is to continue putting money into stocks I already own and after some time get rid of whatever few stocks that aren't doing too well, or just holding them. I also plan to invest in a few more ETF's but since they're a bit pricey rn I'm not sure which ones to invest in.\n\nOriginal Brokerage Account:\n\nDIS (1) +$56.17\n\nNFLX (1) +$188.62\n\nHON (1) +$42.40\n\nAAPL (7) +$257.88\n\nMSFT (1) +$31.99\n\nCOST (1) +$54.20\n\nAMZN ($589 partial share) +86.55\n\nCTAS (1) +$116.02\n\nGOOG (partial share) +$20.06\n\nFDX ($46 partial share) +$4.61\n\nBLFS (10) +$104.69\n\nVLRS (10) +$12.93\n\nGDRX (4) -$14.32\n\nDGX (1) -$1.59\n\nSGC (4) -$11.64\n\nQCLN (3) +$35.37\n\nPAYX (1) +$4.89\n\nHD (1) -$5.88\n\nLOW (1) +$2.81\n\nBJ (2) -$6.82\n\nSCHN (3) +$16.53\n\nADP (1) +$2.85\n\nAGI (free)\n\nZNGA (free)\n\nSWN (free)\n\n\nNew Brokerage Account:\n\nAAPL (1) +$4.19\n\nABBV (2) +$7.80\n\nALB (1) +$8.07\n\nAMZN ($127 partial share) +2.52\n\nBEP (1) +$0.14\n\nENPH (2) +$105.56\n\nMMEDF (84) +$8.40\n\nNIO (10) +$30.02\n\nNTDOY (3) +$24.14\n\nPLTR (4) -$3.05\n\nSOL (25) +$111.00\n\nSQ (1) +$28.26\n\nWM (1) -$0.71\n\nWMT ($122 partial share) -2.87\n\nETF's:\n\nICLN (8) +$36.00\n\nKGRN (5) +27.10\n\nROBO (1) +3.33\n\nSBIO (2) +7.78\n\nTAN (2) +50.84", true, false, false, "stocks", "t5_2qjfk", 981859, "public", "self", "Portfolio advice?", 0, [], 1.0, "https://www.reddit.com/r/stocks/comments/khxmi5/portfolio_advice/", "all_ads", 6, 1608606080.0, {"all_awardings": [], "allow_live_comments": false, "author": "shipping_addict", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_3nmjirla", "author_patreon_flair": false, "author_premium": false, "awarders": [], "can_mod_post": false, "contest_mode": false, "created_utc": 1608609680, "domain": "self.stocks", "full_link": "https://www.reddit.com/r/stocks/comments/khxmi5/portfolio_advice/", "gildings": {}, "id": "khxmi5", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_css_class": "advice", "link_flair_richtext": [], "link_flair_template_id": "823be0a6-65e6-11e5-9784-125ee764bc01", "link_flair_text": "Advice", "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 13, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/stocks/comments/khxmi5/portfolio_advice/", "pinned": false, "pwls": 6, "retrieved_on": 1608609690, "score": 1, "selftext": "Hi there everyone! So I'm 23 and I've been lurking on here for over a year now and it wasn't till this year that I actually made a profit. I recently opened another brokerage account and that'll be the account where I hold everything for 10+ years and in the past 2 years I've learned quite a bit just going with the stock market.\n\nI'd like some thoughts/advice on the stocks I'm currently holding, most of these stocks I'll be moving to my new brokerage account. \n\nMy plan for 2021 is to continue putting money into stocks I already own and after some time get rid of whatever few stocks that aren't doing too well, or just holding them. I also plan to invest in a few more ETF's but since they're a bit pricey rn I'm not sure which ones to invest in.\n\nOriginal Brokerage Account:\n\nDIS (1) +$56.17\n\nNFLX (1) +$188.62\n\nHON (1) +$42.40\n\nAAPL (7) +$257.88\n\nMSFT (1) +$31.99\n\nCOST (1) +$54.20\n\nAMZN ($589 partial share) +86.55\n\nCTAS (1) +$116.02\n\nGOOG (partial share) +$20.06\n\nFDX ($46 partial share) +$4.61\n\nBLFS (10) +$104.69\n\nVLRS (10) +$12.93\n\nGDRX (4) -$14.32\n\nDGX (1) -$1.59\n\nSGC (4) -$11.64\n\nQCLN (3) +$35.37\n\nPAYX (1) +$4.89\n\nHD (1) -$5.88\n\nLOW (1) +$2.81\n\nBJ (2) -$6.82\n\nSCHN (3) +$16.53\n\nADP (1) +$2.85\n\nAGI (free)\n\nZNGA (free)\n\nSWN (free)\n\n\nNew Brokerage Account:\n\nAAPL (1) +$4.19\n\nABBV (2) +$7.80\n\nALB (1) +$8.07\n\nAMZN ($127 partial share) +2.52\n\nBEP (1) +$0.14\n\nENPH (2) +$105.56\n\nMMEDF (84) +$8.40\n\nNIO (10) +$30.02\n\nNTDOY (3) +$24.14\n\nPLTR (4) -$3.05\n\nSOL (25) +$111.00\n\nSQ (1) +$28.26\n\nWM (1) -$0.71\n\nWMT ($122 partial share) -2.87\n\nETF's:\n\nICLN (8) +$36.00\n\nKGRN (5) +27.10\n\nROBO (1) +3.33\n\nSBIO (2) +7.78\n\nTAN (2) +50.84", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "stocks", "subreddit_id": "t5_2qjfk", "subreddit_subscribers": 981859, "subreddit_type": "public", "thumbnail": "self", "title": "Portfolio advice?", "total_awards_received": 0, "treatment_tags": [], "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/stocks/comments/khxmi5/portfolio_advice/", "whitelist_status": "all_ads", "wls": 6, "created": 1608606080.0}], [[], false, "bigbear0083", null, [], null, "text", "t2_eaak0", false, false, [], false, false, 1608395945, "self.stocks", "https://www.reddit.com/r/stocks/comments/kgb1nl/wall_street_week_ahead_for_the_trading_week/", {}, "kgb1nl", true, false, false, false, true, true, false, "", "news", [], "866eb162-65e6-11e5-a903-1252b640afe9", "News", "dark", "text", false, false, false, 6, 0, false, "all_ads", "/r/stocks/comments/kgb1nl/wall_street_week_ahead_for_the_trading_week/", false, "self", {"enabled": false, "images": [{"id": "XjG27aew-tMIICQr38p_kVijnrxJB6PE728Hc0mgCmM", "resolutions": [{"height": 66, "url": "https://external-preview.redd.it/sQSmel0kIeBWhh5utQuD-XC4NWFaCN-ZHKZ3iY8aXVA.png?width=108&amp;crop=smart&amp;auto=webp&amp;s=686f0624fb268c78102cb9600741d9aff2ade844", "width": 108}, {"height": 133, "url": "https://external-preview.redd.it/sQSmel0kIeBWhh5utQuD-XC4NWFaCN-ZHKZ3iY8aXVA.png?width=216&amp;crop=smart&amp;auto=webp&amp;s=74e4ba9d8110e40d400db22d199d7a58a64e7a33", "width": 216}, {"height": 197, "url": "https://external-preview.redd.it/sQSmel0kIeBWhh5utQuD-XC4NWFaCN-ZHKZ3iY8aXVA.png?width=320&amp;crop=smart&amp;auto=webp&amp;s=edb4aeca8cdc62fb031599becd9fc222157afdd8", "width": 320}, {"height": 394, "url": "https://external-preview.redd.it/sQSmel0kIeBWhh5utQuD-XC4NWFaCN-ZHKZ3iY8aXVA.png?width=640&amp;crop=smart&amp;auto=webp&amp;s=becd389617c4ea80999bba4b2d947bcc7a1978c9", "width": 640}, {"height": 592, "url": "https://external-preview.redd.it/sQSmel0kIeBWhh5utQuD-XC4NWFaCN-ZHKZ3iY8aXVA.png?width=960&amp;crop=smart&amp;auto=webp&amp;s=aa2c4804bea8404f019f3a44214fe3dea51a09a7", "width": 960}, {"height": 666, "url": "https://external-preview.redd.it/sQSmel0kIeBWhh5utQuD-XC4NWFaCN-ZHKZ3iY8aXVA.png?width=1080&amp;crop=smart&amp;auto=webp&amp;s=b15bbce605a079926d431c911b95e10d60f0f0ed", "width": 1080}], "source": {"height": 761, "url": "https://external-preview.redd.it/sQSmel0kIeBWhh5utQuD-XC4NWFaCN-ZHKZ3iY8aXVA.png?auto=webp&amp;s=99c2d393257e2c6d0c6b557901e2341e3379647c", "width": 1234}, "variants": {}}]}, 6, 1608398169, 3, "Good Saturday morning to all of you here on r/stocks. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning December 21st, 2020.\n\n# **Wall Street strategists see stocks gaining 9% in 2021 after a possible speed bump to start the year  - [(Source)](https://www.cnbc.com/2020/12/18/wall-street-strategists-see-stocks-gaining-9percent-in-2021-after-a-possible-speed-bump-to-start-the-year.html)**\n*****\n&gt; The stock market appears set on rising into 2021 — a year expected to see some return to normalcy, above trend economic growth and a higher stock market, according to Wall Street strategists.\n*****\n&gt; Even with this year’s sharp sell-off, the S&amp;P 500 is notching a near 15% gain for 2020. For 2021, many strategists expect another year of double-digit gains.\n*****\n&gt; Those in CNBC’s survey expect an average 2021 year-end target 4,056, or about a 9.5% gain from current levels. But some strategists, like Fundstrat’s Tom Lee, expect a rally more in line with 2020. Lee sees a surge in the S&amp;P to 4,300 from its current level near 3,700.\n*****\n&gt; Vaccines are expected to liberate individuals from pandemic restrictions and in turn, free the economy as 2021 progresses. Work from home should shift back to work at the office; movies will be shown in theaters; diners will eat inside restaurants, and large numbers of people may no longer be afraid to travel.\n*****\n&gt; But the road to that second half scenario is not without bumps. As the virus spreads and hospitalizations are at a record, the economy is showing signs of slowing. The labor market is weakening and weekly unemployment claims have surged to September levels, as restaurants and other businesses shut down or cutback because of the pandemic.\n*****\n&gt; “The shutdowns are going to be very targeted. It’s nothing like what you saw in the spring,” said Ethan Harris, head of global economics research at Bank of America. “It’s going to eat away at the economy in the next few months. You come in with this big loss of momentum to start the year off. Then you look out to the spring and there are ... reasons for optimism.”\n*****\n&gt; Paralleling that view of the economy is the expectation among stock strategists that the market could hit a rough patch early in the year before heading higher.\n*****\n&gt; # The week ahead\n&gt; Stocks in the past week were higher, with the S&amp;P 500 up 1.3% at 3,709, near a record high in Friday trading. Heading into the holiday-shortened Christmas week, traders will be watching the shakeout from the massive S&amp;P 500 rebalancing that came with Tesla’s entry to the index. Tesla first trades as a part of the S&amp;P on Monday morning.\n*****\n&gt; “We’ll see whether or not there’s selling of Tesla after the fact. Investors had to buy Tesla coming in, so we may see selling of Tesla once it’s absorbed within the S&amp;P,” said Quincy Krosby, chief market strategist at Prudential Financial. Index investors and funds that own the entire S&amp;P 500 would reduce holdings of other stocks to make room for Tesla, and that trading could make for a volatile Monday morning.\n*****\n&gt; Krosby said stocks should tilt higher into the year-end, unless Congress fails to come up with a stimulus package or there are any surprise setbacks for the Covid vaccines. Congress was still sparring over a package Friday. “At this point, the vaccines are stimulus,” she said.\n*****\n&gt; Strategists expect a relatively quiet week for stocks, and the bond market is also expected to be subdued, as investors finish up year-end trades, following last Wednesday’s Fed meeting. There is housing data Tuesday and Wednesday, and jobless claims and durable goods Thursday.\n*****\n&gt; Then of course, there is the focus on the new year.\n*****\n&gt; # First-quarter speed bump\n&gt; “The first quarter is typically the toughest from a GDP perspective,” said Michael Arone, chief investment strategist at State Street Global Advisors. He said the earnings season will begin and there’s the potential for some negative outlooks. “I think we’re due for a correction at some point in the first quarter.” Arone expects a 5% to 10% pullback and says the stock market may have pulled forward some of its gains in 2020.\n*****\n&gt; Fundstrat’s Lee, who was one of the first to call the March rebound, says he’s looking for a 10% correction between February and April, before the market recovers and surges higher.\n*****\n&gt; There is a major wild card looming for the market in the early days of the new year. Polls show the Jan. 5 Georgia Senate elections are very close and have the potential to shift control of the Senate. Political strategists say it’s more likely the GOP will retain control, winning one or both seats, but if there is a surprise upset by Democrats, it could shift the political agenda dramatically.\n*****\n&gt; If Democrats win, each party would have 50 Senate seats, and Vice President-elect Kamala Harris would cast any tie-breaker votes.\n*****\n&gt; “The January 5th runoff in Georgia is an important event for the market, and right now it’s close. It’s important because of the consequences. The expectations are if the Democrats win, the market will sell off,” said Krosby.\n*****\n&gt; But that could be a short-lived reaction since the market would also see the potential for a bigger stimulus package from Democrats.\n*****\n&gt; “But I think as the fiscal stimulus rolls out, and it’s pretty clear you’re going to be at the high end of the range, I think the market will like that. Everyone always talks about how the markets don’t like a progressive agenda, but they do like fiscal stimulus,” said Bank of America’s Harris.\n*****\n&gt; Whether it gets a lot of stimulus or not so much, the economy is still expected to rebound.\n*****\n&gt; In an environment where the economy is recovering and central bank policy is easy, strategists expect cyclical stocks will do well as the market looks forward to the second half of the year. By then, many millions should be vaccinated and the economy should be growing.\n*****\n&gt; “Given the fiscal and monetary policy, low rates and eventual end of the pandemic, it’s hard to call for something terrible happening at least from a market perspective,” said Arone.\n*****\n&gt; Arone said investors still need to hold stocks with strong organic growth rates as well as cyclical names that will do better in a recovery. Lee said he favors industrials, energy and discretionary sectors for 2021, but he also still likes Big Tech with strong earnings, like Apple and Alphabet. He expects a shakeout in some of the stay-at-home stocks, particularly those that don’t have solid earnings streams.\n*****\n&gt; The virus will continue to drive the economy over the next year, but the difference in 2021 is that vaccines are expected to be distributed to the point where they could favorably impact the economy starting in the second quarter. Harris said the economy will get a boost once hospitalizations and the death rate fall from high levels.\n*****\n&gt; He expects first-quarter growth will come in at about 1% but by the second quarter, growth should bounce to 7%.\n*****\n&gt; In the CNBC/Moody’s Analytics survey of economists, forecasts for 2021 growth average 4.4%, after an expected decline of 3.5% this year.\n*****\n&gt; If Congress approves a stimulus package this year and another next year, that should give a substantial boost to the economy. Harris said stimulus of $500 billion to $1 trillion is equal to about 2.5% to 4.5% of GDP.\n*****\n&gt; “If you put stimulus like that into the economy that’s open, that’s a big boost,” Harris said.\n*****\n&gt; Economists are looking forward to a period in 2021 where the recovering economy could boost inflation above the Fed’s 2% target, but it is not expected to stay at that level. But even so, strategists look to cyclical names in energy and materials to do well in that environment. Bank of America strategists have already identified a group of stocks that do well in an inflationary period that are outperforming some of those that don’t.\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/LhgmNdV.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/KSkp1c5.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/sWMhkZ4.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.postimg.cc/brpytRb3/econcal1.png))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/D6dCoUA.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/BYpbNxT.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/xL78HsG.png)**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/nE072Rq.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/DwRa0FB.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/HtN5m6b.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/cvJ3eBi.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/Ed1Hvv8.png))**\n###### **([CLICK HERE FOR THE CHART LINK #3!](https://i.imgur.com/whYpZrV.png))**\n\n*****\n\n&gt; # An Overbought World\n\n&gt; The majority of global equity markets tracked in our Global Macro Dashboard found a short-term bottom at some point in late October including the US. As shown below, of the 23 ETFs tracking each of these countries' equity markets, nearly all are up double digits since the end of October. A dozen have risen over 20% and Brazil (EWZ) has risen more than any other country, gaining over 40%. China (MCHI), on the other hand, is the only hold out as it has risen just 3.44% over the past month and a half. Given these moves, most of these ETFs are overbought as defined as trading at least one standard deviation above their 50-DMAs. Only Hong Kong (EWH) and China (MCHI) are not overbought by this measure while India (INDA) is currently the most overbought ETF trading 1.92 standard deviations from its 50-DMA. That is even though it is at the low end of the performance range of these country ETFs listed. Top-performing Brazil, on the other hand, is the second most overbought ETF trading 1.85 standard deviations above its 50-day. In percentage terms, Brazil is also the ETF trading the furthest above its 50-DMA.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/121820-GMD.png))**\n\n&gt; In the charts below, we show the trading range charts of each of these ETFs over the past six months. As shown, most are fairly elevated at or near some of the highest levels of the past six months. With that being said, there are some country ETFs that have seen a bit of a drift lower in recent days and weeks. For example, France (EWQ), Hong Kong (EWH), and Singapore (EWS) have all made a move lower within their respective trading ranges recently even though they are still overbought. Similarly, Sweden (EWD) has been more or less trading sideways since late November. The same had been true for Switzerland (EWL) and Norway (ENOR) until they began to break out to the upside in recent days. Click here to view Bespoke's premium membership options for our best research available.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/121820-GMD-Charts.png))**\n\n*****\n\n&gt; # Leading Indicators Positive\n\n&gt; Leading Economic Indicators for the month of November came in higher than expected this morning, rising 0.6% versus estimates for an increase of 0.5%. One way we like to track the index of Leading Economic Indicators is to compare its ratio vs the index of Coincident Economic Indicators. The chart below shows the monthly ratio going back to 1959 with recessions highlighted in gray.\n\n&gt; If you aren't familiar with this ratio, it tends to rise during economic expansions and then roll over in advance of recessions. Then, towards the end of the recession, the ratio bottoms out and starts to improve. Even ahead of the current recession, the LEI/CEI ratio peaked in September 2018. While the pace of the decline wasn't nearly as steep as it was heading into prior recessions, the weakness in the ratio suggests that the economy was already at risk of a slowdown before the COVID outbreak. Who knows? If COVID never happened, maybe the US economy would have experienced a recession at some point in 2020 anyway.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/121820-LEICEI.png))**\n\n&gt; While it's a bit hard to see in the chart above, as the shorter-term chart of the LEI/CEI ratio below shows, November's reading isn't far from the pre-recession highs reached 26 months ago. Why is this important? For starters, at 26 months, the current streak without a new high isn't even the longest we have seen since the end of the financial crisis. The longest streak without a new high was 27 months from mid-2011 through mid-2013. Therefore, if the ratio rises again next month and makes a new high, it will be tied with that prior streak, one which didn't even result in a recession. More importantly, though, in every prior recession since 1960, the LEI/CEI ratio has never been this close to a new high and still in a recession. This means one of two things - either the LEI/CEI ratio has become flawed or the recession that began in February has been over for months.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/121820-LEICEI-Shorter-Term.png))**\n\n*****\n\n&gt; # Real Santa Claus Rally\n\n&gt; Stock Trader’s Almanac founder and creator, Yale Hirsch, discovered and named the Santa Claus Rally in the 1972 in the Almanac and coined the phrase: “If Santa Claus should fail to call, bears may come to Broad and Wall.”\n\n&gt; The “Santa Claus Rally” begins on the open on Christmas Eve day December 24and lasts until the second trading day of 2021. Average S&amp;P 500 gains over this seven trading-day range since 1969 are a respectable 1.3%. This is our first indicator for the market in the New Year. Years when the Santa Claus Rally (SCR) has failed to materialize are often flat or down.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://64.media.tumblr.com/3322e79e3993ba91f3cdc2c8998bb304/c0018ed75496c55e-24/s500x750/c30f76e8944ab933165b8e4605df1949e55c1e8a.jpg))**\n\n&gt; The last six times SCR (the last five trading days of the year and the first two trading days of the New Year) has not occurred were followed by three flat years (1994, 2004 and 2015) and two nasty bear markets (2000 and 2008) and a mild bear that ended in February 2016. As Yale Hirsch’s now famous line states, “If Santa Claus should fail to call, bears may come to Broad and Wall.”\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://64.media.tumblr.com/95573b80c952987ce6cddf016781c869/c0018ed75496c55e-6b/s500x750/2ac5dfda390dff518e0caa07098761d86191d1e3.jpg))**\n\n*****\n\n&gt; # VIX Run Above 20 Tops 200 Days\n\n&gt; With today's close, the VIX has now stuck above 20 for 207 trading days and counting. That marks the fourth-longest streak since the inception of the volatility index, and is approaching the late-1990s and early-2000s record runs. The index was above 20 for 239 trading days through the end of June 1999, and 236 trading days through May 8th, 2003. Of course, from 2008 to December 21st of 2009, the VIX was over 20 for 331 trading days (more than a year).\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/121520-VIX-Streaks.png))**\n\n&gt; Surprisingly, the current VIX streak has had an average reading higher than the two longer streaks in 1999 and 2003. The average 32.0 reading over its course so far is second only to the streak recorded over the global financial crisis. It's also interesting to note that at this stage in the streak (207 trading days), the current run has a higher reading than the three streaks which actually lasted longer.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/121520-VIX-Levels.png))**\n\n*****\n\n&gt; # Wretched Retail Sales\n\n&gt; If Congress was looking for any evidence that additional relief for Americans was needed, the November Retail Sales report should provide some ammunition. At the headline level, Retail Sales fell 1.1%, which was nearly four times the decline of consensus forecasts. Stripping out Autos and Gas, the numbers were just as bad. As if that wasn’t enough, October’s report was also revised significantly lower dropping from a gain of 0.3% at the headline level to a decline of 0.1%. Adding it all together, Retail Sales for November were 1.5% lower than what was originally reported in October’s report.\n\n&gt; Breadth in this month’s report was also weak. Of the thirteen sectors that comprise the total pie, all but three of them were lower on the month. If you were expecting a new sweater this Christmas, don’t hold your breath as sales of Clothing were down close to 7%. Other big decliners included Bars &amp; Restaurants (-3.99%) and Electronics &amp; Appliances (-3.49%). With more cities imposing restrictions on activity, sales at Gas Stations also declined 2.41%. Were it not for the historic declines we saw earlier this year, drops of this magnitude would be considered pretty steep, but after the COVID shutdowns, nothing is a surprise anymore. Not every aspect of the Retail Sales report was weak, though. Bright spots included Food &amp; Beverage Stores, Building Materials, and Online– all sectors you would expect to see hold up well as Americans hunker down.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/table.png))**\n\n&gt; The characteristics behind the total level of sales have changed markedly in the post-COVID world. In our just-released B.I.G. Tips report, we looked at these changing dynamics to highlight the groups that have been the biggest winners and losers from the shifts.\n\n*****\n\n&gt; # Chart of the Year\n\n&gt; Stocks continue to surprise to the upside, with the Russell 2000 Index (small caps) and the Nasdaq making new all-time highs on Tuesday. The S&amp;P 500 Index, a chip shot from new highs, already has made 30 new highs so far this year. “One thing that surprises many investors is new highs happen in clusters that can last a decade or more,” explained LPL Financial Chief Market Strategist Ryan Detrick. “Given that this cluster of new highs is only seven years old, history would suggest that we don’t bet against several more years of new highs.”\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/12/12.16.20-Blog-Chart-1.png?ssl=1))**\n\n&gt; One of the more amazing charts (and our friend Sam Ro at Yahoo! Finance called this the chart of the year) is how this new bull market has tracked the 2009 bull market. We’ve been sharing this chart for months now, noting if things continued to track 2009, then significant gains could be in store and sure enough that has played out. Here’s the catch, continued strength could still be in store, as 2009 continued to gain the next few months from this point forward.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/12/12.16.20-Blog-Chart-2.png?ssl=1))**\n\n&gt; Lastly, will Santa come in December? We discussed this in detail at the start of the month in Big Gains Steal From Santa, but the truth of the matter is the S&amp;P 500 Index is flat on average half way through the month and nearly all of the impressive December gains take place the second half of the month.\n\n&gt; As shown in the LPL Chart of the Day, if Santa is going to come in 2020, now is the time for the reindeer to get ready and for stocks to potentially bounce.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/12/12.16.20-Blog-Chart-3.png?ssl=1))**\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/DwRa0FB.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/BvRiIU8.png))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 12.21.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.postimg.cc/nc9RmtFS/er122120am.png))\n\n&gt; # ***Monday 12.21.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK!](https://i.postimg.cc/8k0XsCSr/er122120pm.png))\n\n*****\n\n&gt; # ***Tuesday  12.22.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.postimg.cc/8k0XsCSr/er122120pm.png))\n\n&gt; # ***Tuesday 12.22.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.postimg.cc/5tbnDYwD/er122320am.png))\n\n*****\n\n&gt; # ***Wednesday 12.23.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n&gt; # ***Wednesday 12.23.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n*****\n\n&gt; # ***Thursday 12.24.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n&gt; # ***Thursday 12.24.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n*****\n\n&gt; # ***Friday 12.25.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!]())\nNONE. (U.S. MARKETS CLOSED IN OBSERVANCE OF CHRISTMAS DAY.)\n\n*****\n\n&gt; # ***Friday 12.25.20 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\nNONE. (U.S. MARKETS CLOSED IN OBSERVANCE OF CHRISTMAS DAY.)\n\n*****\n\n&gt; # CarMax, Inc. $98.25\n**CarMax, Inc. (KMX)** is confirmed to report earnings at approximately 6:50 AM ET on Tuesday, December 22, 2020. The consensus earnings estimate is $1.11 per share on revenue of $5.00 billion and the Earnings Whisper ® number is $1.31 per share. Investor sentiment going into the company's earnings release has 58% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 6.73% with revenue increasing by 4.38%. Short interest has decreased by 20.1% since the company's last earnings release while the stock has drifted lower by 1.8% from its open following the earnings release to be 12.1% above its 200 day moving average of $87.65. Overall earnings estimates have been revised higher since the company's last earnings release. On Friday, December 18, 2020 there was some notable buying of 2,340 contracts of the $110.00 call expiring on Friday, January 15, 2021. Option traders are pricing in a 3.6% move on earnings and the stock has averaged a 5.1% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=KMX&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # FactSet Research Systems, Inc. $347.03\n**FactSet Research Systems, Inc. (FDS)** is confirmed to report earnings at approximately 7:00 AM ET on Monday, December 21, 2020. The consensus earnings estimate is $2.74 per share on revenue of $387.88 million and the Earnings Whisper ® number is $2.85 per share. Investor sentiment going into the company's earnings release has 52% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 6.20% with revenue increasing by 5.79%. Short interest has decreased by 16.2% since the company's last earnings release while the stock has drifted higher by 0.6% from its open following the earnings release to be 10.7% above its 200 day moving average of $313.43. Overall earnings estimates have been revised higher since the company's last earnings release. Option traders are pricing in a 5.7% move on earnings and the stock has averaged a 6.5% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=FDS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Paychex, Inc. $96.92\n**Paychex, Inc. (PAYX)** is confirmed to report earnings at approximately 8:30 AM ET on Wednesday, December 23, 2020. The consensus earnings estimate is $0.66 per share on revenue of $952.93 million and the Earnings Whisper ® number is $0.69 per share. Investor sentiment going into the company's earnings release has 39% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 5.71% with revenue decreasing by 3.81%. Short interest has decreased by 20.2% since the company's last earnings release while the stock has drifted higher by 20.1% from its open following the earnings release to be 28.3% above its 200 day moving average of $75.55. Overall earnings estimates have been revised higher since the company's last earnings release. On Thursday, December 17, 2020 there was some notable buying of 1,108 contracts of the $110.00 call expiring on Friday, June 18, 2021. Option traders are pricing in a 4.6% move on earnings and the stock has averaged a 2.4% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=PAYX&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Cintas Corporation $354.35\n**Cintas Corporation (CTAS)** is confirmed to report earnings at approximately 8:30 AM ET on Tuesday, December 22, 2020. The consensus earnings estimate is $2.18 per share on revenue of $1.76 billion and the Earnings Whisper ® number is $2.35 per share. Investor sentiment going into the company's earnings release has 47% expecting an earnings beat The company's guidance was for earnings of $2.00 to $2.20 per share. Consensus estimates are for earnings to decline year-over-year by 3.96% with revenue decreasing by 4.54%. Short interest has decreased by 44.9% since the company's last earnings release while the stock has drifted higher by 4.2% from its open following the earnings release to be 24.5% above its 200 day moving average of $284.59. Overall earnings estimates have been revised higher since the company's last earnings release. Option traders are pricing in a 5.5% move on earnings and the stock has averaged a 4.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=CTAS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Neogen Corp. $80.80\n**Neogen Corp. (NEOG)** is confirmed to report earnings at approximately 8:45 AM ET on Tuesday, December 22, 2020. The consensus earnings estimate is $0.33 per share on revenue of $115.45 million and the Earnings Whisper ® number is $0.34 per share. Investor sentiment going into the company's earnings release has 50% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 6.45% with revenue increasing by 7.09%. Short interest has decreased by 40.6% since the company's last earnings release while the stock has drifted higher by 5.0% from its open following the earnings release to be 13.5% above its 200 day moving average of $71.22. Overall earnings estimates have been revised lower since the company's last earnings release. Option traders are pricing in a 6.5% move on earnings and the stock has averaged a 5.0% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=NEOG&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Vince Holding Corp. $6.40\n**Vince Holding Corp. (VNCE)** is confirmed to report earnings at approximately 4:05 PM ET on Monday, December 21, 2020. The consensus estimate is for a loss of $0.26 per share on revenue of $65.90 million. Investor sentiment going into the company's earnings release has 43% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 135.62% with revenue decreasing by 23.73%. Short interest has decreased by 29.3% since the company's last earnings release while the stock has drifted higher by 14.3% from its open following the earnings release. Overall earnings estimates have been revised lower since the company's last earnings release.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=VNCE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # HEICO Corporation $133.09\n**HEICO Corporation (HEI)** is confirmed to report earnings at approximately 4:15 PM ET on Monday, December 21, 2020. The consensus earnings estimate is $0.43 per share on revenue of $426.40 million and the Earnings Whisper ® number is $0.48 per share. Investor sentiment going into the company's earnings release has 54% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 30.65% with revenue decreasing by 21.26%. The stock has drifted higher by 22.1% from its open following the earnings release to be 30.3% above its 200 day moving average of $102.18. Overall earnings estimates have been revised higher since the company's last earnings release. Option traders are pricing in a 6.3% move on earnings and the stock has averaged a 6.0% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=HEI&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Enerpac Tool Group $22.81\n**Enerpac Tool Group (EPAC)** is confirmed to report earnings at approximately 8:30 AM ET on Monday, December 21, 2020. The consensus earnings estimate is $0.09 per share on revenue of $122.54 million and the Earnings Whisper ® number is $0.11 per share. Investor sentiment going into the company's earnings release has 26% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 25.00% with revenue decreasing by 16.45%. Short interest has decreased by 8.7% since the company's last earnings release while the stock has drifted higher by 32.3% from its open following the earnings release to be 20.7% above its 200 day moving average of $18.89. Overall earnings estimates have been revised lower since the company's last earnings release. Option traders are pricing in a 9.3% move on earnings and the stock has averaged a 5.0% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=EPAC&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Calavo Growers Inc. $72.08\n**Calavo Growers Inc. (CVGW)** is confirmed to report earnings at approximately 4:00 PM ET on Monday, December 21, 2020. The consensus earnings estimate is $0.62 per share on revenue of $253.00 million and the Earnings Whisper ® number is $0.69 per share. Investor sentiment going into the company's earnings release has 51% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 37.78% with revenue decreasing by 13.41%. Short interest has decreased by 38.3% since the company's last earnings release while the stock has drifted higher by 20.2% from its open following the earnings release to be 14.2% above its 200 day moving average of $63.12. Overall earnings estimates have been revised lower since the company's last earnings release. Option traders are pricing in a 8.7% move on earnings and the stock has averaged a 5.8% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=CVGW&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # cbdMD, Inc. $2.62\n**cbdMD, Inc. (YCBD)** is confirmed to report earnings at approximately 4:05 PM ET on Tuesday, December 22, 2020. Investor sentiment going into the company's earnings release has 32% expecting an earnings beat. The stock has drifted lower by 20.1% from its open following the earnings release to be 23.0% above its 200 day moving average of $2.13. Overall earnings estimates have been revised lower since the company's last earnings release. The stock has averaged a 23.7% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=YCBD&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/stocks.", true, false, false, "stocks", "t5_2qjfk", 977689, "public", "self", "Wall Street Week Ahead for the trading week beginning December 21st, 2020", 0, [], 1.0, "https://www.reddit.com/r/stocks/comments/kgb1nl/wall_street_week_ahead_for_the_trading_week/", "all_ads", 6, 1608392345.0, {"all_awardings": [], "allow_live_comments": false, "author": "bigbear0083", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_eaak0", "author_patreon_flair": false, "author_premium": false, "awarders": [], "can_mod_post": false, "contest_mode": false, "created_utc": 1608395945, "domain": "self.stocks", "full_link": "https://www.reddit.com/r/stocks/comments/kgb1nl/wall_street_week_ahead_for_the_trading_week/", "gildings": {}, "id": "kgb1nl", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_css_class": "news", "link_flair_richtext": [], "link_flair_template_id": "866eb162-65e6-11e5-a903-1252b640afe9", "link_flair_text": "News", "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": false, "num_comments": 6, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/stocks/comments/kgb1nl/wall_street_week_ahead_for_the_trading_week/", "pinned": false, "post_hint": "self", "preview": {"enabled": false, "images": [{"id": "XjG27aew-tMIICQr38p_kVijnrxJB6PE728Hc0mgCmM", "resolutions": [{"height": 66, "url": "https://external-preview.redd.it/sQSmel0kIeBWhh5utQuD-XC4NWFaCN-ZHKZ3iY8aXVA.png?width=108&amp;crop=smart&amp;auto=webp&amp;s=686f0624fb268c78102cb9600741d9aff2ade844", "width": 108}, {"height": 133, "url": "https://external-preview.redd.it/sQSmel0kIeBWhh5utQuD-XC4NWFaCN-ZHKZ3iY8aXVA.png?width=216&amp;crop=smart&amp;auto=webp&amp;s=74e4ba9d8110e40d400db22d199d7a58a64e7a33", "width": 216}, {"height": 197, "url": "https://external-preview.redd.it/sQSmel0kIeBWhh5utQuD-XC4NWFaCN-ZHKZ3iY8aXVA.png?width=320&amp;crop=smart&amp;auto=webp&amp;s=edb4aeca8cdc62fb031599becd9fc222157afdd8", "width": 320}, {"height": 394, "url": "https://external-preview.redd.it/sQSmel0kIeBWhh5utQuD-XC4NWFaCN-ZHKZ3iY8aXVA.png?width=640&amp;crop=smart&amp;auto=webp&amp;s=becd389617c4ea80999bba4b2d947bcc7a1978c9", "width": 640}, {"height": 592, "url": "https://external-preview.redd.it/sQSmel0kIeBWhh5utQuD-XC4NWFaCN-ZHKZ3iY8aXVA.png?width=960&amp;crop=smart&amp;auto=webp&amp;s=aa2c4804bea8404f019f3a44214fe3dea51a09a7", "width": 960}, {"height": 666, "url": "https://external-preview.redd.it/sQSmel0kIeBWhh5utQuD-XC4NWFaCN-ZHKZ3iY8aXVA.png?width=1080&amp;crop=smart&amp;auto=webp&amp;s=b15bbce605a079926d431c911b95e10d60f0f0ed", "width": 1080}], "source": {"height": 761, "url": "https://external-preview.redd.it/sQSmel0kIeBWhh5utQuD-XC4NWFaCN-ZHKZ3iY8aXVA.png?auto=webp&amp;s=99c2d393257e2c6d0c6b557901e2341e3379647c", "width": 1234}, "variants": {}}]}, "pwls": 6, "retrieved_on": 1608398169, "score": 3, "selftext": "Good Saturday morning to all of you here on r/stocks. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning December 21st, 2020.\n\n# **Wall Street strategists see stocks gaining 9% in 2021 after a possible speed bump to start the year  - [(Source)](https://www.cnbc.com/2020/12/18/wall-street-strategists-see-stocks-gaining-9percent-in-2021-after-a-possible-speed-bump-to-start-the-year.html)**\n*****\n&gt; The stock market appears set on rising into 2021 — a year expected to see some return to normalcy, above trend economic growth and a higher stock market, according to Wall Street strategists.\n*****\n&gt; Even with this year’s sharp sell-off, the S&amp;P 500 is notching a near 15% gain for 2020. For 2021, many strategists expect another year of double-digit gains.\n*****\n&gt; Those in CNBC’s survey expect an average 2021 year-end target 4,056, or about a 9.5% gain from current levels. But some strategists, like Fundstrat’s Tom Lee, expect a rally more in line with 2020. Lee sees a surge in the S&amp;P to 4,300 from its current level near 3,700.\n*****\n&gt; Vaccines are expected to liberate individuals from pandemic restrictions and in turn, free the economy as 2021 progresses. Work from home should shift back to work at the office; movies will be shown in theaters; diners will eat inside restaurants, and large numbers of people may no longer be afraid to travel.\n*****\n&gt; But the road to that second half scenario is not without bumps. As the virus spreads and hospitalizations are at a record, the economy is showing signs of slowing. The labor market is weakening and weekly unemployment claims have surged to September levels, as restaurants and other businesses shut down or cutback because of the pandemic.\n*****\n&gt; “The shutdowns are going to be very targeted. It’s nothing like what you saw in the spring,” said Ethan Harris, head of global economics research at Bank of America. “It’s going to eat away at the economy in the next few months. You come in with this big loss of momentum to start the year off. Then you look out to the spring and there are ... reasons for optimism.”\n*****\n&gt; Paralleling that view of the economy is the expectation among stock strategists that the market could hit a rough patch early in the year before heading higher.\n*****\n&gt; # The week ahead\n&gt; Stocks in the past week were higher, with the S&amp;P 500 up 1.3% at 3,709, near a record high in Friday trading. Heading into the holiday-shortened Christmas week, traders will be watching the shakeout from the massive S&amp;P 500 rebalancing that came with Tesla’s entry to the index. Tesla first trades as a part of the S&amp;P on Monday morning.\n*****\n&gt; “We’ll see whether or not there’s selling of Tesla after the fact. Investors had to buy Tesla coming in, so we may see selling of Tesla once it’s absorbed within the S&amp;P,” said Quincy Krosby, chief market strategist at Prudential Financial. Index investors and funds that own the entire S&amp;P 500 would reduce holdings of other stocks to make room for Tesla, and that trading could make for a volatile Monday morning.\n*****\n&gt; Krosby said stocks should tilt higher into the year-end, unless Congress fails to come up with a stimulus package or there are any surprise setbacks for the Covid vaccines. Congress was still sparring over a package Friday. “At this point, the vaccines are stimulus,” she said.\n*****\n&gt; Strategists expect a relatively quiet week for stocks, and the bond market is also expected to be subdued, as investors finish up year-end trades, following last Wednesday’s Fed meeting. There is housing data Tuesday and Wednesday, and jobless claims and durable goods Thursday.\n*****\n&gt; Then of course, there is the focus on the new year.\n*****\n&gt; # First-quarter speed bump\n&gt; “The first quarter is typically the toughest from a GDP perspective,” said Michael Arone, chief investment strategist at State Street Global Advisors. He said the earnings season will begin and there’s the potential for some negative outlooks. “I think we’re due for a correction at some point in the first quarter.” Arone expects a 5% to 10% pullback and says the stock market may have pulled forward some of its gains in 2020.\n*****\n&gt; Fundstrat’s Lee, who was one of the first to call the March rebound, says he’s looking for a 10% correction between February and April, before the market recovers and surges higher.\n*****\n&gt; There is a major wild card looming for the market in the early days of the new year. Polls show the Jan. 5 Georgia Senate elections are very close and have the potential to shift control of the Senate. Political strategists say it’s more likely the GOP will retain control, winning one or both seats, but if there is a surprise upset by Democrats, it could shift the political agenda dramatically.\n*****\n&gt; If Democrats win, each party would have 50 Senate seats, and Vice President-elect Kamala Harris would cast any tie-breaker votes.\n*****\n&gt; “The January 5th runoff in Georgia is an important event for the market, and right now it’s close. It’s important because of the consequences. The expectations are if the Democrats win, the market will sell off,” said Krosby.\n*****\n&gt; But that could be a short-lived reaction since the market would also see the potential for a bigger stimulus package from Democrats.\n*****\n&gt; “But I think as the fiscal stimulus rolls out, and it’s pretty clear you’re going to be at the high end of the range, I think the market will like that. Everyone always talks about how the markets don’t like a progressive agenda, but they do like fiscal stimulus,” said Bank of America’s Harris.\n*****\n&gt; Whether it gets a lot of stimulus or not so much, the economy is still expected to rebound.\n*****\n&gt; In an environment where the economy is recovering and central bank policy is easy, strategists expect cyclical stocks will do well as the market looks forward to the second half of the year. By then, many millions should be vaccinated and the economy should be growing.\n*****\n&gt; “Given the fiscal and monetary policy, low rates and eventual end of the pandemic, it’s hard to call for something terrible happening at least from a market perspective,” said Arone.\n*****\n&gt; Arone said investors still need to hold stocks with strong organic growth rates as well as cyclical names that will do better in a recovery. Lee said he favors industrials, energy and discretionary sectors for 2021, but he also still likes Big Tech with strong earnings, like Apple and Alphabet. He expects a shakeout in some of the stay-at-home stocks, particularly those that don’t have solid earnings streams.\n*****\n&gt; The virus will continue to drive the economy over the next year, but the difference in 2021 is that vaccines are expected to be distributed to the point where they could favorably impact the economy starting in the second quarter. Harris said the economy will get a boost once hospitalizations and the death rate fall from high levels.\n*****\n&gt; He expects first-quarter growth will come in at about 1% but by the second quarter, growth should bounce to 7%.\n*****\n&gt; In the CNBC/Moody’s Analytics survey of economists, forecasts for 2021 growth average 4.4%, after an expected decline of 3.5% this year.\n*****\n&gt; If Congress approves a stimulus package this year and another next year, that should give a substantial boost to the economy. Harris said stimulus of $500 billion to $1 trillion is equal to about 2.5% to 4.5% of GDP.\n*****\n&gt; “If you put stimulus like that into the economy that’s open, that’s a big boost,” Harris said.\n*****\n&gt; Economists are looking forward to a period in 2021 where the recovering economy could boost inflation above the Fed’s 2% target, but it is not expected to stay at that level. But even so, strategists look to cyclical names in energy and materials to do well in that environment. Bank of America strategists have already identified a group of stocks that do well in an inflationary period that are outperforming some of those that don’t.\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/LhgmNdV.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/KSkp1c5.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/sWMhkZ4.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.postimg.cc/brpytRb3/econcal1.png))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/D6dCoUA.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/BYpbNxT.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/xL78HsG.png)**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/nE072Rq.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/DwRa0FB.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/HtN5m6b.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/cvJ3eBi.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/Ed1Hvv8.png))**\n###### **([CLICK HERE FOR THE CHART LINK #3!](https://i.imgur.com/whYpZrV.png))**\n\n*****\n\n&gt; # An Overbought World\n\n&gt; The majority of global equity markets tracked in our Global Macro Dashboard found a short-term bottom at some point in late October including the US. As shown below, of the 23 ETFs tracking each of these countries' equity markets, nearly all are up double digits since the end of October. A dozen have risen over 20% and Brazil (EWZ) has risen more than any other country, gaining over 40%. China (MCHI), on the other hand, is the only hold out as it has risen just 3.44% over the past month and a half. Given these moves, most of these ETFs are overbought as defined as trading at least one standard deviation above their 50-DMAs. Only Hong Kong (EWH) and China (MCHI) are not overbought by this measure while India (INDA) is currently the most overbought ETF trading 1.92 standard deviations from its 50-DMA. That is even though it is at the low end of the performance range of these country ETFs listed. Top-performing Brazil, on the other hand, is the second most overbought ETF trading 1.85 standard deviations above its 50-day. In percentage terms, Brazil is also the ETF trading the furthest above its 50-DMA.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/121820-GMD.png))**\n\n&gt; In the charts below, we show the trading range charts of each of these ETFs over the past six months. As shown, most are fairly elevated at or near some of the highest levels of the past six months. With that being said, there are some country ETFs that have seen a bit of a drift lower in recent days and weeks. For example, France (EWQ), Hong Kong (EWH), and Singapore (EWS) have all made a move lower within their respective trading ranges recently even though they are still overbought. Similarly, Sweden (EWD) has been more or less trading sideways since late November. The same had been true for Switzerland (EWL) and Norway (ENOR) until they began to break out to the upside in recent days. Click here to view Bespoke's premium membership options for our best research available.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/121820-GMD-Charts.png))**\n\n*****\n\n&gt; # Leading Indicators Positive\n\n&gt; Leading Economic Indicators for the month of November came in higher than expected this morning, rising 0.6% versus estimates for an increase of 0.5%. One way we like to track the index of Leading Economic Indicators is to compare its ratio vs the index of Coincident Economic Indicators. The chart below shows the monthly ratio going back to 1959 with recessions highlighted in gray.\n\n&gt; If you aren't familiar with this ratio, it tends to rise during economic expansions and then roll over in advance of recessions. Then, towards the end of the recession, the ratio bottoms out and starts to improve. Even ahead of the current recession, the LEI/CEI ratio peaked in September 2018. While the pace of the decline wasn't nearly as steep as it was heading into prior recessions, the weakness in the ratio suggests that the economy was already at risk of a slowdown before the COVID outbreak. Who knows? If COVID never happened, maybe the US economy would have experienced a recession at some point in 2020 anyway.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/121820-LEICEI.png))**\n\n&gt; While it's a bit hard to see in the chart above, as the shorter-term chart of the LEI/CEI ratio below shows, November's reading isn't far from the pre-recession highs reached 26 months ago. Why is this important? For starters, at 26 months, the current streak without a new high isn't even the longest we have seen since the end of the financial crisis. The longest streak without a new high was 27 months from mid-2011 through mid-2013. Therefore, if the ratio rises again next month and makes a new high, it will be tied with that prior streak, one which didn't even result in a recession. More importantly, though, in every prior recession since 1960, the LEI/CEI ratio has never been this close to a new high and still in a recession. This means one of two things - either the LEI/CEI ratio has become flawed or the recession that began in February has been over for months.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/121820-LEICEI-Shorter-Term.png))**\n\n*****\n\n&gt; # Real Santa Claus Rally\n\n&gt; Stock Trader’s Almanac founder and creator, Yale Hirsch, discovered and named the Santa Claus Rally in the 1972 in the Almanac and coined the phrase: “If Santa Claus should fail to call, bears may come to Broad and Wall.”\n\n&gt; The “Santa Claus Rally” begins on the open on Christmas Eve day December 24and lasts until the second trading day of 2021. Average S&amp;P 500 gains over this seven trading-day range since 1969 are a respectable 1.3%. This is our first indicator for the market in the New Year. Years when the Santa Claus Rally (SCR) has failed to materialize are often flat or down.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://64.media.tumblr.com/3322e79e3993ba91f3cdc2c8998bb304/c0018ed75496c55e-24/s500x750/c30f76e8944ab933165b8e4605df1949e55c1e8a.jpg))**\n\n&gt; The last six times SCR (the last five trading days of the year and the first two trading days of the New Year) has not occurred were followed by three flat years (1994, 2004 and 2015) and two nasty bear markets (2000 and 2008) and a mild bear that ended in February 2016. As Yale Hirsch’s now famous line states, “If Santa Claus should fail to call, bears may come to Broad and Wall.”\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://64.media.tumblr.com/95573b80c952987ce6cddf016781c869/c0018ed75496c55e-6b/s500x750/2ac5dfda390dff518e0caa07098761d86191d1e3.jpg))**\n\n*****\n\n&gt; # VIX Run Above 20 Tops 200 Days\n\n&gt; With today's close, the VIX has now stuck above 20 for 207 trading days and counting. That marks the fourth-longest streak since the inception of the volatility index, and is approaching the late-1990s and early-2000s record runs. The index was above 20 for 239 trading days through the end of June 1999, and 236 trading days through May 8th, 2003. Of course, from 2008 to December 21st of 2009, the VIX was over 20 for 331 trading days (more than a year).\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/121520-VIX-Streaks.png))**\n\n&gt; Surprisingly, the current VIX streak has had an average reading higher than the two longer streaks in 1999 and 2003. The average 32.0 reading over its course so far is second only to the streak recorded over the global financial crisis. It's also interesting to note that at this stage in the streak (207 trading days), the current run has a higher reading than the three streaks which actually lasted longer.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/121520-VIX-Levels.png))**\n\n*****\n\n&gt; # Wretched Retail Sales\n\n&gt; If Congress was looking for any evidence that additional relief for Americans was needed, the November Retail Sales report should provide some ammunition. At the headline level, Retail Sales fell 1.1%, which was nearly four times the decline of consensus forecasts. Stripping out Autos and Gas, the numbers were just as bad. As if that wasn’t enough, October’s report was also revised significantly lower dropping from a gain of 0.3% at the headline level to a decline of 0.1%. Adding it all together, Retail Sales for November were 1.5% lower than what was originally reported in October’s report.\n\n&gt; Breadth in this month’s report was also weak. Of the thirteen sectors that comprise the total pie, all but three of them were lower on the month. If you were expecting a new sweater this Christmas, don’t hold your breath as sales of Clothing were down close to 7%. Other big decliners included Bars &amp; Restaurants (-3.99%) and Electronics &amp; Appliances (-3.49%). With more cities imposing restrictions on activity, sales at Gas Stations also declined 2.41%. Were it not for the historic declines we saw earlier this year, drops of this magnitude would be considered pretty steep, but after the COVID shutdowns, nothing is a surprise anymore. Not every aspect of the Retail Sales report was weak, though. Bright spots included Food &amp; Beverage Stores, Building Materials, and Online– all sectors you would expect to see hold up well as Americans hunker down.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/table.png))**\n\n&gt; The characteristics behind the total level of sales have changed markedly in the post-COVID world. In our just-released B.I.G. Tips report, we looked at these changing dynamics to highlight the groups that have been the biggest winners and losers from the shifts.\n\n*****\n\n&gt; # Chart of the Year\n\n&gt; Stocks continue to surprise to the upside, with the Russell 2000 Index (small caps) and the Nasdaq making new all-time highs on Tuesday. The S&amp;P 500 Index, a chip shot from new highs, already has made 30 new highs so far this year. “One thing that surprises many investors is new highs happen in clusters that can last a decade or more,” explained LPL Financial Chief Market Strategist Ryan Detrick. “Given that this cluster of new highs is only seven years old, history would suggest that we don’t bet against several more years of new highs.”\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/12/12.16.20-Blog-Chart-1.png?ssl=1))**\n\n&gt; One of the more amazing charts (and our friend Sam Ro at Yahoo! Finance called this the chart of the year) is how this new bull market has tracked the 2009 bull market. We’ve been sharing this chart for months now, noting if things continued to track 2009, then significant gains could be in store and sure enough that has played out. Here’s the catch, continued strength could still be in store, as 2009 continued to gain the next few months from this point forward.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/12/12.16.20-Blog-Chart-2.png?ssl=1))**\n\n&gt; Lastly, will Santa come in December? We discussed this in detail at the start of the month in Big Gains Steal From Santa, but the truth of the matter is the S&amp;P 500 Index is flat on average half way through the month and nearly all of the impressive December gains take place the second half of the month.\n\n&gt; As shown in the LPL Chart of the Day, if Santa is going to come in 2020, now is the time for the reindeer to get ready and for stocks to potentially bounce.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/12/12.16.20-Blog-Chart-3.png?ssl=1))**\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/DwRa0FB.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/BvRiIU8.png))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 12.21.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.postimg.cc/nc9RmtFS/er122120am.png))\n\n&gt; # ***Monday 12.21.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK!](https://i.postimg.cc/8k0XsCSr/er122120pm.png))\n\n*****\n\n&gt; # ***Tuesday  12.22.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.postimg.cc/8k0XsCSr/er122120pm.png))\n\n&gt; # ***Tuesday 12.22.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.postimg.cc/5tbnDYwD/er122320am.png))\n\n*****\n\n&gt; # ***Wednesday 12.23.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n&gt; # ***Wednesday 12.23.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n*****\n\n&gt; # ***Thursday 12.24.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n&gt; # ***Thursday 12.24.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n*****\n\n&gt; # ***Friday 12.25.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!]())\nNONE. (U.S. MARKETS CLOSED IN OBSERVANCE OF CHRISTMAS DAY.)\n\n*****\n\n&gt; # ***Friday 12.25.20 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\nNONE. (U.S. MARKETS CLOSED IN OBSERVANCE OF CHRISTMAS DAY.)\n\n*****\n\n&gt; # CarMax, Inc. $98.25\n**CarMax, Inc. (KMX)** is confirmed to report earnings at approximately 6:50 AM ET on Tuesday, December 22, 2020. The consensus earnings estimate is $1.11 per share on revenue of $5.00 billion and the Earnings Whisper ® number is $1.31 per share. Investor sentiment going into the company's earnings release has 58% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 6.73% with revenue increasing by 4.38%. Short interest has decreased by 20.1% since the company's last earnings release while the stock has drifted lower by 1.8% from its open following the earnings release to be 12.1% above its 200 day moving average of $87.65. Overall earnings estimates have been revised higher since the company's last earnings release. On Friday, December 18, 2020 there was some notable buying of 2,340 contracts of the $110.00 call expiring on Friday, January 15, 2021. Option traders are pricing in a 3.6% move on earnings and the stock has averaged a 5.1% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=KMX&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # FactSet Research Systems, Inc. $347.03\n**FactSet Research Systems, Inc. (FDS)** is confirmed to report earnings at approximately 7:00 AM ET on Monday, December 21, 2020. The consensus earnings estimate is $2.74 per share on revenue of $387.88 million and the Earnings Whisper ® number is $2.85 per share. Investor sentiment going into the company's earnings release has 52% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 6.20% with revenue increasing by 5.79%. Short interest has decreased by 16.2% since the company's last earnings release while the stock has drifted higher by 0.6% from its open following the earnings release to be 10.7% above its 200 day moving average of $313.43. Overall earnings estimates have been revised higher since the company's last earnings release. Option traders are pricing in a 5.7% move on earnings and the stock has averaged a 6.5% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=FDS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Paychex, Inc. $96.92\n**Paychex, Inc. (PAYX)** is confirmed to report earnings at approximately 8:30 AM ET on Wednesday, December 23, 2020. The consensus earnings estimate is $0.66 per share on revenue of $952.93 million and the Earnings Whisper ® number is $0.69 per share. Investor sentiment going into the company's earnings release has 39% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 5.71% with revenue decreasing by 3.81%. Short interest has decreased by 20.2% since the company's last earnings release while the stock has drifted higher by 20.1% from its open following the earnings release to be 28.3% above its 200 day moving average of $75.55. Overall earnings estimates have been revised higher since the company's last earnings release. On Thursday, December 17, 2020 there was some notable buying of 1,108 contracts of the $110.00 call expiring on Friday, June 18, 2021. Option traders are pricing in a 4.6% move on earnings and the stock has averaged a 2.4% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=PAYX&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Cintas Corporation $354.35\n**Cintas Corporation (CTAS)** is confirmed to report earnings at approximately 8:30 AM ET on Tuesday, December 22, 2020. The consensus earnings estimate is $2.18 per share on revenue of $1.76 billion and the Earnings Whisper ® number is $2.35 per share. Investor sentiment going into the company's earnings release has 47% expecting an earnings beat The company's guidance was for earnings of $2.00 to $2.20 per share. Consensus estimates are for earnings to decline year-over-year by 3.96% with revenue decreasing by 4.54%. Short interest has decreased by 44.9% since the company's last earnings release while the stock has drifted higher by 4.2% from its open following the earnings release to be 24.5% above its 200 day moving average of $284.59. Overall earnings estimates have been revised higher since the company's last earnings release. Option traders are pricing in a 5.5% move on earnings and the stock has averaged a 4.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=CTAS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Neogen Corp. $80.80\n**Neogen Corp. (NEOG)** is confirmed to report earnings at approximately 8:45 AM ET on Tuesday, December 22, 2020. The consensus earnings estimate is $0.33 per share on revenue of $115.45 million and the Earnings Whisper ® number is $0.34 per share. Investor sentiment going into the company's earnings release has 50% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 6.45% with revenue increasing by 7.09%. Short interest has decreased by 40.6% since the company's last earnings release while the stock has drifted higher by 5.0% from its open following the earnings release to be 13.5% above its 200 day moving average of $71.22. Overall earnings estimates have been revised lower since the company's last earnings release. Option traders are pricing in a 6.5% move on earnings and the stock has averaged a 5.0% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=NEOG&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Vince Holding Corp. $6.40\n**Vince Holding Corp. (VNCE)** is confirmed to report earnings at approximately 4:05 PM ET on Monday, December 21, 2020. The consensus estimate is for a loss of $0.26 per share on revenue of $65.90 million. Investor sentiment going into the company's earnings release has 43% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 135.62% with revenue decreasing by 23.73%. Short interest has decreased by 29.3% since the company's last earnings release while the stock has drifted higher by 14.3% from its open following the earnings release. Overall earnings estimates have been revised lower since the company's last earnings release.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=VNCE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # HEICO Corporation $133.09\n**HEICO Corporation (HEI)** is confirmed to report earnings at approximately 4:15 PM ET on Monday, December 21, 2020. The consensus earnings estimate is $0.43 per share on revenue of $426.40 million and the Earnings Whisper ® number is $0.48 per share. Investor sentiment going into the company's earnings release has 54% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 30.65% with revenue decreasing by 21.26%. The stock has drifted higher by 22.1% from its open following the earnings release to be 30.3% above its 200 day moving average of $102.18. Overall earnings estimates have been revised higher since the company's last earnings release. Option traders are pricing in a 6.3% move on earnings and the stock has averaged a 6.0% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=HEI&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Enerpac Tool Group $22.81\n**Enerpac Tool Group (EPAC)** is confirmed to report earnings at approximately 8:30 AM ET on Monday, December 21, 2020. The consensus earnings estimate is $0.09 per share on revenue of $122.54 million and the Earnings Whisper ® number is $0.11 per share. Investor sentiment going into the company's earnings release has 26% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 25.00% with revenue decreasing by 16.45%. Short interest has decreased by 8.7% since the company's last earnings release while the stock has drifted higher by 32.3% from its open following the earnings release to be 20.7% above its 200 day moving average of $18.89. Overall earnings estimates have been revised lower since the company's last earnings release. Option traders are pricing in a 9.3% move on earnings and the stock has averaged a 5.0% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=EPAC&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Calavo Growers Inc. $72.08\n**Calavo Growers Inc. (CVGW)** is confirmed to report earnings at approximately 4:00 PM ET on Monday, December 21, 2020. The consensus earnings estimate is $0.62 per share on revenue of $253.00 million and the Earnings Whisper ® number is $0.69 per share. Investor sentiment going into the company's earnings release has 51% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 37.78% with revenue decreasing by 13.41%. Short interest has decreased by 38.3% since the company's last earnings release while the stock has drifted higher by 20.2% from its open following the earnings release to be 14.2% above its 200 day moving average of $63.12. Overall earnings estimates have been revised lower since the company's last earnings release. Option traders are pricing in a 8.7% move on earnings and the stock has averaged a 5.8% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=CVGW&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # cbdMD, Inc. $2.62\n**cbdMD, Inc. (YCBD)** is confirmed to report earnings at approximately 4:05 PM ET on Tuesday, December 22, 2020. Investor sentiment going into the company's earnings release has 32% expecting an earnings beat. The stock has drifted lower by 20.1% from its open following the earnings release to be 23.0% above its 200 day moving average of $2.13. Overall earnings estimates have been revised lower since the company's last earnings release. The stock has averaged a 23.7% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=YCBD&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/stocks.", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "stocks", "subreddit_id": "t5_2qjfk", "subreddit_subscribers": 977689, "subreddit_type": "public", "thumbnail": "self", "title": "Wall Street Week Ahead for the trading week beginning December 21st, 2020", "total_awards_received": 0, "treatment_tags": [], "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/stocks/comments/kgb1nl/wall_street_week_ahead_for_the_trading_week/", "whitelist_status": "all_ads", "wls": 6, "created": 1608392345.0}], [[], false, "spacej3di", null, [], null, "text", "t2_kdm2ull", false, false, [], false, false, 1600870258, "self.stocks", "https://www.reddit.com/r/stocks/comments/iyauw3/morning_market_synopsis_wednesday_sept_23_2020/", {}, "iyauw3", true, false, false, false, true, true, false, "", "resources", [], "a376614c-65e6-11e5-b6e7-123c7cc7e97b", "Resources", "dark", "text", false, false, true, 0, 0, false, "all_ads", "/r/stocks/comments/iyauw3/morning_market_synopsis_wednesday_sept_23_2020/", false, 6, 1600870268, 1, " **US equities mixed: Dow +0.21%, S&amp;P (0.16%), Nasdaq (0.50%), Russell +0.24%**\n\n* US equities mixed in Wednesday morning trading after bouncing on Tuesday, snapping a four-day losing streak. Nothing specific behind the price action and no notable broader market impact from better earnings, vaccine progress, government funding deal and largely in-line US flash PMIs. Value and cyclicals outperforming growth and momentum. Industrials and financials the standouts. Tech, energy and materials among the laggards. Treasuries mostly weaker. Dollar firmer against the euro and yen. Gold down 1.1%. WTI crude up 0.6%.\n* **House Democrats and White House reached deal on a stopgap measure to avoid a government shutdown**. However, still seems **unlikely there will be a near-term stimulus agreement** as **Republicans push to confirm a Supreme Court nominee before the election**. Reports late yesterday noted **FDA to announce stricter standards for emergency use authorization of a coronavirus vaccine,** making pre-election approval unlikely. **Coronavirus second wave concerns** continue to get attention though **European countries avoiding some of the more draconian mitigation measures**. On the data front, **US flash PMIs largely in line with expectations**.\n* **TSLA-US** Battery Day takeaways fairly positive but expectations very elevated. **JNJ-US** started phase three testing of its coronavirus vaccine. **NKE-US** results much better than expected with NA a standout and company citing digital strength. **MMM-US** reportedly considering sale of food safety unit. **LULU-US** announced resumption of buyback plan. **GIS-US** organic growth strong. **WDC-US** to split into two segments: HDD and Flash. **KBH-US** beat and said demand has remained strong in Q4. **SFIX-US** beat on most key metrics but its revenue growth outlook was softer with some lingering headwinds from reduced marketing spend. **SCS-US** beat but guided below as companies have delayed their office reopenings.\n\n**Notable Gainers:**\n\n* \\+14.2% **HTH-US** (Hilltop Holdings): Announced $350M Dutch Tender; represents \\~20% of market cap; announcement could dampen some of the speculation about an acquisition.\n* \\+9.2% **NKE-US** (Nike): FQ1 earnings, revenue, and GM beat; NA results a bright spot; highlighted strong digital growth; raised FY21 revenue guidance; analysts positive on management's bullish tone, ongoing tech investments, and efforts to right-size inventory.\n* \\+8.3% **WDC-US** (Western Digital): Announced post-close Tuesday it will split its Flash and HDD groups into separate business units; analysts generally positive on new CEO's strategy; upgraded to buy at Craig-Hallum, suggesting split could be a first step toward a spin-off.\n* \\+6.4% **CUB-US** (Cubic Corp): Elliott and Veritas Capital submitted a joint bid at a premium to Tuesday's closing price of $54.73 according to Reuters; comes after company adopted a poison pill Monday after Elliott took a 15% stake.\n* \\+3.5% **LULU-US** (Lululemon): Restarted buyback program it had halted on 2-Apr in response to the Covid pandemic; said remaining authorized repurchase is $263.6M and program runs through 31-Jan.\n* \\+1.7% **CTAS-US** (Cintas): FQ1 earnings and revenue beat amid better Uniform Rental/Facility Services results; margins better than the Street; next-Q guidance bookends consensus.\n* \\+1.6% **JNJ-US** (Johnson &amp; Johnson): Announced initiation of Phase 3 trial of COVID-19 vaccine candidate ; said it will enroll up to 60K volunteers to study single vaccine dose; said first batches to be available for emergency use authorization in early 2021.\n\n**Notable Decliners:**\n\n* \\-10.8% **SFIX-US** (Stitch Fix): FQ4 adjusted EBITDA and revenue beat expectations with margins also ahead, however next quarter revenue guidance was light; analysts noted a decline in revenue per client as the company advertised less while worked through fulfillment backlogs.\n* \\-7.5% **ALB-US** (Albemarle): Named bearish \"Fresh Pick\" at Baird; argued TSLA-US moves toward vertical integration in the lithium space will be an overhang; added continued producer shutdowns and slower EV demand may necessitate pricing concessions.\n* \\-6% **SCS-US** (Steelcase): Q2 earnings and revenue beat; order trends improved through the Q but have weakened in early Q3; Q3 EPS guidance midpoint lower than the Street; said pipelines remain depressed amid ongoing uncertainty and customers delaying returns to the office.\n* \\-4.8% **TSLA-US** (Tesla): Outlined plans to improve its battery range by 54%, while cutting cost/KWh by 56% and investment per GWh by 69%; enhanced vertical integration is crucial to the company's goal of building a $25K electric vehicle by 2023; Street takeaways from Battery Day fairly positive but also noted very elevated expectations, along with execution and operational challenges.\n* \\-3.4% **KBH-US** (KB Home): Q3 EPS, revenue beat; deliveries beat, unit orders, backlogs all ahead, but delivery average price, backlog value weaker; downgraded to sector weight from overweight at KeyBanc, saying FY21 momentum limited on community growth, slower orders as demand pulled-forward, slower cycle times.\n* \\-2.8% **AXP-US** (American Express): Downgraded to underperform from neutral at Bank of America; cited expected weakness in airline and travel spend and the resulting hit to billing volumes; sees better risk/reward in credit-oriented consumer finance names which trade at a lower PE multiple.", false, false, false, "stocks", "t5_2qjfk", 856496, "public", "self", "Morning Market Synopsis - Wednesday, Sept. 23, 2020", 0, [], 1.0, "https://www.reddit.com/r/stocks/comments/iyauw3/morning_market_synopsis_wednesday_sept_23_2020/", "all_ads", 6, 1600866658.0, {"all_awardings": [], "allow_live_comments": false, "author": "spacej3di", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_kdm2ull", "author_patreon_flair": false, "author_premium": false, "awarders": [], "can_mod_post": false, "contest_mode": false, "created_utc": 1600870258, "domain": "self.stocks", "full_link": "https://www.reddit.com/r/stocks/comments/iyauw3/morning_market_synopsis_wednesday_sept_23_2020/", "gildings": {}, "id": "iyauw3", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_css_class": "resources", "link_flair_richtext": [], "link_flair_template_id": "a376614c-65e6-11e5-b6e7-123c7cc7e97b", "link_flair_text": "Resources", "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 0, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/stocks/comments/iyauw3/morning_market_synopsis_wednesday_sept_23_2020/", "pinned": false, "pwls": 6, "retrieved_on": 1600870268, "score": 1, "selftext": " **US equities mixed: Dow +0.21%, S&amp;P (0.16%), Nasdaq (0.50%), Russell +0.24%**\n\n* US equities mixed in Wednesday morning trading after bouncing on Tuesday, snapping a four-day losing streak. Nothing specific behind the price action and no notable broader market impact from better earnings, vaccine progress, government funding deal and largely in-line US flash PMIs. Value and cyclicals outperforming growth and momentum. Industrials and financials the standouts. Tech, energy and materials among the laggards. Treasuries mostly weaker. Dollar firmer against the euro and yen. Gold down 1.1%. WTI crude up 0.6%.\n* **House Democrats and White House reached deal on a stopgap measure to avoid a government shutdown**. However, still seems **unlikely there will be a near-term stimulus agreement** as **Republicans push to confirm a Supreme Court nominee before the election**. Reports late yesterday noted **FDA to announce stricter standards for emergency use authorization of a coronavirus vaccine,** making pre-election approval unlikely. **Coronavirus second wave concerns** continue to get attention though **European countries avoiding some of the more draconian mitigation measures**. On the data front, **US flash PMIs largely in line with expectations**.\n* **TSLA-US** Battery Day takeaways fairly positive but expectations very elevated. **JNJ-US** started phase three testing of its coronavirus vaccine. **NKE-US** results much better than expected with NA a standout and company citing digital strength. **MMM-US** reportedly considering sale of food safety unit. **LULU-US** announced resumption of buyback plan. **GIS-US** organic growth strong. **WDC-US** to split into two segments: HDD and Flash. **KBH-US** beat and said demand has remained strong in Q4. **SFIX-US** beat on most key metrics but its revenue growth outlook was softer with some lingering headwinds from reduced marketing spend. **SCS-US** beat but guided below as companies have delayed their office reopenings.\n\n**Notable Gainers:**\n\n* \\+14.2% **HTH-US** (Hilltop Holdings): Announced $350M Dutch Tender; represents \\~20% of market cap; announcement could dampen some of the speculation about an acquisition.\n* \\+9.2% **NKE-US** (Nike): FQ1 earnings, revenue, and GM beat; NA results a bright spot; highlighted strong digital growth; raised FY21 revenue guidance; analysts positive on management's bullish tone, ongoing tech investments, and efforts to right-size inventory.\n* \\+8.3% **WDC-US** (Western Digital): Announced post-close Tuesday it will split its Flash and HDD groups into separate business units; analysts generally positive on new CEO's strategy; upgraded to buy at Craig-Hallum, suggesting split could be a first step toward a spin-off.\n* \\+6.4% **CUB-US** (Cubic Corp): Elliott and Veritas Capital submitted a joint bid at a premium to Tuesday's closing price of $54.73 according to Reuters; comes after company adopted a poison pill Monday after Elliott took a 15% stake.\n* \\+3.5% **LULU-US** (Lululemon): Restarted buyback program it had halted on 2-Apr in response to the Covid pandemic; said remaining authorized repurchase is $263.6M and program runs through 31-Jan.\n* \\+1.7% **CTAS-US** (Cintas): FQ1 earnings and revenue beat amid better Uniform Rental/Facility Services results; margins better than the Street; next-Q guidance bookends consensus.\n* \\+1.6% **JNJ-US** (Johnson &amp; Johnson): Announced initiation of Phase 3 trial of COVID-19 vaccine candidate ; said it will enroll up to 60K volunteers to study single vaccine dose; said first batches to be available for emergency use authorization in early 2021.\n\n**Notable Decliners:**\n\n* \\-10.8% **SFIX-US** (Stitch Fix): FQ4 adjusted EBITDA and revenue beat expectations with margins also ahead, however next quarter revenue guidance was light; analysts noted a decline in revenue per client as the company advertised less while worked through fulfillment backlogs.\n* \\-7.5% **ALB-US** (Albemarle): Named bearish \"Fresh Pick\" at Baird; argued TSLA-US moves toward vertical integration in the lithium space will be an overhang; added continued producer shutdowns and slower EV demand may necessitate pricing concessions.\n* \\-6% **SCS-US** (Steelcase): Q2 earnings and revenue beat; order trends improved through the Q but have weakened in early Q3; Q3 EPS guidance midpoint lower than the Street; said pipelines remain depressed amid ongoing uncertainty and customers delaying returns to the office.\n* \\-4.8% **TSLA-US** (Tesla): Outlined plans to improve its battery range by 54%, while cutting cost/KWh by 56% and investment per GWh by 69%; enhanced vertical integration is crucial to the company's goal of building a $25K electric vehicle by 2023; Street takeaways from Battery Day fairly positive but also noted very elevated expectations, along with execution and operational challenges.\n* \\-3.4% **KBH-US** (KB Home): Q3 EPS, revenue beat; deliveries beat, unit orders, backlogs all ahead, but delivery average price, backlog value weaker; downgraded to sector weight from overweight at KeyBanc, saying FY21 momentum limited on community growth, slower orders as demand pulled-forward, slower cycle times.\n* \\-2.8% **AXP-US** (American Express): Downgraded to underperform from neutral at Bank of America; cited expected weakness in airline and travel spend and the resulting hit to billing volumes; sees better risk/reward in credit-oriented consumer finance names which trade at a lower PE multiple.", "send_replies": false, "spoiler": false, "stickied": false, "subreddit": "stocks", "subreddit_id": "t5_2qjfk", "subreddit_subscribers": 856496, "subreddit_type": "public", "thumbnail": "self", "title": "Morning Market Synopsis - Wednesday, Sept. 23, 2020", "total_awards_received": 0, "treatment_tags": [], "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/stocks/comments/iyauw3/morning_market_synopsis_wednesday_sept_23_2020/", "whitelist_status": "all_ads", "wls": 6, "created": 1600866658.0}], [[], false, "StockShotCaller", null, [], null, "text", "t2_71y50hkj", false, false, [], false, false, 1600554389, "self.stocks", "https://www.reddit.com/r/stocks/comments/iw22jr/earnings_for_the_week_of_21_to_25_september/", {}, "iw22jr", true, false, false, false, true, true, false, "", "tickernews", [], "5a4c814a-65e6-11e5-b65e-122ab0778f8b", "Ticker News", "dark", "text", false, false, true, 8, 0, false, "all_ads", "/r/stocks/comments/iw22jr/earnings_for_the_week_of_21_to_25_september/", false, "self", {"enabled": false, "images": [{"id": "kFeGl5qT-2wrorER4PPVtoDXzqX0jcziOqTBXbNsGGg", "resolutions": [{"height": 108, "url": "https://external-preview.redd.it/PNk9doMfd-ddvgMjnbaXvyftxV6HS9Gtpz9qLp4zAaQ.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=ef93ae0000939138a2ab11cb2d29cfda6b80df98", "width": 108}, {"height": 216, "url": "https://external-preview.redd.it/PNk9doMfd-ddvgMjnbaXvyftxV6HS9Gtpz9qLp4zAaQ.jpg?width=216&amp;crop=smart&amp;auto=webp&amp;s=b5cf3ce5ac0b3b9f0389c5cb826ec661396b297b", "width": 216}, {"height": 320, "url": "https://external-preview.redd.it/PNk9doMfd-ddvgMjnbaXvyftxV6HS9Gtpz9qLp4zAaQ.jpg?width=320&amp;crop=smart&amp;auto=webp&amp;s=e74de19c19c41611c08a7b1f9a3b45e8b5e7e19a", "width": 320}], "source": {"height": 350, "url": "https://external-preview.redd.it/PNk9doMfd-ddvgMjnbaXvyftxV6HS9Gtpz9qLp4zAaQ.jpg?auto=webp&amp;s=1e1a2215c44ea78457a2c10b66d248f34b6765b9", "width": 350}, "variants": {}}]}, 6, 1600554400, 1, "**#Earnings for 21 Sep 2020**\n\nPre-Market (PM) $PT   \n\nAfter Hours (AH) $ERYP $QTT\n\n&amp;#x200B;\n\n**#Earnings for 22 Sep 2020**\n\nPM $AZO $NEOG    \n\nAH $KBH $NKE $SCS $SFIX\n\n&amp;#x200B;\n\n**#Earnings for 23 Sep 2020**\n\nPM $CNTG $CTAS $GIS $JKS $TNP $WOR\n\nAH $FUL $KBNT $WDDMF\n\n&amp;#x200B;\n\n**#Earnings for 24 Sep 2020**\n\nPM $ACN $BB $DRI $DYNT $FDS $JBL $KMX $NTWK $RAD $RSSS\n\nAH $AEHR $AIR $AYTU $CAMP $COST $MTN $SCHL $SPRWF $TCOM\n\n&amp;#x200B;\n\n**#Earnings for 25 Sep 2020**\n\nPM $AIH   \n\nAH $NTZ\n\n&amp;#x200B;\n\nSource [https://twitter.com/KillerStockCall](https://twitter.com/KillerStockCall)", false, false, false, "stocks", "t5_2qjfk", 852214, "public", "self", "Earnings for the Week of 21 to 25 September", 0, [], 1.0, "https://www.reddit.com/r/stocks/comments/iw22jr/earnings_for_the_week_of_21_to_25_september/", "all_ads", 6, 1600550789.0, {"all_awardings": [], "allow_live_comments": false, "author": "StockShotCaller", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_71y50hkj", "author_patreon_flair": false, "author_premium": false, "awarders": [], "can_mod_post": false, "contest_mode": false, "created_utc": 1600554389, "domain": "self.stocks", "full_link": "https://www.reddit.com/r/stocks/comments/iw22jr/earnings_for_the_week_of_21_to_25_september/", "gildings": {}, "id": "iw22jr", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_css_class": "tickernews", "link_flair_richtext": [], "link_flair_template_id": "5a4c814a-65e6-11e5-b65e-122ab0778f8b", "link_flair_text": "Ticker News", "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 8, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/stocks/comments/iw22jr/earnings_for_the_week_of_21_to_25_september/", "pinned": false, "post_hint": "self", "preview": {"enabled": false, "images": [{"id": "kFeGl5qT-2wrorER4PPVtoDXzqX0jcziOqTBXbNsGGg", "resolutions": [{"height": 108, "url": "https://external-preview.redd.it/PNk9doMfd-ddvgMjnbaXvyftxV6HS9Gtpz9qLp4zAaQ.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=ef93ae0000939138a2ab11cb2d29cfda6b80df98", "width": 108}, {"height": 216, "url": "https://external-preview.redd.it/PNk9doMfd-ddvgMjnbaXvyftxV6HS9Gtpz9qLp4zAaQ.jpg?width=216&amp;crop=smart&amp;auto=webp&amp;s=b5cf3ce5ac0b3b9f0389c5cb826ec661396b297b", "width": 216}, {"height": 320, "url": "https://external-preview.redd.it/PNk9doMfd-ddvgMjnbaXvyftxV6HS9Gtpz9qLp4zAaQ.jpg?width=320&amp;crop=smart&amp;auto=webp&amp;s=e74de19c19c41611c08a7b1f9a3b45e8b5e7e19a", "width": 320}], "source": {"height": 350, "url": "https://external-preview.redd.it/PNk9doMfd-ddvgMjnbaXvyftxV6HS9Gtpz9qLp4zAaQ.jpg?auto=webp&amp;s=1e1a2215c44ea78457a2c10b66d248f34b6765b9", "width": 350}, "variants": {}}]}, "pwls": 6, "retrieved_on": 1600554400, "score": 1, "selftext": "**#Earnings for 21 Sep 2020**\n\nPre-Market (PM) $PT   \n\nAfter Hours (AH) $ERYP $QTT\n\n&amp;#x200B;\n\n**#Earnings for 22 Sep 2020**\n\nPM $AZO $NEOG    \n\nAH $KBH $NKE $SCS $SFIX\n\n&amp;#x200B;\n\n**#Earnings for 23 Sep 2020**\n\nPM $CNTG $CTAS $GIS $JKS $TNP $WOR\n\nAH $FUL $KBNT $WDDMF\n\n&amp;#x200B;\n\n**#Earnings for 24 Sep 2020**\n\nPM $ACN $BB $DRI $DYNT $FDS $JBL $KMX $NTWK $RAD $RSSS\n\nAH $AEHR $AIR $AYTU $CAMP $COST $MTN $SCHL $SPRWF $TCOM\n\n&amp;#x200B;\n\n**#Earnings for 25 Sep 2020**\n\nPM $AIH   \n\nAH $NTZ\n\n&amp;#x200B;\n\nSource [https://twitter.com/KillerStockCall](https://twitter.com/KillerStockCall)", "send_replies": false, "spoiler": false, "stickied": false, "subreddit": "stocks", "subreddit_id": "t5_2qjfk", "subreddit_subscribers": 852214, "subreddit_type": "public", "thumbnail": "self", "title": "Earnings for the Week of 21 to 25 September", "total_awards_received": 0, "treatment_tags": [], "upvote_ratio": 1.0, "url": "https://www.reddit.com/r/stocks/comments/iw22jr/earnings_for_the_week_of_21_to_25_september/", "whitelist_status": "all_ads", "wls": 6, "created": 1600550789.0}], [[], false, "bigbear0083", null, [], null, "text", "t2_eaak0", false, false, [], false, false, 1584202447, "self.stocks", "https://www.reddit.com/r/stocks/comments/fikrze/wall_street_week_ahead_for_the_trading_week/", {}, "fikrze", true, false, false, false, true, true, false, "", "news", [], "866eb162-65e6-11e5-a903-1252b640afe9", "News", "dark", "text", false, false, true, 213, 0, false, "all_ads", "/r/stocks/comments/fikrze/wall_street_week_ahead_for_the_trading_week/", false, "self", {"enabled": false, "images": [{"id": "vXuymvrVTA0yH303QKOhl9ubNhh2_Z25VtWxuAuIUXc", "resolutions": [{"height": 61, "url": "https://external-preview.redd.it/K8mWzrttDGwJu1Ko1g6KqJ0tHal1ep6GDqO1e_HBAP0.png?width=108&amp;crop=smart&amp;auto=webp&amp;s=c638dd43074a8e45e429f46bf07ea43100f3bf65", "width": 108}, {"height": 123, "url": "https://external-preview.redd.it/K8mWzrttDGwJu1Ko1g6KqJ0tHal1ep6GDqO1e_HBAP0.png?width=216&amp;crop=smart&amp;auto=webp&amp;s=84d6e1f012bd45fe9f0edb7d7bd05fcab32924a9", "width": 216}, {"height": 183, "url": "https://external-preview.redd.it/K8mWzrttDGwJu1Ko1g6KqJ0tHal1ep6GDqO1e_HBAP0.png?width=320&amp;crop=smart&amp;auto=webp&amp;s=010745f067bd2a55a5fd445a5e8a23e956ad5c5f", "width": 320}, {"height": 366, "url": "https://external-preview.redd.it/K8mWzrttDGwJu1Ko1g6KqJ0tHal1ep6GDqO1e_HBAP0.png?width=640&amp;crop=smart&amp;auto=webp&amp;s=ecdc3bbeb3772c9e5ef48ddf75aeb4119701b742", "width": 640}, {"height": 550, "url": "https://external-preview.redd.it/K8mWzrttDGwJu1Ko1g6KqJ0tHal1ep6GDqO1e_HBAP0.png?width=960&amp;crop=smart&amp;auto=webp&amp;s=17218413a2cc5e63da904a1e32be7443bc5a81e7", "width": 960}, {"height": 618, "url": "https://external-preview.redd.it/K8mWzrttDGwJu1Ko1g6KqJ0tHal1ep6GDqO1e_HBAP0.png?width=1080&amp;crop=smart&amp;auto=webp&amp;s=f8372f3ad7e81ebbd5eca162adf5ad6d929ea9e9", "width": 1080}], "source": {"height": 694, "url": "https://external-preview.redd.it/K8mWzrttDGwJu1Ko1g6KqJ0tHal1ep6GDqO1e_HBAP0.png?auto=webp&amp;s=38d38755a72fe65e490dea212ee02781c79dfd32", "width": 1211}, "variants": {}}]}, 6, 1584202453, 1, "Good Saturday afternoon to all of you here on r/stocks. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning March 16th, 2020.\n\n# **Stocks are expected to see more wild swings, even if Fed makes big policy move  - [(Source)](https://www.cnbc.com/2020/03/13/stocks-are-expected-to-see-more-wild-swings-even-if-fed-makes-big-policy-move.html)**\n*****\n&gt; Now that stocks have entered a bear market, more wild volatility is expected in the week ahead as investors await a big policy move by the Federal Reserve.\n*****\n&gt; The Federal Reserve meets Tuesday and Wednesday and is expected by some economists to take its benchmark federal funds target range back to zero, as the economy looks more and more like it could fall into a recession, due to the impact of the coronavirus.\n*****\n&gt; In the past week, the market was sharply lower but swung wildly in both directions, including the stunning 10% decline in the Dow Thursday, the worst one-day drop since the 1987 market crash followed by Friday’s 9.3% gain, the best day in more than 11 years.\n*****\n&gt; The S&amp;P 500 ended up 9.3% Friday at 2,711, its best day since Oct. 28, 2008. The S&amp;P is now 20.2% below its February high.\n*****\n&gt; Strategists say the market purge is not over, though it could be closer to a bottom, with some expecting the S&amp;P 500 to fall through 2,400 before it finds a floor.\n*****\n&gt; “You could say we’re pricing a garden variety recession,” said Lori Calvasina, chief U.S. equities strategist at RBC. “We come up with a range of 2,300 to 2,600 as recession territory.” She said the average drop during a recession, since the 1930s, was 32%. The S&amp;P had been as much as 29% off its Feb. 19 high.\n*****\n&gt; “If [S&amp;P] went below 2,300, it would be telling you the market is pricing in something worse than a recession, In the financial crisis we lost 57% and in the tech bubble, we lost 49%,” said Calvasina.\n*****\n&gt; The S&amp;P 500 was down 8.9% for the week, its worst loss since the week of Feb. 28.\n*****\n&gt; “I think we needed to get through this week, in particular — the one where the country went into shut down and now get the second go around of policy response. If they really do bring out the bazookas we should be darn close” to the bottom, said Barry Knapp, Ironsides Macroeconomics director of research.\n*****\n&gt; But strategists also point out that the coronavirus is unpredictable and it is hard to say when it will peak, even though many economists expect a bounce back in economic growth by the fourth quarter.\n*****\n&gt; President Donald Trump declared a state of emergency Friday, which allows him to tap federal agencies to provide emergency funds and other responses to the crisis. The president also announced the government would buy oil to fill the Strategic Petroleum Reserves and that 1.4 million test kits would be available in the next week.\n*****\n&gt; Markets will also be looking for further action, which the Trump administration says could include targeted financial aid to industries that are hard hit, like airlines.\n*****\n&gt; As communities around the country attempt to stop the spread of the virus, the potential hit to the economy grows. Companies have told workers to work from home, universities are shutting campuses, a handful of states closed public schools, and major sporting and other events have been canceled.\n*****\n&gt; “If it indeed is declared a recession, it will really only be a three-month drop in activity,” said Knapp. “In 2008, the household sector had the highest debt levels it ever had, and the household sector was in no position to respond to stimulus. This is quite different.”\n*****\n&gt; “We see where are are today is pricing in a recession. It went from a growth scare down to recession territory,” said Calvasina. She said the market is not ready to move higher yet. “I think something else we’ve got to see in addition to extreme panic ratings from the sentiment indicators, we do need to see the news flow get better on the virus.”\n*****\n&gt; Investors will continue to look for more action from Washington, and in the coming week it will also be the Fed’s policy response that could drive the market.\n*****\n&gt; “In light of the continued growth in coronavirus cases in the US and globally, the sharp further tightening in financial conditions, and rising risks to the economic outlook, we now expect the FOMC to cut the funds rate 100bp on March 18, a faster return to the crisis-era 0-0.25% rate than under our previous call for two 50bp steps in March and April,” Goldman economists wrote.\n*****\n&gt; The Fed on Thursday announced a significant increase in funds available for its repo operations, to provide liquidity for the short term funding markets. It also said it would purchase a broad range of Treasury securities, across maturities, with the $60 billion it currently uses to buy Treasury bills on a monthly basis.\n*****\n&gt; Economists say the Fed could announce other policy moves, like purchases of mortgage securities. Some expect it to return to a “patient” stance, showing a willingness to keep rates extremely low for a long time.\n*****\n&gt; Analysts have been watching the corporate bond market, where spreads blew out dramatically in the past week, particularly in high yield. Calvasina said she is not yet concerned.\n*****\n&gt; “We’ve got problems in energy. We have problems in some hospitality related industries. There are pockets of stress, but for me, when I look across most S&amp;P companies’ balance sheets are in really good shape,” Calvasina said. “I don’t think this is a prolonged sort of downturn.”\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/iG7ENVB.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/4gwPTzC.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/h9DkOZJ.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/4m2QVZH.png))**\n\n# **Sector Performance WTD, MTD, YTD:**\n###### **([CLICK HERE FOR FRIDAY'S PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_t.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE WEEK-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_w.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE MONTH-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_m.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE 3-MONTH PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_q.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE YEAR-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_ytd.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE 52-WEEK PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_y.png&amp;rev=636115211971930604))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/akOOH97.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/slVwGv2.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/ASyHg6a.png)**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/rbgSrGQ.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/9nZfl7V.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/eS99ijc.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/tEs62Hh.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/kMQTBj6.png))**\n###### **([CLICK HERE FOR THE CHART LINK #3!](https://i.imgur.com/toentZ2.png))**\n###### **([CLICK HERE FOR THE CHART LINK #4!](https://i.imgur.com/ozn837y.png))**\n\n*****\n\n# Signs Of A Washout?\n\n&gt; The S&amp;P 500 Index’s historic slide continued yesterday, culminating in nearly a 10% loss for the day, and leaving the benchmark index officially in bear market territory, just 16 trading days after setting a record high on February 19. In addition, the S&amp;P 500 has now moved more than 4% each day this week, leaving investors and professionals alike wondering when this volatility could end. While nobody knows for sure, one thing we always look for at market bottoms are signs of extremes, both from a sentiment and price perspective.\n\n&gt; From an anecdotal sentiment perspective, certainly fears of COVID-19 have reached the masses, with travel plans canceled and announcements of major events called off coming nearly every hour. However, investor survey data shows a similar story with the American Association of Individual Investors (AAII) Investor Sentiment Survey showing the highest percentage of bears since April 2013. In addition, the National Association of Active Investment Managers (NAAIM) Exposure Index, which represents the average exposure to US equity markets by the surveyed investment managers, reached its lowest level since September 2015. Following each of those instances, the S&amp;P 500 rallied more than 13% over the next year.\n\n&gt; Another way of gauging sentiment can be from the internals of the market. While the S&amp;P 500 is now well below its 200-day moving average, that doesn’t mean each stock in the index has moved below its respective 200-day moving average. In fact, regardless of the broad market’s trend, when less than 20% of the individual components of the index are trading below their 200-day moving averages, it is considered an extreme. As shown in the LPL Chart of the Day, Thursday’s sell-off left less 6% of the S&amp;P 500 there, a number last seen in March 2009. “These are truly frightening times,” explained LPL Financial Senior Market Strategist Ryan Detrick. “However, it is important to remember that the signs of panic we are seeing are typically found at or near major market lows.”\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/03/Signs_of_Washout.png?ssl=1))**\n\n*****\n\n# The Fastest Bear Market Ever\n\n&gt; The historic volatility continues, with the Dow Jones Industrial Average officially setting its fastest move from a new all-time high to a bear market (down 20% from the highs) in the 124-year history of the index. It took only 19 days for this to take place, which is far and away the new record.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/03/Bear-market-1-1.png?ssl=1))**\n\n&gt; Not to be outdone, the S&amp;P 500 Index is set to close down 20% from all-time highs today, doing this in only 16 days. Again, as of the time we are writing this blog, the S&amp;P 500 is in bear market territory, but there always could be a chance for a late-day rally.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/03/Bear-market-2.png?ssl=1))**\n\n&gt; “From major sports postponing their seasons, to travel bans to Europe, the economic impact of the coronavirus is growing exponentially with each passing day,” said LPL Financial Senior Market Strategist Ryan Detrick. “Markets are pricing in a potential recession and inevitable second quarter slowdown, but it is all about expectations. Should the virus be contained and the worst-case scenarios not materialize, now could be a nice opportunity for longer-term investors.”\n\n&gt; Last, one of Warren Buffett’s most famous quotes is, “Be fearful when others are greedy and be fearful when others are fearful.” We’ve seen many signs of extreme fear the past few days, but the CNN Fear &amp; Greed Index hitting 1 earlier today is quite a historic level of fear. This proprietary indicator looks at multiple inputs (like put/call ratios, momentum, and volatility), but on a scale of 1-100, this morning’s 1 is the lowest level ever seen, besting the 2 it hit at the lows in December 2018. From a contrarian point of view, this could be quite meaningful.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/03/Bear-market-3.png?ssl=1))**\n\n*****\n\n# Perspectives on Waterfall Declines\n\n&gt; Volatile market action over the several weeks warrants some much needed perspective into the history of these types of waterfall declines. Fortunately, we have this research on hand and have been examining the nature of deep, fast selloffs like we have experience here in early 2020 as well as the nature of the inevitable and often sharp recoveries.\n\n&gt; First of all yes, this time is different – and yet it’s not. The headline causes of each of these historic waterfall declines are all different and yet investor, trader and money manager behavior remains rather similar. Fear has once again exposed the market’s overvaluation and weaknesses. This time it’s the fear of the coronavirus pandemic and price war in the oil market that spills over into the rest of the financial.\n\n&gt; Like the previous occurrences of waterfall declines in the table and graphs below the market reacted to fear and sold off fast and hard. It’s too early to tell if this waterfall decline is over or how fast and far the recovery will be. As we continue to analyze the current situation a thorough review of the history of waterfall declines and their subsequent recoveries should provide some much needed perspective.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://66.media.tumblr.com/31cca506c45d87ad962ce9c707baf21a/fc7021573b50880b-76/s500x750/0a6588971f599cbbca194b38b62a47c087875238.jpg))**\n\n*****\n\n# Friday 13th, DJIA Attempting to Recover &amp; End Losing Friday Streak\n\n&gt; Friday is a significant day of the week because it is the last day of trading and positions held over the weekend could be at higher risk of an exogenous event or an unanticipated headline. Pages 143 &amp; 144 of the Stock Trader’s Almanac 2020 show the difference in Friday performance during bull and bear markets. Friday’s have been weaker in bear markets.\n\n&gt; However today, on a Friday the 13th of all days, DJIA is fighting to recover some of its losses this week and to end its streak of down Fridays at seven. Down Friday DJIA losing streaks of seven or more, like the current streak, are actually somewhat rare in history. Prior to this year, DJIA has had just six similar or longer down Friday streaks going back to 1950. The last streak of down Fridays was in March and April of 2017. The longest streak lasted nine Fridays beginning on the last Friday of 2000 and lasting into February 2001.\n\n &gt; In the above chart the 30 trading days before and the 60 trading days after the last six DJIA down Friday losing streaks of seven or more have been plotted to display the average performance before and after the last down Friday of the streak. (There are on average 21 trading days in a typical calendar month) Weakness and lower was the trend during the down Friday streak, but once the streak came to an end, DJIA was higher 60 trading days later.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://66.media.tumblr.com/c8d6237984423d89dc5b20f4a1bf7009/07327bf517318c16-1e/s500x750/13020ac23c0adf1831e35c982c37f1602a236fd1.jpg))**\n\n*****\n\n# Last Stocks Above Their Moving Averages\n\n&gt; The massive declines over the past few weeks have left conditions extremely oversold. As we highlighted in yesterday's Sector Snapshot, breadth has been awful while there is no longer a single stock in the S&amp;P 500 that is overbought (1 or more standard deviations above its 50-DMA). In fact, after yesterday's absolute washout, there is only a small handful of stocks that are above their 50 and 200-DMAs. In regards to the 50-DMA, less than 1% of stocks in the S&amp;P 500 are above this average which is the first time that has happened since 2011. The only time in between that saw a similarly weak reading, although not quite hitting that under 1% requirement was back in December of 2018 when 1.19% of stocks were above their 50-DMA. As for the 200-DMA, only 5.59% are above that level. That is the lowest reading since March of 2009.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/03/MAs.png))**\n\n&gt; The average stock is now 26.56% below its 50-day and 24.5% below its 200-day. The table below shows those 22 remaining stocks that are still above their 200-DMAs as of yesterday's close and the few that are also below their 50-DMA. Of these, only Regeneron (REGN), Kroger (KR), Digital Realty Trust (DLR), and Gilead Sciences (GILD) are also above their 50-DMAs. The only other stock in the index that is also above its 50-DMA is Cabot Oil and Gas (COG), though it is 11% below its 200-DMA. While these stocks have all held above their long term moving average recently, only GILD and REGN have risen since the index's high on 2/19.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/03/Above-200-table2.png))**\n\n*****\n\n# Selloff Erases All of US Market Cap Gains Since Election Day 2016\n\n&gt; With the US stock market down nearly 7% yet again today, the total market cap of US companies as measured by the Russell 3,000 has fallen $11.5 trillion in less than a month. On February 19th, total US market cap was just over $35 trillion. It's at $23.8 trillion as of this morning.\n\n&gt; What makes this drop even more noteworthy is that $23.8 trillion was the market cap of US companies on Election Day 2016. At this point in time, all of the market cap gains seen since President Trump's election victory have been wiped out.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/03/raymktcap.png))**\n\n*****\n\n# Low Rates Send Mortgage Applications Surging\n\n&gt; Coronavirus fears have broadly sent rates lower over the past month. Currently, the national average for a 30-year fixed-rate mortgage stands at 3.68%; just off the low of 3.55% from earlier in the month. With mortgage rates now basically at their lowest levels since late 2016, homeowners have been quickly enticed to jump on these lower rates.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/03/MRNA.png))**\n\n&gt; Last week, weekly mortgage applications from the Mortgage Bankers Association showed a roughly 15% surge as rates were reaching record lows. In the time since then, the Fed's 50 bps cut came into effect and yields fell even further which led mortgage applications this week to surge 55.4%. That is the highest week over week increase in mortgage applications since November of 2008 when they had risen 112.1%. Outside of that period, we've only seen larger weekly increases a few other times since 1990.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/03/MA-1.png))**\n\n&gt; The spike was driven largely by refinancing applications which rose 78.6% week-over-week. As with the composite, that was the biggest weekly jump in refi applications since the housing bubble. Prior to that, once again you would need to go back to 2001 or the 1990s to find larger weekly increases in mortgage refinance applications.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/03/MA-ref.png))**\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * **$NIO** \n&gt; * **$HQY** \n&gt; * **$FCEL** \n&gt; * **$MOMO** \n&gt; * **$FDX** \n&gt; * **$CRWD** \n&gt; * **$HUYA** \n&gt; * **$NBEV** \n&gt; * **$BE** \n&gt; * **$MDB** \n&gt; * **$BZUN** \n&gt; * **$BILI** \n&gt; * **$YY** \n&gt; * **$COUP** \n&gt; * **$MUX** \n&gt; * **$FIVE** \n&gt; * **$TME** \n&gt; * **$MIK** \n&gt; * **$CVSI** \n&gt; * **$ACRX** \n&gt; * **$ACN** \n&gt; * **$GES** \n&gt; * **$WPRT** \n&gt; * **$OLLI** \n&gt; * **$GIS**\n&gt; * **$CPRX** \n&gt; * **$PLCE** \n&gt; * **$DRI** \n&gt; * **$TLRD** \n&gt; * **$ZTO** \n&gt; * **$BAX** \n&gt; * **$LEN** \n&gt; * **$DLTH** \n&gt; * **$HDS** \n&gt; * **$CTAS** \n&gt; * **$SMAR** \n&gt; * **$WSM** \n&gt; * **$TCOM** \n&gt; * **$HIBB** \n&gt; * **$REI** \n&gt; * **$DBI** \n&gt; * **$CTRA** \n&gt; * **$GPL** \n&gt; * **$CMC**\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/9nZfl7V.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/EKAkJgU.png))**\n###### **([CLICK HERE FOR  THE MOST NOTABLE EARNINGS RELEASES BEFORE MONDAY'S OPEN!](https://i.imgur.com/631cGTg.jpg))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 3.16.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/FLCjERW.png))\n\n\n&gt; # ***Monday 3.16.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/GCK6dns.png))\n\n\n*****\n\n&gt; # ***Tuesday 3.17.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/J7uVG2b.png))\n\n&gt; # ***Tuesday 3.17.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/ADUyE5E.png))\n\n*****\n\n&gt; # ***Wednesday 3.18.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/q2AM8aO.png))\n\n&gt; # ***Wednesday 3.18.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/sXXUKYj.png))\n\n*****\n\n&gt; # ***Thursday 3.19.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/ZISY7gz.png))\n\n&gt; # ***Thursday 3.19.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/pgdAKJu.png))\n\n*****\n\n&gt; # ***Friday 3.20.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!]())\nNONE.\n\n*****\n\n&gt; # ***Friday 3.20.20 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\nNONE.\n\n*****\n\n# NIO Inc. $3.11\n&gt; **NIO Inc. (NIO)** is confirmed to report earnings at approximately 6:40 AM ET on Wednesday, March 18, 2020. The consensus estimate is for a loss of $0.37 per share on revenue of $412.45 million and the Earnings Whisper ® number is ($0.34) per share. Investor sentiment going into the company's earnings release has 46% expecting an earnings beat The company's guidance was for revenue of approximately $393.00 million. Consensus estimates are for year-over-year earnings growth of 24.49% with revenue decreasing by 17.46%. Short interest has decreased by 21.0% since the company's last earnings release while the stock has drifted higher by 6.5% from its open following the earnings release to be 5.8% above its 200 day moving average of $2.94. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, March 13, 2020 there was some notable buying of 1,321 contracts of the $2.00 put expiring on Friday, April 3, 2020. Option traders are pricing in a 21.9% move on earnings and the stock has averaged a 20.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=NIO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# HealthEquity, Inc. $53.99\n&gt; **HealthEquity, Inc. (HQY)** is confirmed to report earnings at approximately 4:00 PM ET on Monday, March 16, 2020. The consensus earnings estimate is $0.34 per share on revenue of $198.49 million and the Earnings Whisper ® number is $0.37 per share. Investor sentiment going into the company's earnings release has 73% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 25.93% with revenue increasing by 161.94%. Short interest has decreased by 21.5% since the company's last earnings release while the stock has drifted lower by 21.4% from its open following the earnings release to be 18.3% below its 200 day moving average of $66.07. Overall earnings estimates have been revised higher since the company's last earnings release. On Wednesday, March 4, 2020 there was some notable buying of 551 contracts of the $65.00 put expiring on Friday, September 18, 2020. Option traders are pricing in a 19.4% move on earnings and the stock has averaged a 4.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=HQY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# FuelCell Energy, Inc. $1.15\n&gt; **FuelCell Energy, Inc. (FCEL)** is confirmed to report earnings at approximately 7:00 AM ET on Monday, March 16, 2020. The consensus estimate is for a loss of $0.09 per share on revenue of $9.80 million and the Earnings Whisper ® number is ($0.10) per share. Investor sentiment going into the company's earnings release has 49% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 50.00% with revenue decreasing by 44.89%. Short interest has increased by 20.7% since the company's last earnings release while the stock has drifted lower by 46.8% from its open following the earnings release to be 23.2% above its 200 day moving average of $0.93. Overall earnings estimates have been revised lower since the company's last earnings release. The stock has averaged a 30.5% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=FCEL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Momo Inc. $23.57\n&gt; **Momo Inc. (MOMO)** is confirmed to report earnings at approximately 3:15 AM ET on Thursday, March 19, 2020. The consensus earnings estimate is $0.74 per share on revenue of $654.51 million and the Earnings Whisper ® number is $0.77 per share. Investor sentiment going into the company's earnings release has 77% expecting an earnings beat The company's guidance was for revenue of $642.00 million to $656.00 million. Consensus estimates are for year-over-year earnings growth of 32.14% with revenue increasing by 17.07%. Short interest has increased by 54.1% since the company's last earnings release while the stock has drifted lower by 37.4% from its open following the earnings release to be 31.0% below its 200 day moving average of $34.17. Overall earnings estimates have been revised higher since the company's last earnings release. On Tuesday, March 10, 2020 there was some notable buying of 1,063 contracts of the $27.00 call expiring on Friday, April 17, 2020. Option traders are pricing in a 18.0% move on earnings and the stock has averaged a 8.0% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=MOMO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# CrowdStrike, Inc. $39.55\n&gt; **CrowdStrike, Inc. (CRWD)** is confirmed to report earnings at approximately 4:05 PM ET on Thursday, March 19, 2020. The consensus estimate is for a loss of $0.08 per share on revenue of $137.67 million and the Earnings Whisper ® number is ($0.06) per share. Investor sentiment going into the company's earnings release has 82% expecting an earnings beat The company's guidance was for a loss of $0.09 to $0.08 per share on revenue of $136.00 million to $139.00 million. Short interest has decreased by 52.2% since the company's last earnings release while the stock has drifted lower by 26.8% from its open following the earnings release. Overall earnings estimates have been revised higher since the company's last earnings release. The stock has averaged a 10.4% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=CRWD&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# FedEx Corp. $106.63\n&gt; **FedEx Corp. (FDX)** is confirmed to report earnings at approximately 4:00 PM ET on Tuesday, March 17, 2020. The consensus earnings estimate is $1.69 per share on revenue of $17.19 billion and the Earnings Whisper ® number is $1.67 per share. Investor sentiment going into the company's earnings release has 23% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 44.22% with revenue increasing by 1.06%. Short interest has increased by 16.0% since the company's last earnings release while the stock has drifted lower by 29.6% from its open following the earnings release to be 31.2% below its 200 day moving average of $154.91. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, March 10, 2020 there was some notable buying of 1,131 contracts of the $85.00 put expiring on Friday, April 17, 2020. Option traders are pricing in a 17.4% move on earnings and the stock has averaged a 7.8% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=FDX&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# HUYA Inc. $15.40\n&gt; **HUYA Inc. (HUYA)** is confirmed to report earnings at approximately 6:00 PM ET on Monday, March 16, 2020. The consensus earnings estimate is $0.13 per share on revenue of $339.95 million and the Earnings Whisper ® number is $0.15 per share. Investor sentiment going into the company's earnings release has 80% expecting an earnings beat The company's guidance was for revenue of $334.00 million to $345.00 million. Consensus estimates are for year-over-year earnings growth of 85.71% with revenue increasing by 55.31%. Short interest has increased by 65.2% since the company's last earnings release while the stock has drifted lower by 38.4% from its open following the earnings release to be 28.9% below its 200 day moving average of $21.66. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, February 21, 2020 there was some notable buying of 774 contracts of the $18.00 put expiring on Friday, July 17, 2020. Option traders are pricing in a 19.3% move on earnings and the stock has averaged a 5.4% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=HUYA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# New Age Beverages Corporation $1.46\n&gt; **New Age Beverages Corporation (NBEV)** is confirmed to report earnings at approximately 6:00 AM ET on Monday, March 16, 2020. The consensus estimate is for a loss of $0.08 per share on revenue of $65.80 million and the Earnings Whisper ® number is ($0.10) per share. Investor sentiment going into the company's earnings release has 53% expecting an earnings beat. Short interest has decreased by 15.8% since the company's last earnings release while the stock has drifted lower by 35.7% from its open following the earnings release to be 49.2% below its 200 day moving average of $2.87. Overall earnings estimates have been revised lower since the company's last earnings release. On Wednesday, March 4, 2020 there was some notable buying of 2,000 contracts of the $1.50 call expiring on Friday, June 19, 2020. The stock has averaged a 5.6% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=NBEV&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Bloom Energy Corporation $6.12\n&gt; **Bloom Energy Corporation (BE)** is confirmed to report earnings after the market closes on Monday, March 16, 2020. Investor sentiment going into the company's earnings release has 64% expecting an earnings beat. Short interest has decreased by 5.4% since the company's last earnings release while the stock has drifted higher by 36.9% from its open following the earnings release to be 21.5% below its 200 day moving average of $7.80. On Tuesday, March 10, 2020 there was some notable buying of 1,772 contracts of the $9.00 call expiring on Friday, March 20, 2020. The stock has averaged a 19.3% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=BE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# MongoDB, Inc. $115.17\n&gt; **MongoDB, Inc. (MDB)** is confirmed to report earnings at approximately 4:05 PM ET on Tuesday, March 17, 2020. The consensus estimate is for a loss of $0.28 per share on revenue of $110.38 million and the Earnings Whisper ® number is ($0.26) per share. Investor sentiment going into the company's earnings release has 73% expecting an earnings beat The company's guidance was for a loss of $0.29 to $0.27 per share on revenue of $109.00 million to $111.00 million. Consensus estimates are for earnings to decline year-over-year by 55.56% with revenue increasing by 29.12%. Short interest has decreased by 6.3% since the company's last earnings release while the stock has drifted lower by 20.4% from its open following the earnings release to be 19.6% below its 200 day moving average of $143.28. Overall earnings estimates have been revised lower since the company's last earnings release. Option traders are pricing in a 18.9% move on earnings and the stock has averaged a 8.4% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=MDB&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/stocks.", true, false, false, "stocks", "t5_2qjfk", 535994, "public", "self", "Wall Street Week Ahead for the trading week beginning March 16th, 2020", 0, "https://www.reddit.com/r/stocks/comments/fikrze/wall_street_week_ahead_for_the_trading_week/", "all_ads", 6, 1584198847.0, {"all_awardings": [], "allow_live_comments": false, "author": "bigbear0083", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_eaak0", "author_patreon_flair": false, "author_premium": false, "awarders": [], "can_mod_post": false, "contest_mode": false, "created_utc": 1584202447, "domain": "self.stocks", "full_link": "https://www.reddit.com/r/stocks/comments/fikrze/wall_street_week_ahead_for_the_trading_week/", "gildings": {}, "id": "fikrze", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_css_class": "news", "link_flair_richtext": [], "link_flair_template_id": "866eb162-65e6-11e5-a903-1252b640afe9", "link_flair_text": "News", "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 213, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/stocks/comments/fikrze/wall_street_week_ahead_for_the_trading_week/", "pinned": false, "post_hint": "self", "preview": {"enabled": false, "images": [{"id": "vXuymvrVTA0yH303QKOhl9ubNhh2_Z25VtWxuAuIUXc", "resolutions": [{"height": 61, "url": "https://external-preview.redd.it/K8mWzrttDGwJu1Ko1g6KqJ0tHal1ep6GDqO1e_HBAP0.png?width=108&amp;crop=smart&amp;auto=webp&amp;s=c638dd43074a8e45e429f46bf07ea43100f3bf65", "width": 108}, {"height": 123, "url": "https://external-preview.redd.it/K8mWzrttDGwJu1Ko1g6KqJ0tHal1ep6GDqO1e_HBAP0.png?width=216&amp;crop=smart&amp;auto=webp&amp;s=84d6e1f012bd45fe9f0edb7d7bd05fcab32924a9", "width": 216}, {"height": 183, "url": "https://external-preview.redd.it/K8mWzrttDGwJu1Ko1g6KqJ0tHal1ep6GDqO1e_HBAP0.png?width=320&amp;crop=smart&amp;auto=webp&amp;s=010745f067bd2a55a5fd445a5e8a23e956ad5c5f", "width": 320}, {"height": 366, "url": "https://external-preview.redd.it/K8mWzrttDGwJu1Ko1g6KqJ0tHal1ep6GDqO1e_HBAP0.png?width=640&amp;crop=smart&amp;auto=webp&amp;s=ecdc3bbeb3772c9e5ef48ddf75aeb4119701b742", "width": 640}, {"height": 550, "url": "https://external-preview.redd.it/K8mWzrttDGwJu1Ko1g6KqJ0tHal1ep6GDqO1e_HBAP0.png?width=960&amp;crop=smart&amp;auto=webp&amp;s=17218413a2cc5e63da904a1e32be7443bc5a81e7", "width": 960}, {"height": 618, "url": "https://external-preview.redd.it/K8mWzrttDGwJu1Ko1g6KqJ0tHal1ep6GDqO1e_HBAP0.png?width=1080&amp;crop=smart&amp;auto=webp&amp;s=f8372f3ad7e81ebbd5eca162adf5ad6d929ea9e9", "width": 1080}], "source": {"height": 694, "url": "https://external-preview.redd.it/K8mWzrttDGwJu1Ko1g6KqJ0tHal1ep6GDqO1e_HBAP0.png?auto=webp&amp;s=38d38755a72fe65e490dea212ee02781c79dfd32", "width": 1211}, "variants": {}}]}, "pwls": 6, "retrieved_on": 1584202453, "score": 1, "selftext": "Good Saturday afternoon to all of you here on r/stocks. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning March 16th, 2020.\n\n# **Stocks are expected to see more wild swings, even if Fed makes big policy move  - [(Source)](https://www.cnbc.com/2020/03/13/stocks-are-expected-to-see-more-wild-swings-even-if-fed-makes-big-policy-move.html)**\n*****\n&gt; Now that stocks have entered a bear market, more wild volatility is expected in the week ahead as investors await a big policy move by the Federal Reserve.\n*****\n&gt; The Federal Reserve meets Tuesday and Wednesday and is expected by some economists to take its benchmark federal funds target range back to zero, as the economy looks more and more like it could fall into a recession, due to the impact of the coronavirus.\n*****\n&gt; In the past week, the market was sharply lower but swung wildly in both directions, including the stunning 10% decline in the Dow Thursday, the worst one-day drop since the 1987 market crash followed by Friday’s 9.3% gain, the best day in more than 11 years.\n*****\n&gt; The S&amp;P 500 ended up 9.3% Friday at 2,711, its best day since Oct. 28, 2008. The S&amp;P is now 20.2% below its February high.\n*****\n&gt; Strategists say the market purge is not over, though it could be closer to a bottom, with some expecting the S&amp;P 500 to fall through 2,400 before it finds a floor.\n*****\n&gt; “You could say we’re pricing a garden variety recession,” said Lori Calvasina, chief U.S. equities strategist at RBC. “We come up with a range of 2,300 to 2,600 as recession territory.” She said the average drop during a recession, since the 1930s, was 32%. The S&amp;P had been as much as 29% off its Feb. 19 high.\n*****\n&gt; “If [S&amp;P] went below 2,300, it would be telling you the market is pricing in something worse than a recession, In the financial crisis we lost 57% and in the tech bubble, we lost 49%,” said Calvasina.\n*****\n&gt; The S&amp;P 500 was down 8.9% for the week, its worst loss since the week of Feb. 28.\n*****\n&gt; “I think we needed to get through this week, in particular — the one where the country went into shut down and now get the second go around of policy response. If they really do bring out the bazookas we should be darn close” to the bottom, said Barry Knapp, Ironsides Macroeconomics director of research.\n*****\n&gt; But strategists also point out that the coronavirus is unpredictable and it is hard to say when it will peak, even though many economists expect a bounce back in economic growth by the fourth quarter.\n*****\n&gt; President Donald Trump declared a state of emergency Friday, which allows him to tap federal agencies to provide emergency funds and other responses to the crisis. The president also announced the government would buy oil to fill the Strategic Petroleum Reserves and that 1.4 million test kits would be available in the next week.\n*****\n&gt; Markets will also be looking for further action, which the Trump administration says could include targeted financial aid to industries that are hard hit, like airlines.\n*****\n&gt; As communities around the country attempt to stop the spread of the virus, the potential hit to the economy grows. Companies have told workers to work from home, universities are shutting campuses, a handful of states closed public schools, and major sporting and other events have been canceled.\n*****\n&gt; “If it indeed is declared a recession, it will really only be a three-month drop in activity,” said Knapp. “In 2008, the household sector had the highest debt levels it ever had, and the household sector was in no position to respond to stimulus. This is quite different.”\n*****\n&gt; “We see where are are today is pricing in a recession. It went from a growth scare down to recession territory,” said Calvasina. She said the market is not ready to move higher yet. “I think something else we’ve got to see in addition to extreme panic ratings from the sentiment indicators, we do need to see the news flow get better on the virus.”\n*****\n&gt; Investors will continue to look for more action from Washington, and in the coming week it will also be the Fed’s policy response that could drive the market.\n*****\n&gt; “In light of the continued growth in coronavirus cases in the US and globally, the sharp further tightening in financial conditions, and rising risks to the economic outlook, we now expect the FOMC to cut the funds rate 100bp on March 18, a faster return to the crisis-era 0-0.25% rate than under our previous call for two 50bp steps in March and April,” Goldman economists wrote.\n*****\n&gt; The Fed on Thursday announced a significant increase in funds available for its repo operations, to provide liquidity for the short term funding markets. It also said it would purchase a broad range of Treasury securities, across maturities, with the $60 billion it currently uses to buy Treasury bills on a monthly basis.\n*****\n&gt; Economists say the Fed could announce other policy moves, like purchases of mortgage securities. Some expect it to return to a “patient” stance, showing a willingness to keep rates extremely low for a long time.\n*****\n&gt; Analysts have been watching the corporate bond market, where spreads blew out dramatically in the past week, particularly in high yield. Calvasina said she is not yet concerned.\n*****\n&gt; “We’ve got problems in energy. We have problems in some hospitality related industries. There are pockets of stress, but for me, when I look across most S&amp;P companies’ balance sheets are in really good shape,” Calvasina said. “I don’t think this is a prolonged sort of downturn.”\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/iG7ENVB.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/4gwPTzC.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/h9DkOZJ.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/4m2QVZH.png))**\n\n# **Sector Performance WTD, MTD, YTD:**\n###### **([CLICK HERE FOR FRIDAY'S PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_t.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE WEEK-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_w.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE MONTH-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_m.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE 3-MONTH PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_q.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE YEAR-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_ytd.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE 52-WEEK PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_y.png&amp;rev=636115211971930604))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/akOOH97.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/slVwGv2.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/ASyHg6a.png)**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/rbgSrGQ.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/9nZfl7V.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/eS99ijc.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/tEs62Hh.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/kMQTBj6.png))**\n###### **([CLICK HERE FOR THE CHART LINK #3!](https://i.imgur.com/toentZ2.png))**\n###### **([CLICK HERE FOR THE CHART LINK #4!](https://i.imgur.com/ozn837y.png))**\n\n*****\n\n# Signs Of A Washout?\n\n&gt; The S&amp;P 500 Index’s historic slide continued yesterday, culminating in nearly a 10% loss for the day, and leaving the benchmark index officially in bear market territory, just 16 trading days after setting a record high on February 19. In addition, the S&amp;P 500 has now moved more than 4% each day this week, leaving investors and professionals alike wondering when this volatility could end. While nobody knows for sure, one thing we always look for at market bottoms are signs of extremes, both from a sentiment and price perspective.\n\n&gt; From an anecdotal sentiment perspective, certainly fears of COVID-19 have reached the masses, with travel plans canceled and announcements of major events called off coming nearly every hour. However, investor survey data shows a similar story with the American Association of Individual Investors (AAII) Investor Sentiment Survey showing the highest percentage of bears since April 2013. In addition, the National Association of Active Investment Managers (NAAIM) Exposure Index, which represents the average exposure to US equity markets by the surveyed investment managers, reached its lowest level since September 2015. Following each of those instances, the S&amp;P 500 rallied more than 13% over the next year.\n\n&gt; Another way of gauging sentiment can be from the internals of the market. While the S&amp;P 500 is now well below its 200-day moving average, that doesn’t mean each stock in the index has moved below its respective 200-day moving average. In fact, regardless of the broad market’s trend, when less than 20% of the individual components of the index are trading below their 200-day moving averages, it is considered an extreme. As shown in the LPL Chart of the Day, Thursday’s sell-off left less 6% of the S&amp;P 500 there, a number last seen in March 2009. “These are truly frightening times,” explained LPL Financial Senior Market Strategist Ryan Detrick. “However, it is important to remember that the signs of panic we are seeing are typically found at or near major market lows.”\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/03/Signs_of_Washout.png?ssl=1))**\n\n*****\n\n# The Fastest Bear Market Ever\n\n&gt; The historic volatility continues, with the Dow Jones Industrial Average officially setting its fastest move from a new all-time high to a bear market (down 20% from the highs) in the 124-year history of the index. It took only 19 days for this to take place, which is far and away the new record.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/03/Bear-market-1-1.png?ssl=1))**\n\n&gt; Not to be outdone, the S&amp;P 500 Index is set to close down 20% from all-time highs today, doing this in only 16 days. Again, as of the time we are writing this blog, the S&amp;P 500 is in bear market territory, but there always could be a chance for a late-day rally.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/03/Bear-market-2.png?ssl=1))**\n\n&gt; “From major sports postponing their seasons, to travel bans to Europe, the economic impact of the coronavirus is growing exponentially with each passing day,” said LPL Financial Senior Market Strategist Ryan Detrick. “Markets are pricing in a potential recession and inevitable second quarter slowdown, but it is all about expectations. Should the virus be contained and the worst-case scenarios not materialize, now could be a nice opportunity for longer-term investors.”\n\n&gt; Last, one of Warren Buffett’s most famous quotes is, “Be fearful when others are greedy and be fearful when others are fearful.” We’ve seen many signs of extreme fear the past few days, but the CNN Fear &amp; Greed Index hitting 1 earlier today is quite a historic level of fear. This proprietary indicator looks at multiple inputs (like put/call ratios, momentum, and volatility), but on a scale of 1-100, this morning’s 1 is the lowest level ever seen, besting the 2 it hit at the lows in December 2018. From a contrarian point of view, this could be quite meaningful.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/03/Bear-market-3.png?ssl=1))**\n\n*****\n\n# Perspectives on Waterfall Declines\n\n&gt; Volatile market action over the several weeks warrants some much needed perspective into the history of these types of waterfall declines. Fortunately, we have this research on hand and have been examining the nature of deep, fast selloffs like we have experience here in early 2020 as well as the nature of the inevitable and often sharp recoveries.\n\n&gt; First of all yes, this time is different – and yet it’s not. The headline causes of each of these historic waterfall declines are all different and yet investor, trader and money manager behavior remains rather similar. Fear has once again exposed the market’s overvaluation and weaknesses. This time it’s the fear of the coronavirus pandemic and price war in the oil market that spills over into the rest of the financial.\n\n&gt; Like the previous occurrences of waterfall declines in the table and graphs below the market reacted to fear and sold off fast and hard. It’s too early to tell if this waterfall decline is over or how fast and far the recovery will be. As we continue to analyze the current situation a thorough review of the history of waterfall declines and their subsequent recoveries should provide some much needed perspective.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://66.media.tumblr.com/31cca506c45d87ad962ce9c707baf21a/fc7021573b50880b-76/s500x750/0a6588971f599cbbca194b38b62a47c087875238.jpg))**\n\n*****\n\n# Friday 13th, DJIA Attempting to Recover &amp; End Losing Friday Streak\n\n&gt; Friday is a significant day of the week because it is the last day of trading and positions held over the weekend could be at higher risk of an exogenous event or an unanticipated headline. Pages 143 &amp; 144 of the Stock Trader’s Almanac 2020 show the difference in Friday performance during bull and bear markets. Friday’s have been weaker in bear markets.\n\n&gt; However today, on a Friday the 13th of all days, DJIA is fighting to recover some of its losses this week and to end its streak of down Fridays at seven. Down Friday DJIA losing streaks of seven or more, like the current streak, are actually somewhat rare in history. Prior to this year, DJIA has had just six similar or longer down Friday streaks going back to 1950. The last streak of down Fridays was in March and April of 2017. The longest streak lasted nine Fridays beginning on the last Friday of 2000 and lasting into February 2001.\n\n &gt; In the above chart the 30 trading days before and the 60 trading days after the last six DJIA down Friday losing streaks of seven or more have been plotted to display the average performance before and after the last down Friday of the streak. (There are on average 21 trading days in a typical calendar month) Weakness and lower was the trend during the down Friday streak, but once the streak came to an end, DJIA was higher 60 trading days later.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://66.media.tumblr.com/c8d6237984423d89dc5b20f4a1bf7009/07327bf517318c16-1e/s500x750/13020ac23c0adf1831e35c982c37f1602a236fd1.jpg))**\n\n*****\n\n# Last Stocks Above Their Moving Averages\n\n&gt; The massive declines over the past few weeks have left conditions extremely oversold. As we highlighted in yesterday's Sector Snapshot, breadth has been awful while there is no longer a single stock in the S&amp;P 500 that is overbought (1 or more standard deviations above its 50-DMA). In fact, after yesterday's absolute washout, there is only a small handful of stocks that are above their 50 and 200-DMAs. In regards to the 50-DMA, less than 1% of stocks in the S&amp;P 500 are above this average which is the first time that has happened since 2011. The only time in between that saw a similarly weak reading, although not quite hitting that under 1% requirement was back in December of 2018 when 1.19% of stocks were above their 50-DMA. As for the 200-DMA, only 5.59% are above that level. That is the lowest reading since March of 2009.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/03/MAs.png))**\n\n&gt; The average stock is now 26.56% below its 50-day and 24.5% below its 200-day. The table below shows those 22 remaining stocks that are still above their 200-DMAs as of yesterday's close and the few that are also below their 50-DMA. Of these, only Regeneron (REGN), Kroger (KR), Digital Realty Trust (DLR), and Gilead Sciences (GILD) are also above their 50-DMAs. The only other stock in the index that is also above its 50-DMA is Cabot Oil and Gas (COG), though it is 11% below its 200-DMA. While these stocks have all held above their long term moving average recently, only GILD and REGN have risen since the index's high on 2/19.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/03/Above-200-table2.png))**\n\n*****\n\n# Selloff Erases All of US Market Cap Gains Since Election Day 2016\n\n&gt; With the US stock market down nearly 7% yet again today, the total market cap of US companies as measured by the Russell 3,000 has fallen $11.5 trillion in less than a month. On February 19th, total US market cap was just over $35 trillion. It's at $23.8 trillion as of this morning.\n\n&gt; What makes this drop even more noteworthy is that $23.8 trillion was the market cap of US companies on Election Day 2016. At this point in time, all of the market cap gains seen since President Trump's election victory have been wiped out.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/03/raymktcap.png))**\n\n*****\n\n# Low Rates Send Mortgage Applications Surging\n\n&gt; Coronavirus fears have broadly sent rates lower over the past month. Currently, the national average for a 30-year fixed-rate mortgage stands at 3.68%; just off the low of 3.55% from earlier in the month. With mortgage rates now basically at their lowest levels since late 2016, homeowners have been quickly enticed to jump on these lower rates.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/03/MRNA.png))**\n\n&gt; Last week, weekly mortgage applications from the Mortgage Bankers Association showed a roughly 15% surge as rates were reaching record lows. In the time since then, the Fed's 50 bps cut came into effect and yields fell even further which led mortgage applications this week to surge 55.4%. That is the highest week over week increase in mortgage applications since November of 2008 when they had risen 112.1%. Outside of that period, we've only seen larger weekly increases a few other times since 1990.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/03/MA-1.png))**\n\n&gt; The spike was driven largely by refinancing applications which rose 78.6% week-over-week. As with the composite, that was the biggest weekly jump in refi applications since the housing bubble. Prior to that, once again you would need to go back to 2001 or the 1990s to find larger weekly increases in mortgage refinance applications.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/03/MA-ref.png))**\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * **$NIO** \n&gt; * **$HQY** \n&gt; * **$FCEL** \n&gt; * **$MOMO** \n&gt; * **$FDX** \n&gt; * **$CRWD** \n&gt; * **$HUYA** \n&gt; * **$NBEV** \n&gt; * **$BE** \n&gt; * **$MDB** \n&gt; * **$BZUN** \n&gt; * **$BILI** \n&gt; * **$YY** \n&gt; * **$COUP** \n&gt; * **$MUX** \n&gt; * **$FIVE** \n&gt; * **$TME** \n&gt; * **$MIK** \n&gt; * **$CVSI** \n&gt; * **$ACRX** \n&gt; * **$ACN** \n&gt; * **$GES** \n&gt; * **$WPRT** \n&gt; * **$OLLI** \n&gt; * **$GIS**\n&gt; * **$CPRX** \n&gt; * **$PLCE** \n&gt; * **$DRI** \n&gt; * **$TLRD** \n&gt; * **$ZTO** \n&gt; * **$BAX** \n&gt; * **$LEN** \n&gt; * **$DLTH** \n&gt; * **$HDS** \n&gt; * **$CTAS** \n&gt; * **$SMAR** \n&gt; * **$WSM** \n&gt; * **$TCOM** \n&gt; * **$HIBB** \n&gt; * **$REI** \n&gt; * **$DBI** \n&gt; * **$CTRA** \n&gt; * **$GPL** \n&gt; * **$CMC**\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/9nZfl7V.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/EKAkJgU.png))**\n###### **([CLICK HERE FOR  THE MOST NOTABLE EARNINGS RELEASES BEFORE MONDAY'S OPEN!](https://i.imgur.com/631cGTg.jpg))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 3.16.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/FLCjERW.png))\n\n\n&gt; # ***Monday 3.16.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/GCK6dns.png))\n\n\n*****\n\n&gt; # ***Tuesday 3.17.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/J7uVG2b.png))\n\n&gt; # ***Tuesday 3.17.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/ADUyE5E.png))\n\n*****\n\n&gt; # ***Wednesday 3.18.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/q2AM8aO.png))\n\n&gt; # ***Wednesday 3.18.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/sXXUKYj.png))\n\n*****\n\n&gt; # ***Thursday 3.19.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/ZISY7gz.png))\n\n&gt; # ***Thursday 3.19.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/pgdAKJu.png))\n\n*****\n\n&gt; # ***Friday 3.20.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!]())\nNONE.\n\n*****\n\n&gt; # ***Friday 3.20.20 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\nNONE.\n\n*****\n\n# NIO Inc. $3.11\n&gt; **NIO Inc. (NIO)** is confirmed to report earnings at approximately 6:40 AM ET on Wednesday, March 18, 2020. The consensus estimate is for a loss of $0.37 per share on revenue of $412.45 million and the Earnings Whisper ® number is ($0.34) per share. Investor sentiment going into the company's earnings release has 46% expecting an earnings beat The company's guidance was for revenue of approximately $393.00 million. Consensus estimates are for year-over-year earnings growth of 24.49% with revenue decreasing by 17.46%. Short interest has decreased by 21.0% since the company's last earnings release while the stock has drifted higher by 6.5% from its open following the earnings release to be 5.8% above its 200 day moving average of $2.94. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, March 13, 2020 there was some notable buying of 1,321 contracts of the $2.00 put expiring on Friday, April 3, 2020. Option traders are pricing in a 21.9% move on earnings and the stock has averaged a 20.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=NIO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# HealthEquity, Inc. $53.99\n&gt; **HealthEquity, Inc. (HQY)** is confirmed to report earnings at approximately 4:00 PM ET on Monday, March 16, 2020. The consensus earnings estimate is $0.34 per share on revenue of $198.49 million and the Earnings Whisper ® number is $0.37 per share. Investor sentiment going into the company's earnings release has 73% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 25.93% with revenue increasing by 161.94%. Short interest has decreased by 21.5% since the company's last earnings release while the stock has drifted lower by 21.4% from its open following the earnings release to be 18.3% below its 200 day moving average of $66.07. Overall earnings estimates have been revised higher since the company's last earnings release. On Wednesday, March 4, 2020 there was some notable buying of 551 contracts of the $65.00 put expiring on Friday, September 18, 2020. Option traders are pricing in a 19.4% move on earnings and the stock has averaged a 4.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=HQY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# FuelCell Energy, Inc. $1.15\n&gt; **FuelCell Energy, Inc. (FCEL)** is confirmed to report earnings at approximately 7:00 AM ET on Monday, March 16, 2020. The consensus estimate is for a loss of $0.09 per share on revenue of $9.80 million and the Earnings Whisper ® number is ($0.10) per share. Investor sentiment going into the company's earnings release has 49% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 50.00% with revenue decreasing by 44.89%. Short interest has increased by 20.7% since the company's last earnings release while the stock has drifted lower by 46.8% from its open following the earnings release to be 23.2% above its 200 day moving average of $0.93. Overall earnings estimates have been revised lower since the company's last earnings release. The stock has averaged a 30.5% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=FCEL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Momo Inc. $23.57\n&gt; **Momo Inc. (MOMO)** is confirmed to report earnings at approximately 3:15 AM ET on Thursday, March 19, 2020. The consensus earnings estimate is $0.74 per share on revenue of $654.51 million and the Earnings Whisper ® number is $0.77 per share. Investor sentiment going into the company's earnings release has 77% expecting an earnings beat The company's guidance was for revenue of $642.00 million to $656.00 million. Consensus estimates are for year-over-year earnings growth of 32.14% with revenue increasing by 17.07%. Short interest has increased by 54.1% since the company's last earnings release while the stock has drifted lower by 37.4% from its open following the earnings release to be 31.0% below its 200 day moving average of $34.17. Overall earnings estimates have been revised higher since the company's last earnings release. On Tuesday, March 10, 2020 there was some notable buying of 1,063 contracts of the $27.00 call expiring on Friday, April 17, 2020. Option traders are pricing in a 18.0% move on earnings and the stock has averaged a 8.0% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=MOMO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# CrowdStrike, Inc. $39.55\n&gt; **CrowdStrike, Inc. (CRWD)** is confirmed to report earnings at approximately 4:05 PM ET on Thursday, March 19, 2020. The consensus estimate is for a loss of $0.08 per share on revenue of $137.67 million and the Earnings Whisper ® number is ($0.06) per share. Investor sentiment going into the company's earnings release has 82% expecting an earnings beat The company's guidance was for a loss of $0.09 to $0.08 per share on revenue of $136.00 million to $139.00 million. Short interest has decreased by 52.2% since the company's last earnings release while the stock has drifted lower by 26.8% from its open following the earnings release. Overall earnings estimates have been revised higher since the company's last earnings release. The stock has averaged a 10.4% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=CRWD&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# FedEx Corp. $106.63\n&gt; **FedEx Corp. (FDX)** is confirmed to report earnings at approximately 4:00 PM ET on Tuesday, March 17, 2020. The consensus earnings estimate is $1.69 per share on revenue of $17.19 billion and the Earnings Whisper ® number is $1.67 per share. Investor sentiment going into the company's earnings release has 23% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 44.22% with revenue increasing by 1.06%. Short interest has increased by 16.0% since the company's last earnings release while the stock has drifted lower by 29.6% from its open following the earnings release to be 31.2% below its 200 day moving average of $154.91. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, March 10, 2020 there was some notable buying of 1,131 contracts of the $85.00 put expiring on Friday, April 17, 2020. Option traders are pricing in a 17.4% move on earnings and the stock has averaged a 7.8% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=FDX&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# HUYA Inc. $15.40\n&gt; **HUYA Inc. (HUYA)** is confirmed to report earnings at approximately 6:00 PM ET on Monday, March 16, 2020. The consensus earnings estimate is $0.13 per share on revenue of $339.95 million and the Earnings Whisper ® number is $0.15 per share. Investor sentiment going into the company's earnings release has 80% expecting an earnings beat The company's guidance was for revenue of $334.00 million to $345.00 million. Consensus estimates are for year-over-year earnings growth of 85.71% with revenue increasing by 55.31%. Short interest has increased by 65.2% since the company's last earnings release while the stock has drifted lower by 38.4% from its open following the earnings release to be 28.9% below its 200 day moving average of $21.66. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, February 21, 2020 there was some notable buying of 774 contracts of the $18.00 put expiring on Friday, July 17, 2020. Option traders are pricing in a 19.3% move on earnings and the stock has averaged a 5.4% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=HUYA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# New Age Beverages Corporation $1.46\n&gt; **New Age Beverages Corporation (NBEV)** is confirmed to report earnings at approximately 6:00 AM ET on Monday, March 16, 2020. The consensus estimate is for a loss of $0.08 per share on revenue of $65.80 million and the Earnings Whisper ® number is ($0.10) per share. Investor sentiment going into the company's earnings release has 53% expecting an earnings beat. Short interest has decreased by 15.8% since the company's last earnings release while the stock has drifted lower by 35.7% from its open following the earnings release to be 49.2% below its 200 day moving average of $2.87. Overall earnings estimates have been revised lower since the company's last earnings release. On Wednesday, March 4, 2020 there was some notable buying of 2,000 contracts of the $1.50 call expiring on Friday, June 19, 2020. The stock has averaged a 5.6% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=NBEV&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Bloom Energy Corporation $6.12\n&gt; **Bloom Energy Corporation (BE)** is confirmed to report earnings after the market closes on Monday, March 16, 2020. Investor sentiment going into the company's earnings release has 64% expecting an earnings beat. Short interest has decreased by 5.4% since the company's last earnings release while the stock has drifted higher by 36.9% from its open following the earnings release to be 21.5% below its 200 day moving average of $7.80. On Tuesday, March 10, 2020 there was some notable buying of 1,772 contracts of the $9.00 call expiring on Friday, March 20, 2020. The stock has averaged a 19.3% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=BE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# MongoDB, Inc. $115.17\n&gt; **MongoDB, Inc. (MDB)** is confirmed to report earnings at approximately 4:05 PM ET on Tuesday, March 17, 2020. The consensus estimate is for a loss of $0.28 per share on revenue of $110.38 million and the Earnings Whisper ® number is ($0.26) per share. Investor sentiment going into the company's earnings release has 73% expecting an earnings beat The company's guidance was for a loss of $0.29 to $0.27 per share on revenue of $109.00 million to $111.00 million. Consensus estimates are for earnings to decline year-over-year by 55.56% with revenue increasing by 29.12%. Short interest has decreased by 6.3% since the company's last earnings release while the stock has drifted lower by 20.4% from its open following the earnings release to be 19.6% below its 200 day moving average of $143.28. Overall earnings estimates have been revised lower since the company's last earnings release. Option traders are pricing in a 18.9% move on earnings and the stock has averaged a 8.4% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=MDB&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/stocks.", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "stocks", "subreddit_id": "t5_2qjfk", "subreddit_subscribers": 535994, "subreddit_type": "public", "thumbnail": "self", "title": "Wall Street Week Ahead for the trading week beginning March 16th, 2020", "total_awards_received": 0, "url": "https://www.reddit.com/r/stocks/comments/fikrze/wall_street_week_ahead_for_the_trading_week/", "whitelist_status": "all_ads", "wls": 6, "created": 1584198847.0}], [[], false, "FundamentalsInvestor", null, [], null, "text", "t2_13nujbn3", false, false, [], false, false, 1583268917, "self.stocks", "https://www.reddit.com/r/stocks/comments/fd1c3s/my_march_03_covid19_stock_pics/", {}, "fd1c3s", true, false, false, false, true, true, false, "", "trades", [], "9f73d782-65e6-11e5-8878-12292be1b4e9", "Trades", "dark", "text", false, false, true, 66, 0, false, "all_ads", "/r/stocks/comments/fd1c3s/my_march_03_covid19_stock_pics/", false, "self", {"enabled": false, "images": [{"id": "-owyyrmnAozxMD3UXazzw2BNWKimciPM2FNfrQI4goU", "resolutions": [{"height": 71, "url": "https://external-preview.redd.it/UHsWCS7bCrCBMh8nVIW9DeMGZ9_8gouO8sglmq76EjM.png?width=108&amp;crop=smart&amp;auto=webp&amp;s=0ce04a49d8b0fa08e9f4b80c4bb6fe47d8d899d8", "width": 108}, {"height": 142, "url": "https://external-preview.redd.it/UHsWCS7bCrCBMh8nVIW9DeMGZ9_8gouO8sglmq76EjM.png?width=216&amp;crop=smart&amp;auto=webp&amp;s=8362e2ae94573bcf203f5507e67e548cee219d11", "width": 216}, {"height": 211, "url": "https://external-preview.redd.it/UHsWCS7bCrCBMh8nVIW9DeMGZ9_8gouO8sglmq76EjM.png?width=320&amp;crop=smart&amp;auto=webp&amp;s=3a3c7134a03290189ed34891f1ea492bd41fdf2b", "width": 320}, {"height": 423, "url": "https://external-preview.redd.it/UHsWCS7bCrCBMh8nVIW9DeMGZ9_8gouO8sglmq76EjM.png?width=640&amp;crop=smart&amp;auto=webp&amp;s=2873152783efea914a50f8b2516c33e8aa291977", "width": 640}, {"height": 635, "url": "https://external-preview.redd.it/UHsWCS7bCrCBMh8nVIW9DeMGZ9_8gouO8sglmq76EjM.png?width=960&amp;crop=smart&amp;auto=webp&amp;s=8b4234e6f1257a6624383899b83d515f1ecea402", "width": 960}, {"height": 714, "url": "https://external-preview.redd.it/UHsWCS7bCrCBMh8nVIW9DeMGZ9_8gouO8sglmq76EjM.png?width=1080&amp;crop=smart&amp;auto=webp&amp;s=72ccdaad30e221a7a1593995c51794491c9f9ab8", "width": 1080}], "source": {"height": 1087, "url": "https://external-preview.redd.it/UHsWCS7bCrCBMh8nVIW9DeMGZ9_8gouO8sglmq76EjM.png?auto=webp&amp;s=d1d96a3ef868c6dba80981ddecea1e474497ffae", "width": 1643}, "variants": {}}]}, 6, 1583268923, 1, "I've attempted to map COVID-19 impacts to the economy based upon my view of the cascading effects of human behavior, company behavior, supply chains, spending, etc, and resulting impact to company profits and guidance.  Starting with this very basic diagram.  [Draft impact diagram](https://i.imgur.com/IBDwooK.png)  and [Coggle source](https://coggle.it/diagram/Xlkbg4XWyqFLMmnR/t/covid-19-impact-on-the-economy/7f1e5110c045d1e2e21815c7bc43242ebfa439967f15ae7d8a8f9dc1a98435ff).  Here are the positions I picked up on Mon 2-Mar and will likely hold for a month:\n\n**LONG STOCK OR CALL:  PYPL, EBAY, SHOP, V, MMM, HBIO, GILD, VIVO, RGR**\n\n**SHORT SELLS AND PUTS:  TJX, Starbucks, Nautilus, Las Vegas Sands, Wyndham, Brunswick, Transdigm, Textron, Parker Hannifan**\n\nSo far, outperforming the market\n\n-----------------------\n\nBULLISH implications (most certain, positive &amp; near-term first...  **BOLD** = known COVID-19 exposure):\n\n* Protective Equip --&gt; **MMM, CLX, CTAS, KMB**\n* RX + Vaccine + Testing --&gt; **GILD, MRNA, NVAX, NNVC, IBIO, CODX, OPGN**, BDX, BSX, HYH, INVA, BMY, MDCO, ACHN, ENTA, INO, MLNT, QDEL, SRPT, SVA, TBPH, CEMI, DVAX, GNCA, OSUR  (be careful, lots of potential misses!  [more analysis here](https://www.reddit.com/r/investing/comments/fbbbhn/corona_virus_research_and_stock_dd_part_2/))\n* Med Devices + Equip --&gt; **APT, AHPI (careful microstock), HBIO**, DHR, RMD, DIO, HRC, ICUI, STE, TFX, A, BAX, EW, MDT, CL, KMB, LAKE, BIMI, LLIT\n* Medical Distribution --&gt; ABC, CAH, HSIC, MCK\n* Guns &amp; Ammo --&gt; RGR, OLN, AOBC, NPK\n* Online Purchases --&gt; AMZN, FISV, WP, V, GPN, FRPT, PYPL, SHOP, EBAY, ETSY\n* Hospitals + Medical Svcs --&gt; HCSG, HCA, CYH, LPNT, UHS\n* Home Care + Deathcare --&gt; AMED, LHCG, CSV, STON\n* Internet and Media --&gt; NFLX, FB, TWTR, T, VZ, CTL, FTR, S, TMUS, AMCX, CBS, DISCA, FOX, VIA, DIS\n* Wine &amp; Spirits --&gt; BF.A, STZ, DEO, BREW, TAP, BUD\n* Gaming --&gt; ATVI, EA, TTWO\n* Online Education --&gt; CHGG, XRS, APOL, CPLA, DV, STRA\n* Home Comfort &amp; DIY --&gt; TPX, HD, LOW\n\nBEARISH implications (most certain, destructive &amp; near-term first):\n\n* Cruise Ships --&gt; CCL, NCLH, RCL\n* Hotels --&gt; HLT, IHG, MAR, WH\n* Fitness Clubs --&gt; BC, NLS, PLNT\n* Casinos --&gt; LVS, MGM, WYNN\n* Restaurants --&gt; CMG, CBRL, DRI, JACK, SBUX, PLAY, RRGB, CAKE\n* Community Gatherings --&gt; BWL-A, AMC, CNK, MCS, RDI, ISCA, SEAS, SIX, IMAX\n* Sporting Events / Venues --&gt; MSG, MANU, WWE\n* Furniture OEs &amp; Retail --&gt; ESND, SCS, MLHR, FLXS, ETH, BBBY, BSET, LEG, HOFT, TCS, WSM, RCII, AAN\n* Other Retail --&gt;  ODP, LULU, JWN, TJX, GPS, FL, ROST, DG, DLTR\n* Flight Hours Decline --&gt; TXT, PH, TDG, UTC, HON, GE, RR, BAE, BA, AAL, DAL, LUV, UAL  (be careful with airlines, the low price of fuel is a huge tailwind for their earnings...  also remember that Boeing is 50% defense and already down from recent scandal...  parts manufacturers will get hit especially the first three here, short those!)\n* Intl Container &amp; Crude Carriers --&gt; CMRE, MATX, EURN, KEX, NAT, OSG, TGP, GLOG, GLNG\n* Health Insurance Cost Spike --&gt; ANTM, CI, HUM, UNH\n* Office Supplies &amp; Services --&gt; ACCO, EBF, RRD, XRX\n* Consumer Luxuries --&gt; AVP, COTY, EL, NUS, REV\n* Auto Mileage Decline + China supply chain --&gt; GPC, AAP, AZO, ORLY, CASY, MUSA\n* Capital Equip Pushed Out --&gt; TXT, JCI, LII, WSO, FAST, SNA, SWH\n* Construction Delayed --&gt; AYI, TILE, LL, USG, PPG, SHW, MAS, DOOR, BCC, UFPI, MLM, VMC, OC, CAT, DE\n* New Home Builds Delayed --&gt; DHI, LEN, NVR, PHM, TOL", true, false, false, "stocks", "t5_2qjfk", 516112, "public", "self", "My March 03 Covid-19 Stock Pics", 0, "https://www.reddit.com/r/stocks/comments/fd1c3s/my_march_03_covid19_stock_pics/", "all_ads", 6, 1583265317.0, {"all_awardings": [], "allow_live_comments": false, "author": "FundamentalsInvestor", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_13nujbn3", "author_patreon_flair": false, "author_premium": false, "awarders": [], "can_mod_post": false, "contest_mode": false, "created_utc": 1583268917, "domain": "self.stocks", "full_link": "https://www.reddit.com/r/stocks/comments/fd1c3s/my_march_03_covid19_stock_pics/", "gildings": {}, "id": "fd1c3s", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_css_class": "trades", "link_flair_richtext": [], "link_flair_template_id": "9f73d782-65e6-11e5-8878-12292be1b4e9", "link_flair_text": "Trades", "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 66, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/stocks/comments/fd1c3s/my_march_03_covid19_stock_pics/", "pinned": false, "post_hint": "self", "preview": {"enabled": false, "images": [{"id": "-owyyrmnAozxMD3UXazzw2BNWKimciPM2FNfrQI4goU", "resolutions": [{"height": 71, "url": "https://external-preview.redd.it/UHsWCS7bCrCBMh8nVIW9DeMGZ9_8gouO8sglmq76EjM.png?width=108&amp;crop=smart&amp;auto=webp&amp;s=0ce04a49d8b0fa08e9f4b80c4bb6fe47d8d899d8", "width": 108}, {"height": 142, "url": "https://external-preview.redd.it/UHsWCS7bCrCBMh8nVIW9DeMGZ9_8gouO8sglmq76EjM.png?width=216&amp;crop=smart&amp;auto=webp&amp;s=8362e2ae94573bcf203f5507e67e548cee219d11", "width": 216}, {"height": 211, "url": "https://external-preview.redd.it/UHsWCS7bCrCBMh8nVIW9DeMGZ9_8gouO8sglmq76EjM.png?width=320&amp;crop=smart&amp;auto=webp&amp;s=3a3c7134a03290189ed34891f1ea492bd41fdf2b", "width": 320}, {"height": 423, "url": "https://external-preview.redd.it/UHsWCS7bCrCBMh8nVIW9DeMGZ9_8gouO8sglmq76EjM.png?width=640&amp;crop=smart&amp;auto=webp&amp;s=2873152783efea914a50f8b2516c33e8aa291977", "width": 640}, {"height": 635, "url": "https://external-preview.redd.it/UHsWCS7bCrCBMh8nVIW9DeMGZ9_8gouO8sglmq76EjM.png?width=960&amp;crop=smart&amp;auto=webp&amp;s=8b4234e6f1257a6624383899b83d515f1ecea402", "width": 960}, {"height": 714, "url": "https://external-preview.redd.it/UHsWCS7bCrCBMh8nVIW9DeMGZ9_8gouO8sglmq76EjM.png?width=1080&amp;crop=smart&amp;auto=webp&amp;s=72ccdaad30e221a7a1593995c51794491c9f9ab8", "width": 1080}], "source": {"height": 1087, "url": "https://external-preview.redd.it/UHsWCS7bCrCBMh8nVIW9DeMGZ9_8gouO8sglmq76EjM.png?auto=webp&amp;s=d1d96a3ef868c6dba80981ddecea1e474497ffae", "width": 1643}, "variants": {}}]}, "pwls": 6, "retrieved_on": 1583268923, "score": 1, "selftext": "I've attempted to map COVID-19 impacts to the economy based upon my view of the cascading effects of human behavior, company behavior, supply chains, spending, etc, and resulting impact to company profits and guidance.  Starting with this very basic diagram.  [Draft impact diagram](https://i.imgur.com/IBDwooK.png)  and [Coggle source](https://coggle.it/diagram/Xlkbg4XWyqFLMmnR/t/covid-19-impact-on-the-economy/7f1e5110c045d1e2e21815c7bc43242ebfa439967f15ae7d8a8f9dc1a98435ff).  Here are the positions I picked up on Mon 2-Mar and will likely hold for a month:\n\n**LONG STOCK OR CALL:  PYPL, EBAY, SHOP, V, MMM, HBIO, GILD, VIVO, RGR**\n\n**SHORT SELLS AND PUTS:  TJX, Starbucks, Nautilus, Las Vegas Sands, Wyndham, Brunswick, Transdigm, Textron, Parker Hannifan**\n\nSo far, outperforming the market\n\n-----------------------\n\nBULLISH implications (most certain, positive &amp; near-term first...  **BOLD** = known COVID-19 exposure):\n\n* Protective Equip --&gt; **MMM, CLX, CTAS, KMB**\n* RX + Vaccine + Testing --&gt; **GILD, MRNA, NVAX, NNVC, IBIO, CODX, OPGN**, BDX, BSX, HYH, INVA, BMY, MDCO, ACHN, ENTA, INO, MLNT, QDEL, SRPT, SVA, TBPH, CEMI, DVAX, GNCA, OSUR  (be careful, lots of potential misses!  [more analysis here](https://www.reddit.com/r/investing/comments/fbbbhn/corona_virus_research_and_stock_dd_part_2/))\n* Med Devices + Equip --&gt; **APT, AHPI (careful microstock), HBIO**, DHR, RMD, DIO, HRC, ICUI, STE, TFX, A, BAX, EW, MDT, CL, KMB, LAKE, BIMI, LLIT\n* Medical Distribution --&gt; ABC, CAH, HSIC, MCK\n* Guns &amp; Ammo --&gt; RGR, OLN, AOBC, NPK\n* Online Purchases --&gt; AMZN, FISV, WP, V, GPN, FRPT, PYPL, SHOP, EBAY, ETSY\n* Hospitals + Medical Svcs --&gt; HCSG, HCA, CYH, LPNT, UHS\n* Home Care + Deathcare --&gt; AMED, LHCG, CSV, STON\n* Internet and Media --&gt; NFLX, FB, TWTR, T, VZ, CTL, FTR, S, TMUS, AMCX, CBS, DISCA, FOX, VIA, DIS\n* Wine &amp; Spirits --&gt; BF.A, STZ, DEO, BREW, TAP, BUD\n* Gaming --&gt; ATVI, EA, TTWO\n* Online Education --&gt; CHGG, XRS, APOL, CPLA, DV, STRA\n* Home Comfort &amp; DIY --&gt; TPX, HD, LOW\n\nBEARISH implications (most certain, destructive &amp; near-term first):\n\n* Cruise Ships --&gt; CCL, NCLH, RCL\n* Hotels --&gt; HLT, IHG, MAR, WH\n* Fitness Clubs --&gt; BC, NLS, PLNT\n* Casinos --&gt; LVS, MGM, WYNN\n* Restaurants --&gt; CMG, CBRL, DRI, JACK, SBUX, PLAY, RRGB, CAKE\n* Community Gatherings --&gt; BWL-A, AMC, CNK, MCS, RDI, ISCA, SEAS, SIX, IMAX\n* Sporting Events / Venues --&gt; MSG, MANU, WWE\n* Furniture OEs &amp; Retail --&gt; ESND, SCS, MLHR, FLXS, ETH, BBBY, BSET, LEG, HOFT, TCS, WSM, RCII, AAN\n* Other Retail --&gt;  ODP, LULU, JWN, TJX, GPS, FL, ROST, DG, DLTR\n* Flight Hours Decline --&gt; TXT, PH, TDG, UTC, HON, GE, RR, BAE, BA, AAL, DAL, LUV, UAL  (be careful with airlines, the low price of fuel is a huge tailwind for their earnings...  also remember that Boeing is 50% defense and already down from recent scandal...  parts manufacturers will get hit especially the first three here, short those!)\n* Intl Container &amp; Crude Carriers --&gt; CMRE, MATX, EURN, KEX, NAT, OSG, TGP, GLOG, GLNG\n* Health Insurance Cost Spike --&gt; ANTM, CI, HUM, UNH\n* Office Supplies &amp; Services --&gt; ACCO, EBF, RRD, XRX\n* Consumer Luxuries --&gt; AVP, COTY, EL, NUS, REV\n* Auto Mileage Decline + China supply chain --&gt; GPC, AAP, AZO, ORLY, CASY, MUSA\n* Capital Equip Pushed Out --&gt; TXT, JCI, LII, WSO, FAST, SNA, SWH\n* Construction Delayed --&gt; AYI, TILE, LL, USG, PPG, SHW, MAS, DOOR, BCC, UFPI, MLM, VMC, OC, CAT, DE\n* New Home Builds Delayed --&gt; DHI, LEN, NVR, PHM, TOL", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "stocks", "subreddit_id": "t5_2qjfk", "subreddit_subscribers": 516112, "subreddit_type": "public", "thumbnail": "self", "title": "My March 03 Covid-19 Stock Pics", "total_awards_received": 0, "url": "https://www.reddit.com/r/stocks/comments/fd1c3s/my_march_03_covid19_stock_pics/", "whitelist_status": "all_ads", "wls": 6, "created": 1583265317.0}]]