{
  "2020-0-1": [
    {
      "selftext": "I recieves word that $BSGM just published a 8-K form and 424B5 form. I am not sure how to interpret these documents. Does the 8-K form mean that corporate changea await such as the CEO stepping down or the ticker being delisted? Does the 424B5 form mean that $BSGM is looking to expand?\n\n(Link)[https://fintel.io/s/us/bsgm?utm_source=stocktwits.com&amp;utm_medium=Social&amp;utm_campaign=filing]",
      "title": "Please help me understand financial statements.",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 4,
      "created_utc": 1577836976
    },
    {
      "selftext": "Good sign? Is there a catch? I’ve learned to realize not all “amazing” news is an end all be all sign.",
      "title": "What’s it mean if Morgan Stanley buys up 6% of a company’s shares?",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 6,
      "created_utc": 1577837704
    },
    {
      "selftext": "Love or hate it, it is undeniable that Google is one of the most innovative companies in the world over the past 20 years. And it is undeniable that their corporate culture had a lot to do with driving innovation and disrupting industries.      \n\nNow that the company has over 100K+ employees, there are serious concerns that the culture that made Google Google will be able to survive. \n\n&amp;#x200B;\n\n \n\n# [Google veterans: The company has become ‘unrecognizable’](https://www.cnbc.com/2019/12/31/google-veterans-the-company-has-become-unrecognizable.html)",
      "title": "Google veterans: The company has become ‘unrecognizable’",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 235,
      "created_utc": 1577838850
    },
    {
      "selftext": "Just recently got into option trading and have 2 contracts for SO at a strike for 63.50 with it currently sitting at 63.70 and expiration date on the third as far as I understand I th in no I'm doin alright so far.",
      "title": "Option trading",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 19,
      "created_utc": 1577840288
    },
    {
      "selftext": "[removed]",
      "title": "New to stocks",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 0,
      "created_utc": 1577840868
    },
    {
      "selftext": "Just saying",
      "title": "The stock market is starting to remind me of the 1920s",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 1,
      "created_utc": 1577841445
    },
    {
      "selftext": "Hey everyone I recently got into the stock market and I was wondering what stocks you would recommend. I don't have the time to day trade due to school. I am looking for stocks to buy and hold for a bit. I already bought 1 share of Visa and Microsoft.\n\nI appreciate any suggestions!",
      "title": "Stocks for beginners",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 7,
      "created_utc": 1577841939
    },
    {
      "selftext": "Whether it is a minimum or maximum value, does your company need to hit this point to have a successful IPO or direct listing? Does this number contrast depend on the stock exchange you list to ( in America the NYSE or Nasdaq ) . And does the company need to have a certain valuation above like around ten million? \n\nAlso, does anyone know which stock out of all the global markets has returned the highest amount of usd on a monthly or quarterly basis? Not in % dividend yield , but as a simple number. Thanks for any responses!",
      "title": "When going public, does your company need to have a certain amount of shares and valuation?",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 3,
      "created_utc": 1577841943
    },
    {
      "selftext": "",
      "title": "So what stocks will you buy at the start of 2020?",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 1,
      "created_utc": 1577842548
    },
    {
      "selftext": "How can the Washington Prime Group give a 28% dividend?",
      "title": "WPG Dividends",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 0,
      "created_utc": 1577845163
    },
    {
      "selftext": "I always thought of Bonds as being sort of like equity in the government. Today I heard that Bonds typically move in the opposite direction of the stock market. This made me think maybe I don't know anything about them. \n\nSo since the stock market is doing abnormally well, does that mean I should be loading up on Bonds and then sell those when the stock market falls so I can buy a bunch of stocks? \n\nAlso, are there any resources I can use to learn more about this? How do you even buy and sell Bonds?",
      "title": "So how do Bonds work?",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 7,
      "created_utc": 1577845934
    },
    {
      "selftext": "",
      "title": "Apple Amazon Disney Microsoft. My 2020 never sell stocks.",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 1,
      "created_utc": 1577847899
    },
    {
      "selftext": "MARKET CRASH 2020!!! WATCH HOW TO STAY CONSISTENT",
      "title": "Is The Stock Market Going To Crash In 2020?",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 0,
      "created_utc": 1577853468
    },
    {
      "selftext": "I don't know how tf to predict where it's going, I'm down 48% on $178 worth, not much but we I'll it ever go up again or can it still go way down? Also what does decay mean?",
      "title": "Should I sell my ugaz shares? What's decay?",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 15,
      "created_utc": 1577855560
    },
    {
      "selftext": "[removed]",
      "title": "Annual Forecast for Facebook (FB) – 2020",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 0,
      "created_utc": 1577863982
    },
    {
      "selftext": "These daily discussions run from Monday to Friday including during our themed posts.\n\nSome helpful links:\n\n* [Finviz](https://finviz.com/quote.ashx?t=amd) for charts, fundamentals, and aggregated news\n* StreetInsider news:\n  * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing\n  * [Corporate News](https://www.streetinsider.com/Corporate+News)\n  * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n  * [Economic data](https://www.streetinsider.com/Economic+Data)\n  * [FED](https://www.streetinsider.com/Fed) - Federal Reserve news\n\nIf you have a basic question, for example \"what is EPS,\" then google \"investopedia EPS\" and click the investopedia article on it; do this for everything until you have a more in depth question or just want to share what you learned.\n\nPlease discuss your portfolios in the [Rate My Portfolio sticky.](https://www.reddit.com/r/stocks/search?sort=new&amp;q=Rate+My+Portfolio+-+r%2FStocks+Quarterly+Thread&amp;t=all&amp;restrict_sr=on).\n\nSee our past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)  Also links for:  [Technicals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Atechnicals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Tuesday, [Options Trading](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoptions&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Thursday, and [Fundamentals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Afundamentals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Friday.",
      "title": "r/Stocks Daily Discussion Wednesday - Jan 01, 2020",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 10,
      "created_utc": 1577866055
    },
    {
      "selftext": "Just a question from a non-investor.\n\nWhat companies should you thing will flourish in 2020 and what companies stocks do you think it will go down?",
      "title": "So what stocks do you have in mind for 2020?",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 34,
      "created_utc": 1577876771
    },
    {
      "selftext": "Is there a free stock tracker app that provides email alerts whenever it drops a certain % or crosses a specific threshold that is set by the user?\n\nThanks.",
      "title": "Free Stock Tracker App that has email alerts?",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 6,
      "created_utc": 1577877009
    },
    {
      "selftext": "I startede trading about a week ago. I al currently looking into ETF's but I want to speed my investment out across three different markers, the US, Europe and the BRIC countries. \nMy rationale for the three markets is solid growth in the US, Europe and potential for massive growth in India and China over the next few centuries. \nAlso by spreading my investments across three continents, chances are that a looming recession might land a softer blow in my portfolio, as per my rationale.\n\nThe ETF's I'm interested in are:\n\niShares Core S&amp;P 500 UCITS ETF USD (Dist)\nVanguard Euro STOXX 50 UCITS ETF (EUR) Distributing\niShares BRIC 50 UCITS ETF USD (Dist)\n\nWhat are your thoughts on this? Do you agree with my strategy or would you propose something else? \n\nI am also looking into buying stocks, but it will not be anywhere near close to the majority of my portfolio.",
      "title": "Diversifying my portfolio",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 3,
      "created_utc": 1577881888
    },
    {
      "selftext": "I want to invest to make money but I am a beginner. Is Motley Fool a trust worthy site or is it a scam? I want to invest in Tencent, Vipshop, and weed companies because of their potential. The weed companies have different prices per share. Is investing in these companies smart?",
      "title": "Beginner Questions",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 0,
      "created_utc": 1577883494
    },
    {
      "selftext": "Hello!\n\n\nI am a 16 year old boy, who is interested in starting investing. I have had this in mind for quite some time, but I didn't really have an idea of where to start. My parents gifted me a book by Tony Robbins \"Money - master the game\", which I am currently reading. This gave me a slight understandment of investing, but I'm still not sure how to get into investing into stocks. So I figured I should ask the kind community of reddit for help. Maybe you can help me what's the best way to start investing into stocks.\n\nThank you",
      "title": "Beginner",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 0,
      "created_utc": 1577886680
    },
    {
      "selftext": "Hello!\n\n\nI am a 16 year old boy, who is interested in starting investing. I have had this in mind for quite some time, but I didn't really have an idea of where to start. My parents gifted me a book by Tony Robbins \"Money - master the game\", which I am currently reading. This gave me a slight understandment of investing, but I'm still not sure how to get into investing into stocks. So I figured I should ask the kind community of reddit for help. Maybe you can help me what's the best way to start investing into stocks.\n\nThank you",
      "title": "Starting investing",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 6,
      "created_utc": 1577887300
    },
    {
      "selftext": "Does anyone have any thoughts about where Nvidia will be in 5-10 years? Stock is on a bounce back from 2018 and I am considering jumping in. I mostly invest in companies for the long term.",
      "title": "Nvidia Thoughts?",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 5,
      "created_utc": 1577888172
    },
    {
      "selftext": "Do you recommend investing in dividend stocks for a beginner investor?\n\nalso can you make a good passive income from dividend stocks? and how much time would it take approximately to make 1000 dollars quarterly for example?",
      "title": "Dividend Stocks",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 12,
      "created_utc": 1577891335
    },
    {
      "selftext": "Hey reddit, I’m a 19 year old and I’m interested in investing but am new to this and would love some guidance on where to start and stuff. I’ve been reading online about the different types of investment options and how to build my portfolio but would like advice from people with experience. How would you have started, any advice on where I should start? Anything I should know? Any advice in general? I’m looking for long term investments and I’ve read something like S&amp;P 500 and some vanguard were good ones to build my portfolio but I can’t remember I just woke up when I’m writing this. I know the only way to gain experience is to start investing but I want to start with some knowledge and guidance lol. Thanks in advance and Happy New Years to all of the Reddit community wish everyone a great year!",
      "title": "In need of some guidance please.",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 8,
      "created_utc": 1577892020
    },
    {
      "selftext": "[https://charts.stocktwits.com/production/original\\_188529018.png](https://charts.stocktwits.com/production/original_188529018.png)   \n\n\nSomeone wrote an app that screen scraped the ocs site (something about fiddling with the shopping cart divulges what's in/out of stock).  Numbers for Pure Sunfarm (joint venture of vff/emh) were matched to vff earnings report for q3 lends some credence to its accuracy.",
      "title": "Weed sales numbers for OCS online (dried flower) last 3mo of 2019",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 4,
      "created_utc": 1577892561
    },
    {
      "selftext": "In 2020 I’ve decided to use my knowledge of business and investment research to build a blog where I’ll be performing research of various stocks each month and providing my opinion on the company as an investment.  To get started, please provide the name of a company you all would like me to research. I’ll post back here a link to my blog and the analysis once I’m done gathering information.",
      "title": "Stock Research Blog - who do you want me to research?",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 38,
      "created_utc": 1577895712
    },
    {
      "selftext": "The e-commerce giant, whose stock has climbed 23% in 2019, has “significant growth opportunities” across its various business lines, the firm’s analysts said.\n\nAmazon.com is the top stock pick for 2020 among analysts at research firm Baird.\n\nThe e-commerce giant, whose stock has climbed 23% in 2019, has “significant growth opportunities” across its various business lines, Baird analysts said in a note Tuesday. Cloud expansion and improved margin trends, expected to take shape during the second quarter, will be catalysts for the stock, the analysts said.\n\nBesides singling out Amazon (ticker: AMZN) as a top pick, the Baird team is generally bullish on platform technology companies such as Alibaba Group Holding (BABA), Alphabet (GOOGL), and Facebook (FB), urging investors: “Don’t bet against the internet!”\n\nEven after all of the advancements in technology that defined the “bustling” 2010s, Baird analysts predict that the next decade will see a “bounty of meaningful technology transitions,” including quantum computing, artificial general intelligence, and the rollout of 6G. (Yes, you read that right—the 5G dream is barely realized and talk has already started on 6G.)\n\nTo be sure, there are headwinds for some of this tech exuberance.\n\nBig tech has come under the scrutiny of lawmakers due to antitrust concerns and fears over how users’ data is used. Politicians are expected to ramp up their attacks during the 2020 election cycle, but Baird analysts dismiss that as “posturing.” The real risk to tech players won’t be forced breakups but management distraction and inaction spurred by the noise. A slowdown in innovation and M&amp;A is possible, they say.\n\nAs for what will drive growth for Amazon and other tech companies, Baird sees several opportunities over the coming decade:\n\n• Networking speeds will increase, boosting efficiencies. Some of the largest platform companies may begin building their own chips and processors.\n\n• There will be new user interfaces as the capabilities of augmented and virtual reality increase, potentially leading to new ways to access e-commerce and online media.\n\n• Media subscription models will continue to dominate, but there may not be much room for many more players in the space.\n\n• “Connected everything,” which means our cars and homes may be an extension of today’s connected devices.\n\n• Cloud wars will continue, providing a huge opportunity for Amazon, Alphabet’s Google, Alibaba, and Microsoft (MSFT).\n\n• E-commerce will be everywhere, and digital-payment options will increase.\n\nSource: Barron's",
      "title": "Amazon Is Baird’s Top Stock Pick for 2020",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 17,
      "created_utc": 1577895724
    },
    {
      "selftext": "Hey everyone, I'm curious what your picks are for emerging 5g companies.",
      "title": "5g stock picks for 2020",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 207,
      "created_utc": 1577896467
    },
    {
      "selftext": "This will be simple and blunt but before you continue reading understand that what I’m telling you will happen.\n\nWell all know amazon is the killer of retail,it’s what Netflix is to blockbuster.Target,Walmart, pretty much 90% of malls are not safe the next decade.\nWhy will Home Depot survive? And not just survive but flourish? It’s simple, contractors, carpenters,plumbers,electricians etc need to be able to leave a job site and go get supply’s/tools fast. With the current state of the housing market and how many buildings we are putting up I expect Home Depot’s profits to increase by 5%-15% for the next 4-5 years.Amazon can’t touch homedepot, like I said the work force needs something in a pinch and homedepot will be here long after retail dies.",
      "title": "Homedepot 10x",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 0,
      "created_utc": 1577900542
    },
    {
      "selftext": "Hey all,\n\nI know this is a bit niche but I was wondering if anyone knows of any stocks where the firm is focusing on edible insects and the like?\n\nThanks :)",
      "title": "Companies focusing on edible insects?",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 13,
      "created_utc": 1577909893
    },
    {
      "selftext": "Nokia delivered a solid third quarter, with positive free cash flow; widespread sales growth; solid operating margin; strong performances in Nokia Enterprise, Nokia Software and IP Routing; and good progress towards meeting our 2019 cost reduction goals. They launched 15 live 5G networks with customers, including Sprint, Verizon, AT&amp;T and T-Mobile in the US; Vodaf.\n\nHow does every feel their stock will be impacted by the surge in 5G networks?",
      "title": "Nokia (NOK) in 2020",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 7,
      "created_utc": 1577909907
    },
    {
      "selftext": "I’ve been in a put mood as of late.\n$TWTR has been on my mind a lot, \nLet me know your thoughts",
      "title": "Twitter Puts",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 9,
      "created_utc": 1577912966
    },
    {
      "selftext": "Considering investing in AMD due to the duopoly on the proccesor market, Aswell as its advantages over Intel, I believe it will eventually balance out but in this next year will continue to grow. Is this a good decision?",
      "title": "Should I invest in AMD?",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 72,
      "created_utc": 1577914402
    }
  ],
  "2020-0-2": [
    {
      "selftext": "Recently in my area (and other areas), JC Penny, Sears (and Kohl's, owned by Sears), and other shops have been going out of business and shutting down. As Amazon grows, and continues to shut down these stores, would it be a good time to sell JC Penny, as The Bon-Ton and Sears have already left?",
      "title": "JC Penny, Sears, and other stores",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 13,
      "created_utc": 1577923996
    },
    {
      "selftext": "I bought my first calls (NOK) last week but didn't see an expiration date. Keep seeing people on here talking about stocks expiring. Do they go bad like milk ? I don't understand someone please enlighten me. Much appreciated",
      "title": "Can someone explain why and when stocks expire ?",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 5,
      "created_utc": 1577925081
    },
    {
      "selftext": "Which one do people prefer and why?",
      "title": "SCHA or VTWO ?",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 1,
      "created_utc": 1577925127
    },
    {
      "selftext": "I’m looking at getting into small cap index funds and have narrowed it down to these two. Is one better than the other ? Thanks!",
      "title": "VTWO or SCHA?",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 1,
      "created_utc": 1577925255
    },
    {
      "selftext": "‪ ‪$DIS has a package w/ hulu &amp; espn+, only $12.99, which is a darn steal. And it’s for people who watch sports, &amp; have kids/like disney produced media, &amp; watch tv. Which is basically THE ENTIRETY of America. Which if babies keep getting born, will always be.  Their streaming service is going nowhere, and will only have more content.  Very especially if more sports are added to espn+, this package will be a need/want for most households and individuals.  \n\nI think Toy Story land was a bad idea, and only made to capitalize on a fad they hoped would catch, but then they made fucking forky.  Who thought that was a marketable object?!?!?!  Also, kids today just aren’t that into Toy Story, kids from the 90s were. Kids from the 90s have kids today who wanna see spiderman. \n\nIt just so happens Disney will have 3 Avengers lands by 2023: California, Paris, and Hong Kong.   I think those parks will crush Star Wars land numbers.  People will also be getting over Harry Potter Land, meaning Disney will be poaching those $$ from those who would’ve had to choose between parks.  \n\nWe’re pretty much guaranteed to have a new original disney character/movie in the next 5 years that will capture the planet.  \n\nWhat do ya’ll think?",
      "title": "$DIS and the quest to 300",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 9,
      "created_utc": 1577927105
    },
    {
      "selftext": "[removed]",
      "title": "12 Rules For Life | Books to Video (Sex &amp; Socialization)",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 0,
      "created_utc": 1577927395
    },
    {
      "selftext": "Hi r/stocks, \n\nlast year I created a similar thread. ([https://www.reddit.com/r/stocks/comments/anbr7e/first\\_year\\_into\\_stocks\\_summary\\_all\\_tech/](https://www.reddit.com/r/stocks/comments/anbr7e/first_year_into_stocks_summary_all_tech/)). I still follow buy and hold strategy and only sell stocks when I don't like certain changes in a company. Sometimes those decisions paid off, sometimes (AAPL) I missed out a bit (nevertheless I don't regret those decisions). \n\nAt some point I was down 30-50% on both NVDA and TSLA, I do strongly believe in both those companies and will not sell either of them in the next 5y for sure. Hitting a bigger number on the portfolio I started diversifying a bit as well. (MA,V,MRK)\n\nStrategy for 2020 is pretty simple for me, I'll invest mostly in AI and cybersececurity companies: First priority is to add a ton of Tencent. Highly recommend the book: \"AI Superpowers Book by Kai-Fu Lee\". imo there is no way around AI and probably Asia will be in the driving seat for the first time in 5-10y.\n\n**Be patient, don't panic sell, it might be swingy here and there but if you invest in strong companies it will pay off.** \n\nCurrent portfolio:\n\n* TSLA +56%\n* CRM +46%\n* FTNT +37%\n* MSFT +35%\n* AMZN +31%\n* MRK +9%\n* MA + 9%\n* NNND +8%\n* NVDA +7%\n* V +1%\n\n[https://imgur.com/a/6RJNKXU](https://imgur.com/a/6RJNKXU)",
      "title": "second year into stocks - mostly tech (summary)",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 30,
      "created_utc": 1577930384
    },
    {
      "selftext": "When people discuss companies that will benefit from the introduction of 5G the same companies seem to come up...Apple, Qualcomm, Nokia, Ericcson, etc.\n\nPeople usually list companies providing the infrastructure for 5G,5G carriers like AT&amp;T or device companies like Apple. If you look at the companies that have benefited the most from increases WIFI and mobile internet speeds over the last decade it has been companies like Netflix, who have used advances in technology to disrupt traditional markets.\n\nThe effects have also been seen in cloud computing with Amazon and Microsoft, and advertising with Google/Amazon (faster networks/easier access = more searches)\n\nOver the next decade there will certainly be companies who leverage 5G to deepen their competitive advantages or new companies that emerge that will disrupt current markets. I would say remote health care might be an example of this,or companies that utilize increased speeds to monetize AI\n\nWhich companies do you all feel fit this description that you're holding for the long term (5 to 10 years and more)",
      "title": "Companies that will benefit from 5G indirectly",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 49,
      "created_utc": 1577930844
    },
    {
      "selftext": "TLDR at bottom.\n\nOver this summer, I want to play around with getting something that is similar to a Bloomberg terminal. I put the title in quotes because it’s not a real terminal anymore but a software application. Current Bloomberg terminals are thousands of dollars for the year. My dad used to work in the banking industry and remembers the actual terminals being around $80 per month. I am flexible about the price but is there anything that is around $200 or below that is rented on a monthly basis? I would want whatever it is to be programmable to the point where I could write code to dictate the buying and selling of stocks, currencies, bonds, and such. \n\nTLDR: Do you know of any stock terminal application that is programmable and costs around $200 for a monthly rental?",
      "title": "Is there any way to get a “terminal” for cheap?",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 6,
      "created_utc": 1577933794
    },
    {
      "selftext": "Anyone know of publicly traded stocks for anti aging/longevity?",
      "title": "Companies focused on longevity / anti-aging?",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 10,
      "created_utc": 1577935157
    },
    {
      "selftext": "[removed]",
      "title": "LONG GME... anyone done any work?",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 0,
      "created_utc": 1577935582
    },
    {
      "selftext": "[removed]",
      "title": "What do y’all think about this, will tech stocks see a correction?",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 1,
      "created_utc": 1577937402
    },
    {
      "selftext": " Think about when railroads were being built across America. When that happened, railroad stocks did really well, but you know what did better?  Iron ore. That’s because iron ore was required to make the steel for all the rails. Even people like Rockefeller bought out iron ore mines as a way to profit from that trend. Or imagine if you’d owned oil stocks back in 1895 when gasoline was invented and patented. A massive new market opened up for this commodity. So when you get this leading edge of really big trends unfolding, there’s always a commodities implication. Everything that we use on Earth is grown or dug up from the ground. So there’s always something that benefits from these big-picture trends.\n\n&amp;#x200B;\n\nSo there are a few different aspects to the 5G revolution. And they touch on different technologies that are involved and the corresponding commodities. To put it most simply, there is a lot of fiber optic cable that’s involved. 5G thrives on fiber optics to transmit the signal. So there’s a whole network across America and across the world of new fiber optic cable that needs to be laid. Now, most people are aware of that. But what we don’t think about as much is that the cable that’s required for 5G is different than the cable we’ve used in the past.\n\n \n\nWell, the specific metal that I’m talking about in regard to 5G fiber optics is called erbium. Most people haven’t heard of erbium, but it’s actually part of a larger group of metals that many investors also aren’t familiar with. I’m talking about rare earth metals. So rare earth metals became prominent almost a decade ago, when China suddenly cut off exports… and some of the prices for rare earth metals like promethium rocketed 1,000% *in a matter of months*. Share prices of rare earth companies went up 10,000% in some cases. That type of gain is hard to wrap your head around. But for perspective, that means a $100 investment would have turned into $10,000. $1,000 would have turned into $100,000… And a $10,000 investment would have made you a millionaire. Another way to think about it is that shareholders in tiny rare earth stocks made more in a few months than Apple shareholders made in the prior 16 years of Apple gains – combined. It was a crazy time… and now we have a shot for similar gains by betting on the right rare earth companies. Things haven’t really even started picking up big time, and my subscribers are already up over 53% on one of my rare earth elements picks… and up nearly 150% on the other. And that’s in less than two months.",
      "title": "Best Way to Play 5G",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 17,
      "created_utc": 1577940829
    },
    {
      "selftext": "Hey all, hope your years are off to a good start!\n\nJust wanted to check that I understand two things correctly. \n\n1. The general consensus is that holding cash waiting for a specific stock to dip in price is a bad idea, because time in the market is better then timing the market right? \n\n2. If you do think a stock is going to dip, and you want to hold money to buy in at a lower point, but you don't want cash to just sit there, is it smart to put that money into something really liquid like SPY and when the time comes, sell off some of SPY to buy the stock when it dips?\n\nI think my understanding on the first point is right, but a family member asked me about the second question earlier today and I wasn't 100% sure so I wanted to check to make sure I'm on the right track!",
      "title": "Checking my understanding about cash",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 5,
      "created_utc": 1577944796
    },
    {
      "selftext": " Hi guys, I'm 100% a beginner to stock trading, but I like to do my research and I know I could get really into it. I'm 15 living in Australia and I know that the easiest way will be to set up a custodian account. Which trading platform would be the best to use, with the lowest commission and account minimum? Also, if anyone has any tips about trading in general at a young age, that'd be helpful. Thanks",
      "title": "How to start trading at 15?",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 0,
      "created_utc": 1577949159
    },
    {
      "selftext": "[removed]",
      "title": "20 year old Canadian Beginner and looking for some advice",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 0,
      "created_utc": 1577949278
    },
    {
      "selftext": "The stock has basically hovered around the same price for the past 4 years. Is there anything going on with this stock? I haven't been super involved in the stock market recently. I have this stock sitting in my account and want to get an idea of what the status of this stock is. What are your thoughts on the stock?",
      "title": "Thoughts on FireEye (FEYE)?",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 4,
      "created_utc": 1577950292
    },
    {
      "selftext": "You have no choice and must pick one stock to put all of your money in for 10 years.",
      "title": "If you were forced to put all of your money into one stock and leave it there for the next 10 years, where would you put it?",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 521,
      "created_utc": 1577950435
    },
    {
      "selftext": "[Link](https://imgur.com/q40GMN2) to my performance chart\n\n* **Data Source**: Google Finance\n* **Tool**: Google Sheets and Script Editor.\n* My portfolio as of 2018/12/31 is [here](https://imgur.com/wxloph4)\n* My portfolio as of 2019/12/31 is [here](https://imgur.com/a/hVXax1y)\n* [Reddit post](https://www.reddit.com/r/dataisbeautiful/comments/eiux16/oc_i_charted_my_second_full_year_of_investing/) link to cross post\n* [Reddit post link](https://www.reddit.com/r/dataisbeautiful/comments/abfjmr/oc_i_charted_my_first_full_year_of_investing/) to 1st year results post\n* [Link](https://imgur.com/a/CBWT99W) to 2 years combined results\n\nFind below the rationale behind choice of each index:\n\n1. **Portfolio**: My portfolio which has changed over the year.\n2. **S&amp;P 500**:    Standard &amp; Poor's top 500 US companies by market cap. It is one  of   the most commonly followed equity index, and many consider it one  of  the  best representations of the U.S. stock market, and a bellwether  for  the  U.S. economy\\[[S&amp;P 500 wikipedia entry](https://en.wikipedia.org/wiki/S%26P_500_Index)\\].\n3. **DJIA**: Dow Jones Industrial Average is the average of 30 *significant* companies. It is the oldest and single most watched index in the world\\[[Dow Jones Industrial Average - DJIA](https://www.investopedia.com/terms/d/djia.asp)\\].\n4. **NASDAQ**: The Nasdaq-100 Index includes 100 of the largest domestic and international non-financial companies listed on *The Nasdaq Stock Market* based on market capitalization\\[[NASDAQ 100](https://www.nasdaq.com/markets/indices/nasdaq-100.aspx)\\]. Nasdaq 100 is dominated by tech companies accounting for *54%* of the index\\[[Tech importance in NASDAQ 100](https://www.investopedia.com/terms/n/nasdaq100.asp)\\].    This 54% does not include companies like Amazon which is generally    regarded as tech but is considered otherwise in financial circles.    Nasdaq 100 aligns well with my portfolio since my portfolio is tech    heavy too.\n5. **NYSE**: The NYSE Composite (*$NYA*) is a stock market index covering all common stock listed on the New York Stock Exchange\\[[NYSE Composite](https://en.wikipedia.org/wiki/NYSE_Composite)\\]. I used this as a proxy for the stocks in *NYSE*. As expected this performed the worst since it is a composite index.\n6. **VGT**:    Vanguard Information Technology ETF seeks to track the performance of  a   benchmark index that measures the investment return of stocks in  the   information technology sector\\[[VGT](https://investor.vanguard.com/etf/profile/VGT)\\].    An argument can be made whether this is the best performing tech ETF.    With the gift of hindsight, clearly it is not. I felt that the   companies  constituting this etf represents the whole gamut of tech   companies in  comparison to more specific tech ETFs like *IGV*, *SOXX* or *XSW*.\n\n* Please DM me for script code",
      "title": "[OC][x-post r/dataisbeautiful] I charted my second full year of investing compared against various indices",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 2,
      "created_utc": 1577950598
    },
    {
      "selftext": "This is the daily discussion, so anything stocks related is fine, but the theme for today is on stock options, but if options aren't your thing then just ignore the theme and/or [post your arguments against options here](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+semiannual+arguments+against+TA%22&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) and not in the current post.\n\nSome helpful day to day links, including news:\n\n* [Finviz](https://finviz.com/quote.ashx?t=amd) for charts, fundamentals, and aggregated news\n* StreetInsider news:\n  * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing\n  * [Corporate News](https://www.streetinsider.com/Corporate+News)\n  * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n  * [Economic data](https://www.streetinsider.com/Economic+Data)\n  * [FED](https://www.streetinsider.com/Fed) - Federal Reserve news\n\n-----\n\nRequired info to start understanding options:\n\n* [Call option Investopedia video](https://www.investopedia.com/terms/c/calloption.asp) basically a call option allows you to buy 100 shares of a stock at a certain price (strike price), but without the obligation to buy\n* [Put option Investopedia video](https://www.investopedia.com/terms/p/putoption.asp) a put option allows you to sell 100 shares of a stock at a certain price (strike price), but without the obligation to sell\n\nSee the following word cloud and click through for the wiki:\n\n[Call option - Put option - Exercising an option - Strike price - ITM - OTM - ATM - Long options - Short options - Combo - Debit - Credit or Premium - Covered call - Naked - Debit call spread - Credit call spread - Strangle - Iron condor - Vertical debit spreads - Iron Fly](https://www.reddit.com/r/stocks/wiki/options-themed-post)\n\nIf you have a basic question, for example \"what is delta,\" then google \"investopedia delta\" and click the investopedia article on it; do this for everything until you have a more in depth question or just want to share what you learned.\n\nSee our past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)  Also links for:  [Technicals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Atechnicals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Tuesday, [Options Trading](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoptions&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Thursday, and [Fundamentals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Afundamentals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Friday.",
      "title": "r/Stocks Daily Discussion &amp; Options Trading Thursday - Jan 02, 2020",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 10,
      "created_utc": 1577952368
    },
    {
      "selftext": "https://www.bloomberg.com/graphics/2020-investment-outlooks/\n\nOne of the best articles I have come across, summarizes most majors firms outlook for 2020\n\nDefinitely worth a look and it’s the beginning of the month so hopefully people won’t get stuck behind a paywall since Bloomberg allows 3 free articles a month.\n\nDefinitely take a look if you want a better idea on how to diversify your portfolio for 2020",
      "title": "Almost everything Wall Street expects in 2020",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 4,
      "created_utc": 1577956414
    },
    {
      "selftext": "I thin that virtual reality will be big in the future, in videogames and idk where else but I think it'll grow.\n\nWhat are some stock linked to virtual reality you think will grow?\n\nI know FB owns Oculus but outside of that I know nothing.",
      "title": "VR stocks",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 4,
      "created_utc": 1577957112
    },
    {
      "selftext": "Reading https://www.investopedia.com/ask/answers/04/050604.asp and it says 35 days after quarter ends and 60 days after fiscal year ends. However a company i follow is consistently reporting over 30 days after their quarter ends. Are these business days? is the article wrong? are the rules not enforced? Is the company secretly being fined? All of the above?",
      "title": "When must a company report quarterly earnings?",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 2,
      "created_utc": 1577957360
    },
    {
      "selftext": "[removed]",
      "title": "How do you think what companies (stocks) will receive the largest profit from 5g technology for the next decade?",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 1,
      "created_utc": 1577961850
    },
    {
      "selftext": "I have been trying to research this but my posts get deleted because I give too much information about the company and how it works then the moderators think I'm trying to recruit.. so what should I do to figure out if a company is legit or not..the CEO and employees show their faces and also their offices and they definitely sound like they know what they're talking about in interviews, but there is an MLM style referral system, from what I seen, people think that if it's got a MLM referral system then it MUST be a ponzi.. but it doesn't really seem to be one because you can just let your money sit and get a small % per day, averaging currently 5.7% or so monthly profit.  \n\n\nThe profits are (supposedly) generated through trading arbitrage and scalping algorhitms..\n\nSo my question is, are there some experts out there that may be able to help me ?\n\n  \nOr maybe some association even ?\n\nLike I said I tryed to post this in 2 other reddits and it got deleted, aswell as a discord server..",
      "title": "How to know if a \"auto trading bot\" company is legit or not ?",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 12,
      "created_utc": 1577962354
    },
    {
      "selftext": "I was lucky enough to start buying UTX last Jan. at around $127 a share. It dropped a little more after that and I bought more, then it starting going up and I bought a few more. Currently I'm up almost 15% and the fact that it's about to have two spinoffs and a mega merger with Raytheon makes me believe there's a lot to still be eager for. Anything one like this one?",
      "title": "I feel like UTX doesn't get enough love, and I think it's one of 2020's most exciting stocks.",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 0,
      "created_utc": 1577965431
    },
    {
      "selftext": "Please check out my first of a weekly blog post where I summarise and analyse for you any recent fundamental trends which should drive medium to long term stock market returns.\n\n[Market outlook 2020 week 1](https://realstevodaniel.wordpress.com/2020/01/02/market-outlook-2020-week-1/)",
      "title": "Market outlook 2020 week 1",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 0,
      "created_utc": 1577965608
    },
    {
      "selftext": "What do you guys think of Turbos / Speeders / Sprinters? and do you recommend it ?\n\nFairly new into stock and learning every bit by bit :)\n\nHappy trading",
      "title": "Turbo / Speeder / Sprinter - Recommend it ?",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 0,
      "created_utc": 1577968779
    },
    {
      "selftext": "Any thoughts on Onconova? They set up 18$ dollar target for this year, is it a buy today? ;)",
      "title": "ONTX Stock",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 14,
      "created_utc": 1577970780
    },
    {
      "selftext": "**Read Carefully**: Most on this page DO NOT delve into penny stocks. But those that do or have thought about it, this is a great stock to make money on!! $$$$$$$ To learn more about the background of each major stakeholder and the company, please check out a website that was created to collate what we know about the company [MILV CCA Biotech](https://ccabiotech.blogspot.com/p/home)  \n\n\n1. In late October, the custodian, **Joseph Passaqulua** had a shareholder letter that went out to an older shareholder list.  \n\n\nIn this, it stated that this company called **\"Compelling Competitive Advantage LLC (CCA LLC)\" would merge with MILV**.  \n\n\n2. That CCA LLC had an open contract with **University of Pennsylvania and Childrens Hospital of Philadelphia**  \n\n\nInterestingly enough, a bunch of us needed to know more about this company and so the digging began.  \n\n\nWe found an old company by the name of Endeavor IP (more recently NanoLife Health) was 90% owned by CCA. **The major shareholders of the company were listed:**  \n\n\n1. **James B. Hovis** (sold multiple drinking lines e.g. AQUISS Beverage to Egg. Co)\n2.   \n**Edward J. Mathias** (Senior Adviser to one of the WORLDS largest investment firms -- The Carlyle Group -- Assets $211 billion **AND AND AND A TRUSTER EMERITUS for University of Penn**... interesting)\n3.   \n**Michael W. Fountain** \\-- **(microbiologist in liposome research \"a vehicle compound\", has 181 products, 131 international and domestic patents, sold a company for $575 million The Liposome Company) to Elan Corp.)**\n4.   \n**Larry Kubin** (Two time superbowl champion with Washington Redskins and advocate and spokesperson for traumatic brain injury)\n5.   \n**Stuart Yarbrough** (Crosshill Financial Group -- takes startups and gives them the money to build a successful company and makes them look good for big company acquisitions).  \n\n\nWhat this means is that you have a lot of successful people and big names coming together to build a BIOTECH company to utilize MICHAEL W. FOUNTAINs patents for brain trauma therapy, recovery, prevention/  \n\n\n**\\*\\*\\*\\*\\*He developed a carrier drug (liposome) that can pass through the BBB - Blood Brain Barrier and deliver highly targeted drugs to neurons prior to neuronal necrosis\\*\\*\\*\\*\\***  \n\n\nREAD ABOUT IT: [MILV CCA Biotech](http://ccabiotech.blogspot.com/)",
      "title": "$MILV -&gt; CCA LLC -- Biotech Merger Inbound -- **PennyStock**",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 3,
      "created_utc": 1577973186
    },
    {
      "selftext": "https://www.cnbc.com/2020/01/02/wall-street-is-optimistic-on-disney-plus-subscriber-numbers-into-2020.html\n\nRosenblatt Securities analysts raised subscriber estimates for Disney+ to 25 million users by the end of the first quarter of 2020.\n\nBank of America analysts said that Disney’s current long-term growth projections for Disney+ appear to be low.\n\nDisney has said it will not disclose its subscriber numbers again until its next quarterly report in February.",
      "title": "Disney shares start 2020 in the green as Wall Street sees big Disney+ subscriber numbers",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 13,
      "created_utc": 1577974792
    },
    {
      "selftext": "5 years ago i predicted an enormous boost to stock prices till 2020.\nBut current interest rates are not what i expected.\nSo how do you see the stock market going in 2020 and beyond?",
      "title": "Bear or Bull market in 2020?",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 12,
      "created_utc": 1577976657
    },
    {
      "selftext": "I keep wanting to wait for a dip but it keeps going up. Looking at the graph, it's been on an upward trend for a while. Surely a dip to $250 is coming?? But what do I know. Really want to hop on this train. I have $10,000 I can invest this year so far, and want to put at least 2k into apple. Can anyone advise?",
      "title": "Apple running high? Buy now or wait for dip?",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 19,
      "created_utc": 1577976991
    },
    {
      "selftext": "When the yield curve inverted last year, the fed opened up the overnight repo operations and the banks have been in a feeding frenzy with repurchases. Everyday has put the Fed oversubscribed by billions, which have increased the fed balance sheet by trillions. How are we not living through the beginning stages of inflation?\n\nThe US dollar has shown signs of weakness when pitted against global currencies. \n\n[China appears to be moving away from the dollar as an indicator of currency strength](https://www.scmp.com/economy/china-economy/article/3044353/chinas-cut-us-dollar-weighting-key-index-will-boost-global)\n\nAm I looking at this all wrong? I am not an economist, Im a regular guy trying to understand what is propping up the markets with the extensive retractions weve seen in manufacturing and retail.",
      "title": "The Dow &amp; commodities are up w/jobless claims upticking, manufacturing down, how is this not a sign of inflation from the Fed printing more money?",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 24,
      "created_utc": 1577977284
    },
    {
      "selftext": "Twitter?\n\nWhose twitter?  Elon? Doesn’t he usually retweet come one else?\n\nNothing on google telling me where...",
      "title": "What should I be refreshing for TSLA Delivery numbers?",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 2,
      "created_utc": 1577977709
    },
    {
      "selftext": "Good morning fellow Redditers!\n\nI am looking to start investing in the stock market, but would like to gain some knowledge prior to investing. What are some sources I can refer to, or general advice you can provide to assist me in my journey? Any information is appreciated!\n\nThank you,",
      "title": "Getting Into The Stock Market",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 4,
      "created_utc": 1577979660
    },
    {
      "selftext": "I use TD Ameritrade, and I had set up a limit order for a stock at $62.99, and this morning it was down to $60.80 something, so below my limit price. I saw that the order was not executed since I didn’t have anymore shares than I did last week. So I was initially really confused but then decided to cancel my order. It says it was submitted for cancellation, but every time I reload the orders page, my limit order is still there. What is going on?",
      "title": "What happens when a limit order didn’t go through? Why?",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 3,
      "created_utc": 1577979791
    },
    {
      "selftext": "Will you stick to your plan, or will you hop back in if there is no end in sight to this crazy uptrend? \n\nNot looking for \"Time in market is better than timing the market\" lectures",
      "title": "People sitting on a lot of cash, what signal are you waiting for?",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 211,
      "created_utc": 1577980240
    },
    {
      "selftext": "[removed]",
      "title": "Might have found out #banktank's next play - (pic inside)",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 0,
      "created_utc": 1577980733
    },
    {
      "selftext": "Just got a deal, looks to be promised for a run very soon!\nLet me know your thoughts",
      "title": "$TLRY",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 8,
      "created_utc": 1577980984
    },
    {
      "selftext": "[removed]",
      "title": "First time investor, not sure where to start. Help?",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 0,
      "created_utc": 1577982172
    },
    {
      "selftext": "I really miss this unbiased view of the market😭",
      "title": "Anyone sad Nightly Business Report is gone?",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 11,
      "created_utc": 1577983629
    },
    {
      "selftext": "I'm interested to know if anyone has seen any reliable forecasts for the 2020 outturn for the FTSE 100,250,S &amp; P, Dow and NASDAQ?. Instinct tells me it will ebb and flow and end round about where it is now",
      "title": "Anyone seen any 2020 year end Stock Market Predictions?",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 1,
      "created_utc": 1577984344
    },
    {
      "selftext": "[removed]",
      "title": "How do i YOLO my 500€ ?",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 0,
      "created_utc": 1577985000
    },
    {
      "selftext": "\nI’m about open my first account and am wondering which will be better. I like TD ameritrade because of TOS and have some familiarity because I have done some paper trading in TOS. My father uses Vanguard however and not sure which I should do. Does Vanguard have something close to TOS? 90% of the account will be in various etfs and a couple stocks I like and then the last 10% will be play money for me to trade options and eventually futures.",
      "title": "TD Ameritrade or Vanguard?",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 17,
      "created_utc": 1577985092
    },
    {
      "selftext": "I got 500€ on DEGIRO and I don't want to invest them since even if i get super high %gainz it still won't be that much, so I want to try and multiply them with a Y0️⃣L0️⃣.\n\nNote that I'm in Europe so I dont have access to US options and can't short US stocks, I could use CFDs but I don't understand them very well, I just know the basics.\n\nMy idea is shorting gamestop since it seems to have a recurring pattern of going up to 6.20$ (on average) and then down to 5.50$ (on average).",
      "title": "How do i Y0️⃣L0️⃣ my 500€ ?",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 12,
      "created_utc": 1577985097
    },
    {
      "selftext": "I've checked out Quandl and Alpha Vantage, they seem good but clunky because AFAIK the API needs the symbol specified, so I have to cycle through every symbol and its just a waste of time and bandwidth.\n\nAnybody here can recommend a service where I can get all EOD prices in bulk for all symbols per day?",
      "title": "API to bulk download all symbols daily EOD?",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 7,
      "created_utc": 1577986505
    },
    {
      "selftext": "Is there an app or browser extension that will track in real time or near real time the value? I have investments with 5 different brokers (Im not addressing this but there are reasons) and while it's easy for me to track stock prices it's not very easy for me to track the value of my positions. \n\nIdeally I should be able to put the ticker symbol in and the total number of shares I own. For instance AAPL x 75 shares and then I get a total that updates as the stock price changes even though I might have 30 AAPL shares with brokerage A and 45 AAPL shares with brokerage B.",
      "title": "An app that will track value of holdings in real time",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 15,
      "created_utc": 1577987308
    },
    {
      "selftext": "AMD has skyrocketed in recent weeks. Should I go in now? Or are the gains a mirage and I should wait for it to drop to a better price in the future?",
      "title": "AMD",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 23,
      "created_utc": 1577987377
    },
    {
      "selftext": "[deleted]",
      "title": "Never ever ever trust what you hear in /r/thecannalysts. They are a bunch of biased fools.",
      "total_awards_received": 0,
      "score": 0,
      "num_comments": 1,
      "created_utc": 1577988673
    },
    {
      "selftext": "[removed]",
      "title": "I’m new to investing in stocks, but I’ve researched into a ticker (JD) that looks to have very high expectations. But when I look at others portfolios I don’t think I’ve seen it once so I’m wondering if I’m missing something?",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 0,
      "created_utc": 1577989104
    },
    {
      "selftext": "That’s all. You have been warned. Personally I’m happy that they’re losing money hand over fist. You reap what you sow.\n\nThey are delusional, and I’ve actually made quite a bit of money taking the opposite of what they say and investing accordingly. Their analysis consists of the intellect of a Southern baptist pastor.",
      "title": "Never ever ever trust what you hear in /r/thecannalysts. They are a bunch of biased fools. : stocks",
      "total_awards_received": 0,
      "score": 0,
      "num_comments": 8,
      "created_utc": 1577989276
    },
    {
      "selftext": "I have been paying attention to a couple solar Stocks and ETF's recently and came across this beast of a stock.  Its called Solar Edge (SEDG).  I just saw it hit $100 today.  Any opinions on this stock before I buy into it?",
      "title": "So I think I found my favorite solar stock",
      "total_awards_received": 0,
      "score": 18,
      "num_comments": 48,
      "created_utc": 1577989614
    },
    {
      "selftext": "Hey guys , my first time on a stock app , thows are ok or is just a demo , can somebody explain me , thx. (Sorry for my english)\nhttps://imgur.com/aQEpK4R",
      "title": "First time",
      "total_awards_received": 0,
      "score": 0,
      "num_comments": 4,
      "created_utc": 1577989805
    },
    {
      "selftext": "Hi all, I'm new to this sub. \n\nBut I have a question, I heard some guy talk about an investor who did what he called Return OF investment. \nIt was something like if he put 100k into a stock and then watched the stock rise until he had 150k (for example) and then he would pull out the original 100K and so he would be left with 50K worth of essentially free stocks...\n\ncould what work in real life, is it a thing? and if so does that technique have a name? (so I can look it up and learn more about it...like is there a system to it? what would I need to know to do a trade like that?)",
      "title": "Return OF investment",
      "total_awards_received": 0,
      "score": 0,
      "num_comments": 12,
      "created_utc": 1577991076
    },
    {
      "selftext": "**COLLEGE STUDENT** not a TON of cash \n\nI got into AMD at $45 per share and I’ve made $70 today. Should I withdraw now? I do know fridays are usually a sell off day. Should I wait it out for the earnings report or sell now and buy back tomorrow for cheaper?  THANKS!",
      "title": "What should I do with today’s earnings?",
      "total_awards_received": 0,
      "score": 0,
      "num_comments": 20,
      "created_utc": 1577993726
    },
    {
      "selftext": "[deleted]",
      "title": "KEG, a stock once valued at $200,000 is now $0.22",
      "total_awards_received": 0,
      "score": 0,
      "num_comments": 4,
      "created_utc": 1577993921
    },
    {
      "selftext": "If I buy leveraged contracts can i sell them before market close? What happens if I hold them after market close?",
      "title": "If I buy leveraged contracts can i sell them before market close? What happens if I hold them after market close?",
      "total_awards_received": 0,
      "score": 0,
      "num_comments": 0,
      "created_utc": 1577994094
    },
    {
      "selftext": "[deleted]",
      "title": "Undervalued Stocks to watch in 2020 (&lt;$75)",
      "total_awards_received": 0,
      "score": 0,
      "num_comments": 16,
      "created_utc": 1577995800
    },
    {
      "selftext": "I'm new to investing so my question might be very ELI5.\n\nI've long had the goal to do impact investing, for instance by buying funds, ETFs or individual stocks that are ESG rated or appear to have some positive effect in the world (e.g. clean energy).\n\nBut does holding, say, a clean energy portfolio actually help those companies or not?\n\nI always thought that when the price of a stock goes up, say from 100 to 120, that company then has 20 more capital to invest. But I just learned that companies only earn actual cash from shares during the IPO, and then anything after is all secondary market. \n\nIf I buy a clean energy ETF, does that help there being more clean energy in the world? Do those companies get access to cheaper capital at all? How should I think about this?\n\nThanks!",
      "title": "Question about impact investing",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 1,
      "created_utc": 1577996070
    },
    {
      "selftext": "Where should I put this 10k. Invest? Or keep it cash.",
      "title": "Just got 10,000$. What am I investing in",
      "total_awards_received": 0,
      "score": 22,
      "num_comments": 263,
      "created_utc": 1577998098
    },
    {
      "selftext": "Are you planning on investing in anything for the new year? If so, what stocks specifically and when?\n\nI’m looking into AMD and TSLA, but both seem to be at their highs (AMD looking a bit volatile) right now so I may wait to find a dip before investing.",
      "title": "What stocks are you investing in soon for 2020?",
      "total_awards_received": 0,
      "score": 13,
      "num_comments": 44,
      "created_utc": 1577998170
    },
    {
      "selftext": "Sorry if this is a dumb question but I can't find any info online.\n\nIs it possible to place orders for less than 100 shares in Thinkorswim? If not, is there a broker that allows this?",
      "title": "Odd Lot Orders",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 4,
      "created_utc": 1577999002
    },
    {
      "selftext": "The S&amp;P 500 surged 29% in 2019, its best return since 2013. I beat the market by posting a gain of 167% in 2019.\n\nI posted some of my picks last year. Feel free to check out my post history for more.\n\n* [Tech/Software](https://www.reddit.com/r/stocks/comments/apai9i/techenterprise_saas_cloud_stocks_er_dates_2019/)\n* [Fintech/Payments/E-commerce](https://www.reddit.com/r/stocks/comments/b057ft/fintech_payments_ecommerce_crossborder_trade_sq/)\n\nI want to point out that my biggest gains are attributed to my plays in biotech/healthcare ([CVRS](https://www.reddit.com/r/stocks/comments/b35afo/cvrs_sleeping_giant_in_robotics_surgery/), [GH](https://www.reddit.com/r/stocks/comments/aqrxof/guardant_health_gh_blood_test_that_detects_cancer/)). CVRS ran from $1.30 and eventually got bought out at $4.25/share. Guardant Health ran from $30 to $112 with blow-out earnings quarter after quarter.\n\nAs the bull market charges into 2020, here are 3 stocks under $20 billion market cap that I'm bullish about. Let me know if you enjoy these types of posts, and I'll come out with more picks in my portfolio!\n\n**Guardant Health (**[**$GH**](https://finviz.com/quote.ashx?t=GH&amp;ty=c&amp;ta=1&amp;p=d)**):**\n\n\"Guardant Health, Inc. is a precision oncology company. The Company is focused on helping conquer cancer through use of its blood tests, data sets and analytics. It provides Guardant Health Oncology Platform. It provides liquid biopsy tests, such as Guardant360 and GuardantOMNI, for advanced stage cancer. Its liquid biopsy tests fuels its programs developing tests for recurrence and early detection, LUNAR-1 and LUNAR-2. Guardant360 is a molecular diagnostic test that measures 73 cancer-related genes from circulating tumor deoxyribonucleic acid (ctDNA). Its Guardant360 process includes blood collection, laboratory processing, analysis and reporting. Guardant360 is used for a range of applications, including translational science research and identifying target patient populations, drug development and commercialization post-drug approval.\"\n\n**WHY?**\n\nGuardant Health received expanded Medicare coverage for Guardant360, making it the first and only liquid biopsy to be broadly covered for use across the vast majority of advanced solid tumors.(!!!) -- For the Q3 2019 earnings report, Guardant procured an aggressive revenue increased by 181% ($60.8M). The bottom line earnings also improved by the remarkable 92.7%. If Guardant can maintain this momentum, it will generate positive cash flow within the next two to three years. Other catalysts: Monday, January 13 the company will be participating in the upcoming 38th Annual J.P. Morgan Healthcare Conference in San Francisco, CA. Imminent FDA approval within 1-2 years.\n\n**Sea Limited (**[**$SE**](https://finviz.com/quote.ashx?t=SE)**):** \"The Company operates through three segments: digital entertainment, e-commerce and digital financial services. The Company has developed an integrated platform consisting of digital entertainment focused on online games, e-commerce, and digital financial services focused on e-wallet services. Its platforms include Garena, Shopee, and AirPay. Garena provides access to engaging mobile and personal computer (PC) online games, live streaming game play, as well as social features such as user chat and online forums. Shopee is an e-commerce marketplace where users come together to browse, shop and sell on-the-go, anytime, anywhere. AirPay App is the Company’s digital financial services business that provides e-wallet services to consumers through the AirPay App and to small businesses through the AirPay counter application.\"\n\n**WHY?**\n\n[Google Report:](https://techcrunch.com/2018/11/18/google-report-southeast-asias-digital-economy-to-triple-to-240-billion-by-2025/)  Southeast Asia’s digital economy to triple to $240 billion by 2025\n\nSea Limited’s top and bottom lines in 3Q FY 2019 beat previous year’s levels, operating cash flows show huge improvements, Digital Entertainment unit which forms the bulk of Sea Limited’s total revenues saw three-folds jump in top line growth during Q3 2019 to US$329 million, E-commerce unit saw top line growth nearly tripled to $230 million in Q3 2019.\n\n**Progyny (**[**$PGNY)**](https://finviz.com/quote.ashx?t=PGNY&amp;ty=c&amp;ta=1&amp;p=d)**:**\n\n\"Progyny, Inc. operates as a fertility benefits management company in the US with its headquarters in New York City. The Company offers patients a benefits solution with education and guidance from a Patient Care Advocate and access to a network of fertility specialists. Progyny also aims to reduce healthcare costs for employers through their operations.\"\n\n**WHY?**\n\nThe market for fertility coverage has seen significant growth globally with adoption rates picking up given demand seen from top talent. At the time of its IPO listing in 2019, 80 B2B customers (including Facebook, Microsoft, Google) at nearly 100% retention rate, and 1.4 million lives covered (!) The company has only been in operations for a short while, however, has exhibited impressive top-line growth and is already profitable.\n\nEdit 1: Futures are down -200 points. Market might be bloody tomorrow.",
      "title": "Top Stock Picks for 2020",
      "total_awards_received": 1,
      "score": 566,
      "num_comments": 200,
      "created_utc": 1577999191
    },
    {
      "selftext": "So when I googled I am seeing two cd projeck red stocks, one is trading for 19.12 and the other for 67 dollars, why are there two cd projeckt stocks?",
      "title": "Cd projeckt red",
      "total_awards_received": 0,
      "score": 3,
      "num_comments": 7,
      "created_utc": 1577999565
    },
    {
      "selftext": "[removed]",
      "title": "Beginner/Noob seeking basic knowledge on how stocks work",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 0,
      "created_utc": 1577999983
    },
    {
      "selftext": "Do you have a favourite stock from each sector? I personally am bias to the tech and biotech sectors haha but what are your favourites that you plan on getting and holding for this new year?",
      "title": "What’s your favourite stock from each sector that you’re looking to invest this month?",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 2,
      "created_utc": 1578000077
    },
    {
      "selftext": "[removed]",
      "title": "Owning individual stocks in your IRA?",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 0,
      "created_utc": 1578000326
    },
    {
      "selftext": "Happy New Year to all!\n\nI've held on to ENPH through the dip and through the dullness. It bounced up a very nice 12% today. I'm not looking a gift horse in the mouth, but I'm just wondering if there's some company news behind this? A quick news search didn't yield anything on my end.",
      "title": "ENPH New Year's Bounce",
      "total_awards_received": 0,
      "score": 4,
      "num_comments": 4,
      "created_utc": 1578000870
    },
    {
      "selftext": "[removed]",
      "title": "AMD",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 2,
      "created_utc": 1578001263
    },
    {
      "selftext": "I have made over 600 dollars on BABA. Is this too volatile of a stock because it is a Chinese based company. They have an upcoming stock split next year, should I wait until then? I need some advice from more experienced investors.",
      "title": "Should I sell BABA?",
      "total_awards_received": 0,
      "score": 3,
      "num_comments": 27,
      "created_utc": 1578002343
    },
    {
      "selftext": "[removed]",
      "title": "Why is AMD up 7% today?",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 2,
      "created_utc": 1578002633
    },
    {
      "selftext": "Why is AMD up 7% today?\nWhy is AMD up 7% today?\nFiller\nFiller\nFiller",
      "title": "Why is AMD up 7% today?",
      "total_awards_received": 0,
      "score": 0,
      "num_comments": 14,
      "created_utc": 1578002693
    },
    {
      "selftext": "I know everyone's situation is different. But how much ratio-wise should you have invested in stocks vs. just holding on to cash? Including 401k, IRA, and a brokerage account. Maybe it's just because stocks are doing so great lately, but my cash feels like it's losing money by not being invested. Obviously it is via inflation. But ya.",
      "title": "What's a good money:stock ratio for a 32 year old?",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 12,
      "created_utc": 1578003029
    },
    {
      "selftext": "Hey guys, I have been lurking this subreddit for a while and am finally looking to jump into stocks!\n\nThe family and I have a holiday planned in July and I would like to bring a little extra cash with me to make it just a tad more special for the kids.\n\nI currently have roughly $6000 to spend and was thinking about investing it around the 10th-15th of this month\n\nas the investopedia said that's the best time of the month to start investing, which stock would you guys\n\nadvise is the best to jump into?",
      "title": "Looking for advice for my first splash in the stock market",
      "total_awards_received": 0,
      "score": 2,
      "num_comments": 14,
      "created_utc": 1578005095
    },
    {
      "selftext": "I've seen that there are a lot of different leveraged contracts for the same underlying stock and they all have a lot of numbers and codes that I dont understand.\n\nHow do I read them?",
      "title": "How do i read leveraged contracts names?",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 2,
      "created_utc": 1578005493
    },
    {
      "selftext": "[removed]",
      "title": "My robo trading history &amp; comparison",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 0,
      "created_utc": 1578005839
    },
    {
      "selftext": "The Federal Reserve has been increasing the money supply around $60 billion a month since October by purchasing government-backed securities. And this is on top of the repo market loans. The Fed plans on doing these monthly purchases into the second quarter of 2020. \n\nThe Swiss Central Bank has also been purchasing US stocks since the Financial Collapse. My assumption is they are purchasing and then cashing out on US stocks and holding US Dollars for currency manipulation (check out their foreign currency investments—81,000 CHF in 2009 to 804,000 CHF in 2019). \n\nDo you think the actions from central banks will drive the US stock market higher into 2020? I’m curious what the opinions are here. I’ve been seeing plenty of articles out there attributing recent stock market gains to the Fed monetary actions, like this one:\n\nhttps://www.cnbc.com/2019/11/07/the-feds-monetary-juice-has-tied-directly-to-the-rise-in-stocks.html",
      "title": "Bull Market into 2020 from Central Bank Activity?",
      "total_awards_received": 0,
      "score": 8,
      "num_comments": 12,
      "created_utc": 1578006047
    },
    {
      "selftext": "The stock market just rocketed today!! AMD, Amazon, Alphabet, Apple, Facebook, and Tesla all went up!! I hope these stocks continue to rise throughout 2020!!",
      "title": "What a way to start 2020!!",
      "total_awards_received": 0,
      "score": 5,
      "num_comments": 2,
      "created_utc": 1578006372
    },
    {
      "selftext": "I tried 4 different services and set them all to the most aggressive strategies they offered, here are the results:\n\n[M1 Finance](https://www.m1finance.com/) | +14.64%.\n\n[Betterment](https://www.betterment.com/) | +10.88%.  \n[Acorns](https://www.acorns.com/) | +10.53%.  \nWealth Simple | +8.6%.\n\n  \nMarch 19th 2019 — Jan 2nd 2020.  \nOther than M1 Finance performing the best, I prefer their platform because it lets you buy partial stocks of individual companies; if I include the individual companies M1 Finance = +22.84% (AAPL, MSFT, AMZN, GOOG).\n\n  \nI did this mostly out of curiosity. Thoughts on robo traders? Other services worth trying? Currently, I automatically put $10 in each every month. Is that a worthwhile way to passively save/invest?",
      "title": "My robo trading history &amp; comparison",
      "total_awards_received": 0,
      "score": 4,
      "num_comments": 22,
      "created_utc": 1578006511
    },
    {
      "selftext": "I bought FCEL at 0.76, and it’s risen to as much as 2.9, it’s currently at 2.15 and might grow tomorrow, should I reinvest into FCEL with the money I’ve gotten from it?",
      "title": "Was it dumb to sell FCEL at 2.08?",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 8,
      "created_utc": 1578006799
    },
    {
      "selftext": "Curious on all of your thoughts.  IVV seems to outperform SPY on all important metrics (expense, yield, return, etc.).  Why does SPY have such a following?  Thoughts?  One better than the other?\n\nAlso check out https://etfdb.com/tool/etf-comparison/IVV-SPY/#overview for a great head-to-head ETF comparison tool.\n\nThanks!",
      "title": "IVV v. SPY -- Why bother with SPY?",
      "total_awards_received": 0,
      "score": 2,
      "num_comments": 4,
      "created_utc": 1578006905
    },
    {
      "selftext": "I have a portfolio with $7000 in it and I have various other accounts and portfolios. What one stock should I invest in? Spread throughout all my accounts I am very diversified so this $7000 is for one stock. Should I invest in a super dividend ETF... Amazon... google... etc. Thanks!",
      "title": "Portfolio with $7000 to invest",
      "total_awards_received": 0,
      "score": 0,
      "num_comments": 16,
      "created_utc": 1578007504
    },
    {
      "selftext": "[removed]",
      "title": "I've an investing virgin - I've just received #30,000GBP which I can put into stocks... Stupid question, but is it safe to use a broker like Trading 212, Freetrade or Degiro for such a large amount (or even any amount)?",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 0,
      "created_utc": 1578008470
    },
    {
      "selftext": "[removed]",
      "title": "Stocks SOS",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 0,
      "created_utc": 1578009027
    },
    {
      "selftext": "[removed]",
      "title": "Just received 30,000GBP to invest, but never invested before - Absolute amateur... Wondering about security of online brokers such as Trading212 / Freetrade... I'm young and concerned about transferring such a sum of money, but know it's what I want to do.",
      "total_awards_received": 0,
      "score": 1,
      "num_comments": 0,
      "created_utc": 1578009170
    }
  ]
}
